{
    "code": 200,
    "status": "OK.",
    "message": "Success fetching surah.",
    "data": {
        "number": 110,
        "sequence": 114,
        "numberOfVerses": 3,
        "name": {
            "short": "النصر",
            "long": "سورة النصر",
            "transliteration": {
                "en": "An-Nasr",
                "id": "An-Nasr"
            },
            "translation": {
                "en": "Divine Support",
                "id": "Pertolongan"
            }
        },
        "revelation": {
            "arab": "مدينة",
            "en": "Medinan",
            "id": "Madaniyyah"
        },
        "tafsir": {
            "id": "Surat An Nashr terdiri atas 3 ayat, termasuk golongan surat-surat  Madaniyyah yang diturunkan di Mekah sesudah surat At Taubah.  Dinamai An Nashr (pertolongan) diambil dari perkataan Nashr yang  terdapat pada ayat pertama surat ini."
        },
        "preBismillah": {
            "text": {
                "arab": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
                "transliteration": {
                    "en": "Bismillaahir Rahmaanir Raheem"
                }
            },
            "translation": {
                "en": "In the name of Allah, the Entirely Merciful, the Especially Merciful.",
                "id": "Dengan nama Allah Yang Maha Pengasih, Maha Penyayang."
            },
            "audio": {
                "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1",
                "secondary": [
                    "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1.mp3",
                    "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1.mp3"
                ]
            }
        },
        "verses": [
            {
                "number": {
                    "inQuran": 6214,
                    "inSurah": 1
                },
                "meta": {
                    "juz": 30,
                    "page": 603,
                    "manzil": 7,
                    "ruku": 552,
                    "hizbQuarter": 240,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ",
                    "transliteration": {
                        "en": "Iza jaa-a nas rullahi walfath"
                    }
                },
                "translation": {
                    "en": "When the victory of Allah has come and the conquest,",
                    "id": "Apabila telah datang pertolongan Allah dan kemenangan,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6214",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/6214.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/6214.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Wahai Nabi Muhammad, apabila telah datang pertolongan Allah kepadamu dan pengikutmu dalam menghadapi kaum kafir Quraisy, dan telah datang pula kemenangan kepadamu dengan penaklukan Mekah menjadi kota yang suci kembali dari kesyirikan dan kekafiran,",
                        "long": "Dalam ayat-ayat ini, Allah memerintahkan apa yang harus dilakukan Nabi Muhammad pada saat pembebasan Mekah, yaitu apabila ia telah melihat pertolongan Allah terhadap agama-Nya telah tiba, dengan kekalahan orang-orang musyrik dan kemenangan di pihak Nabi, dan melihat pula orang-orang masuk agama Allah beramai-ramai dan berduyun-duyun, bukan perseorangan sebagaimana halnya pada permulaan dakwah.\n\nOrang-orang Arab berkata, \"Manakala Muhammad menang atas penduduk Mekah yang mana Allah telah selamatkan mereka dari pasukan bergajah, maka kalian tidak berdaya melawannya.\" Akhirnya mereka masuk Islam berduyun-duyun, berkelompok-kelompok dan satu kelompok 40 orang."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 6215,
                    "inSurah": 2
                },
                "meta": {
                    "juz": 30,
                    "page": 603,
                    "manzil": 7,
                    "ruku": 552,
                    "hizbQuarter": 240,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا",
                    "transliteration": {
                        "en": "Wa ra-aitan naasa yadkhuloona fee deenil laahi afwajah"
                    }
                },
                "translation": {
                    "en": "And you see the people entering into the religion of Allah in multitudes,",
                    "id": "dan engkau melihat manusia berbondong-bondong masuk agama Allah,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6215",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/6215.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/6215.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "dan engkau lihat manusia dari seluruh penjuru Jazirah Arab berbondong-bondong masuk agama Allah, yakni agama Islam, setelah sebelumnya mereka masuk Islam secara perorangan,",
                        "long": "Dalam ayat-ayat ini, Allah memerintahkan apa yang harus dilakukan Nabi Muhammad pada saat pembebasan Mekah, yaitu apabila ia telah melihat pertolongan Allah terhadap agama-Nya telah tiba, dengan kekalahan orang-orang musyrik dan kemenangan di pihak Nabi, dan melihat pula orang-orang masuk agama Allah beramai-ramai dan berduyun-duyun, bukan perseorangan sebagaimana halnya pada permulaan dakwah.\n\nOrang-orang Arab berkata, \"Manakala Muhammad menang atas penduduk Mekah yang mana Allah telah selamatkan mereka dari pasukan bergajah, maka kalian tidak berdaya melawannya.\" Akhirnya mereka masuk Islam berduyun-duyun, berkelompok-kelompok dan satu kelompok 40 orang."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 6216,
                    "inSurah": 3
                },
                "meta": {
                    "juz": 30,
                    "page": 603,
                    "manzil": 7,
                    "ruku": 552,
                    "hizbQuarter": 240,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ ۚ إِنَّهُ كَانَ تَوَّابًا",
                    "transliteration": {
                        "en": "Fa sab bih bihamdi rabbika was taghfir, innahu kaana tawwaaba"
                    }
                },
                "translation": {
                    "en": "Then exalt [Him] with praise of your Lord and ask forgiveness of Him. Indeed, He is ever Accepting of repentance.",
                    "id": "maka bertasbihlah dalam dengan Tuhanmu dan mohonlah ampunan kepada-Nya. Sungguh, Dia Maha Penerima tobat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6216",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/6216.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/6216.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "maka sebagai ungkapan syukur kepada Allah atas karunia-Nya yang agung itu, bertasbihlah dan sucikanlah Tuhanmu dari sifat-sifat yang tak layak bagi-Nya, dan sertailah tasbihmu itu dengan memuji Tuhan-mu yang telah menyokongmu dalam menaklukkan Mekah, dan mohonlah ampunan kepada-Nya untukmu dan umatmu. Sungguh, Dia Maha Penerima tobat hamba-hamba-Nya yang bertasbih dan beristigfar. Membaca tasbih, tahmid, dan istighfar adalah cara yang mulia ketika seseorang meraih kesuksesan karena pada hakikatnya Allah-lah yang memberi kesuksesan itu kepadanya, bukan dengan berpesta dan berfoya-foya.",
                        "long": "Bila yang demikian itu telah terjadi, Nabi diperintahkan untuk mengagungkan dan mensucikan Tuhannya dari hal-hal yang tidak layak bagi-Nya, seperti menganggap terlambat datangnya pertolongan dan mengira bahwa Tuhan tidak menepati janji-Nya menolong Nabi atas orang-orang kafir.\n\nMenyucikan Allah hendaknya dengan memuji-Nya atas nikmat-nikmat yang dianugerahkan-Nya dan mensyukuri segala kebaikan-kebaikan yang telah dilimpahkan-Nya dan menyanjung-Nya dengan sepantasnya. Bila Allah Yang Mahakuasa dan Mahabijaksana memberi kesempatan kepada orang-orang kafir, bukanlah berarti Dia telah menyia-nyiakan pahala orang-orang yang beramal baik.\n\nKemudian Nabi Muhammad dianjurkan untuk meminta ampun kepada Allah untuk dirinya dan sahabat-sahabatnya yang telah memperlihatkan kesedihan dan keputusasaan karena merasa pertolongan Allah terlambat datangnya. Bertobat dari keluh-kesah adalah dengan mempercayai penuh akan janji-janji Allah dan membersihkan jiwa dari pemikiran yang bukan-bukan bila menghadapi kesulitan. Hal ini walaupun berat untuk jiwa manusia biasa, tetapi ringan untuk Nabi Muhammad sebagai insan kamil (manusia sempurna). Oleh sebab itu, Allah menyuruh Nabi saw memohon ampunan-Nya.\n\nKeadaan ini terjadi pula pada para sahabat yang memiliki jiwa yang sempurna dan menerima tobat mereka, karena Allah selalu menerima tobat hamba-hamba-Nya. Allah mendidik hamba-hamba-Nya melalui bermacam-macam cobaan dan bila merasa tidak sanggup menghadapinya harus memohon bantuan-Nya serta yakin akan datangnya bantuan itu. Bila ia selalu melakukan yang demikian niscaya menjadi kuat dan sempurnalah jiwanya.\n\nMaksudnya, bila pertolongan telah tiba dan telah mencapai kemenangan serta manusia berbondong-bondong masuk Islam, hilanglah ketakutan dan hendaklah Nabi saw bertasbih menyucikan Tuhannya dan mensyukuri-Nya serta membersihkan jiwa dari pemikiran-pemikiran yang terjadi pada masa kesulitan. Dengan demikian, keluh-kesah dan rasa kecewa tidak lagi akan mempengaruhi jiwa orang-orang yang ikhlas selagi mereka memiliki keikhlasan dan berada dalam persesuaian kata dan cinta sama cinta.\n\nDengan turunnya Surah an-Nasr ini, Nabi memahami bahwa tugas risalahnya telah selesai dan selanjutnya ia hanya menunggu panggilan pulang ke rahmatullah. \n\nIbnu 'AbbAs berkata: \"Ketika turun ayat Idha jaa nasrullahi wal fath, Rasulullah saw memanggil Fatimah, lalu berkata: \"Kematian diriku sudah dekat.\" Fatimah pun menangis. Rasulullah saw berkata, \"Jangan menangis, karea kamu adalah anggota pertama dari keluargaku yang akan menyusulku.\" Fatimah pun tertawa bahagia (mendengarnya). Para istri Nabi saw yang melihat hal itu berkata, \"Wahai Fatimah, kami melihatmu menangis lalu tertawa.\" Fatimah berkata, \"Rasulullah saw memberitahuku bahwa kematian dirinya telah dekat, maka aku menangis. Namun, beliau mengatakan, \"Jangan menangis, karena kamu adalah anggota pertama dari keluargaku yang akan menyusulku.\" Maka aku pun tertawa bahagia. (Riwayat al- Darimi)\n\nIbnu 'Umar berkata, \"Surah ini turun di Mina ketika Nabi mengerjakan Haji Wada', sesudah itu turun firman Allah:\n\nPada hari ini telah Aku sempurnakan agamamu untukmu, dan telah Aku cukupkan nikmat-Ku bagimu, dan telah Aku ridai Islam sebagai agamamu. (al-Ma'idah/5: 3)\n\nNabi hidup hanya delapan puluh hari setelah turun ayat ini. Kemudian setelah itu, turun ayat Kalalah, dan Nabi hidup sesudahnya lima puluh hari. Setelah itu turun ayat:\n\nSungguh, telah datang kepadamu seorang rasul dari kaummu sendiri. (at-Taubah/9:128)\n\nMaka Nabi saw hidup sesudahnya tiga puluh lima hari. Kemudian turun firman Allah:\n\nDan takutlah pada hari (ketika) kamu semua dikembalikan kepada Allah. (al Baqarah/2: 281)\n\nMaka Nabi saw hidup sesudahnya hanya dua puluh satu hari saja."
                    }
                }
            }
        ]
    }
}