{
    "code": 200,
    "status": "OK.",
    "message": "Success fetching surah.",
    "data": {
        "number": 114,
        "sequence": 21,
        "numberOfVerses": 6,
        "name": {
            "short": "الناس",
            "long": "سورة الناس",
            "transliteration": {
                "en": "An-Naas",
                "id": "An-Nas"
            },
            "translation": {
                "en": "Mankind",
                "id": "Manusia"
            }
        },
        "revelation": {
            "arab": "مكة",
            "en": "Meccan",
            "id": "Makkiyyah"
        },
        "tafsir": {
            "id": "Surat ini terdiri atas 6 ayat, termasuk golongan surat-surat Makkiyah,  diturunkan sesudah surat Al Falaq. Nama An Naas diambil dari An Naas yang berulang kali disebut dalam surat ini yang artinya manusia."
        },
        "preBismillah": {
            "text": {
                "arab": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
                "transliteration": {
                    "en": "Bismillaahir Rahmaanir Raheem"
                }
            },
            "translation": {
                "en": "In the name of Allah, the Entirely Merciful, the Especially Merciful.",
                "id": "Dengan nama Allah Yang Maha Pengasih, Maha Penyayang."
            },
            "audio": {
                "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1",
                "secondary": [
                    "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1.mp3",
                    "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1.mp3"
                ]
            }
        },
        "verses": [
            {
                "number": {
                    "inQuran": 6231,
                    "inSurah": 1
                },
                "meta": {
                    "juz": 30,
                    "page": 604,
                    "manzil": 7,
                    "ruku": 556,
                    "hizbQuarter": 240,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ",
                    "transliteration": {
                        "en": "Qul a'uzu birabbin naas"
                    }
                },
                "translation": {
                    "en": "Say, \"I seek refuge in the Lord of mankind,",
                    "id": "Katakanlah, “Aku berlindung kepada Tuhannya manusia,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6231",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/6231.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/6231.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Wahai Nabi Muhammad, katakanlah kepada umatmu, “Aku berlindung kepada Tuhan yang menciptakan, memelihara, dan mengurus manusia.",
                        "long": "Dalam ayat ini, Allah memerintahkan Nabi Muhammad termasuk pula di dalamnya seluruh umatnya agar memohon perlindungan kepada Tuhan yang menciptakan, menjaga, menumbuhkan, mengembangkan, dan menjaga kelangsungan hidup manusia dengan nikmat dan kasih sayang-Nya serta memberi peringatan kepada mereka dengan ancaman-ancaman-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 6232,
                    "inSurah": 2
                },
                "meta": {
                    "juz": 30,
                    "page": 604,
                    "manzil": 7,
                    "ruku": 556,
                    "hizbQuarter": 240,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مَلِكِ النَّاسِ",
                    "transliteration": {
                        "en": "Malikin naas"
                    }
                },
                "translation": {
                    "en": "The Sovereign of mankind.",
                    "id": "Raja manusia,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6232",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/6232.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/6232.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Raja manusia, yang mengatur semua urusan mereka, dan Dia Mahakaya sehingga tidak membutuhkan mereka.",
                        "long": "Allah menjelaskan bahwa Tuhan yang mendidik manusia itu adalah yang memiliki dan yang mengatur semua syariat, yang membuat undang-undang, peraturan-peraturan, dan hukum-hukum agama. Barang siapa yang mematuhinya akan berbahagia hidup di dunia dan di akhirat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 6233,
                    "inSurah": 3
                },
                "meta": {
                    "juz": 30,
                    "page": 604,
                    "manzil": 7,
                    "ruku": 556,
                    "hizbQuarter": 240,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِلَٰهِ النَّاسِ",
                    "transliteration": {
                        "en": "Ilaahin naas"
                    }
                },
                "translation": {
                    "en": "The God of mankind,",
                    "id": "sembahan manusia,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6233",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/6233.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/6233.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sembahan manusia, Tuhan yang tidak ada sekutu bagi-Nya. Itulah Tuhan yang patut disembah dan dimintai perlindungan.",
                        "long": "Allah menambah keterangan tentang Tuhan pendidik manusia ialah yang menguasai jiwa mereka dengan kebesaran-Nya. Mereka tidak mengetahui kekuasaan Allah itu secara keseluruhan, tetapi mereka tunduk kepada-Nya dengan sepenuh hati dan mereka tidak mengetahui bagaimana datangnya dorongan hati kepada mereka itu, sehingga dapat mempengaruhi seluruh jiwa raga mereka.\n\nAyat-ayat ini mendahulukan kata Rabb (pendidik) dari kata Malik dan Ilah karena pendidikan adalah nikmat Allah yang paling utama dan terbesar bagi manusia. Kemudian yang kedua diikuti dengan kata Malik (Raja) karena manusia harus tunduk kepada kerajaan Allah sesudah mereka dewasa dan berakal. Kemudian diikuti dengan kata Ilah (sembahan), karena manusia sesudah berakal menyadari bahwa hanya kepada Allah mereka harus tunduk dan hanya Dia saja yang berhak untuk disembah.\n\nAllah menyatakan dalam ayat-ayat ini bahwa Dia Raja manusia. Pemilik manusia dan Tuhan manusia, bahkan Dia adalah Tuhan segala sesuatu. Tetapi di lain pihak, manusialah yang membuat kesalahan dan kekeliruan dalam menyifati Allah sehingga mereka tersesat dari jalan lurus. Mereka menjadikan tuhan-tuhan lain yang mereka sembah dengan anggapan bahwa tuhan-tuhan itulah yang memberi nikmat dan bahagia serta menolak bahaya dari mereka, yang mengatur hidup mereka, menggariskan batas-batas yang boleh atau tidak boleh mereka lakukan. Mereka memberi nama tuhan-tuhan itu dengan pembantu-pembantunya dan menyangka bahwa tuhan-tuhan itulah yang mengatur segala gerak-gerik mereka. Dalam ayat lain, Allah berfirman:\n\nMereka menjadikan orang-orang alim (Yahudi), dan rahib-rahibnya (Nasrani) sebagai tuhan selain Allah, dan (juga) Al-Masih putra Maryam; padahal mereka hanya disuruh menyembah Tuhan Yang Maha Esa; tidak ada tuhan selain Dia. Mahasuci Dia dari apa yang mereka persekutukan. (at-Taubah/9: 31)\n\nDan tidak (mungkin pula baginya) menyuruh kamu menjadikan para malaikat dan para nabi sebagai Tuhan. Apakah (patut) dia menyuruh kamu menjadi kafir setelah kamu menjadi Muslim? (Ali 'Imran/3: 80)\n\nMaksudnya, dengan ini Allah memperingatkan manusia bahwa Dia-lah yang mendidik mereka sedang mereka adalah manusia-manusia yang suka berpikir dan Dia Raja mereka dan Dia pula Tuhan mereka menurut pikiran mereka. Maka tidak benarlah apa yang mereka ada-adakan untuk mendewa-dewakan diri mereka padahal mereka manusia biasa."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 6234,
                    "inSurah": 4
                },
                "meta": {
                    "juz": 30,
                    "page": 604,
                    "manzil": 7,
                    "ruku": 556,
                    "hizbQuarter": 240,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ",
                    "transliteration": {
                        "en": "Min sharril was waasil khannaas"
                    }
                },
                "translation": {
                    "en": "From the evil of the retreating whisperer -",
                    "id": "dari kejahatan (bisikan) setan yang bersembunyi,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6234",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/6234.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/6234.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Aku berlindung kepada-Nya dari kejahatan bisikan setan yang bersembunyi pada diri manusia dan selalu bersamanya layaknya darah yang mengalir di dalam tubuhnya,",
                        "long": "Dalam ayat ini, Allah memerintahkan manusia agar berlindung kepada Allah Rabbul-'Alamin dari kejahatan bisikan setan yang senantiasa bersembunyi di dalam hati manusia. Bisikan dan was-was yang berasal dari godaan setan itu bila dihadapkan kepada akal yang sehat mesti kalah dan orang yang tergoda menjadi sadar kembali, karena semua bisikan dan was-was setan yang akan menyakiti manusia itu akan menjadi hampa bila jiwa sadar kembali kepada perintah-perintah agama. Begitu pula bila seorang menggoda temannya yang lain untuk melakukan suatu kejahatan, tetapi temannya itu berpegang kuat dengan perintah-perintah agama niscaya akan berhenti menggoda dan merasa kecewa karena godaannya itu tidak berhasil namun ia tetap menunggu kesempatan yang lain."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 6235,
                    "inSurah": 5
                },
                "meta": {
                    "juz": 30,
                    "page": 604,
                    "manzil": 7,
                    "ruku": 556,
                    "hizbQuarter": 240,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ",
                    "transliteration": {
                        "en": "Al lazee yuwas wisu fee sudoorin naas"
                    }
                },
                "translation": {
                    "en": "Who whispers [evil] into the breasts of mankind -",
                    "id": "yang membisikkan (kejahatan) ke dalam dada manusia,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6235",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/6235.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/6235.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "yang membisikkan kejahatan dan kesesatan ke dalam dada manusia dengan cara yang halus, lihai, licik, dan menjanjikan secara terus-menerus.",
                        "long": "Allah menerangkan dalam ayat ini tentang godaan tersebut, yaitu bisikan setan yang tersembunyi yang ditiupkan ke dalam dada manusia, yang mungkin datangnya dari jin atau manusia, sebagaimana dalam ayat lain Allah berfirman:\n\nDan demikianlah untuk setiap nabi Kami menjadikan musuh yang terdiri dari setan-setan manusia dan jin. (al-An'am/6: 112)\n\nSetan-setan jin itu seringkali membisikkan suatu keraguan dengan cara yang sangat halus kepada manusia. Seringkali dia menampakkan dirinya sebagai penasihat yang ikhlas, tetapi bila engkau menghardiknya ia mundur dan bila diperhatikan bicaranya ia terus melanjutkan godaannya secara berlebih-lebihan. \n\nSurah ini dimulai dengan kata pendidik, karena itu Tuhan sebagai pendidik manusia, berkuasa untuk menolak semua godaan setan dan bisikannya dari manusia. Allah memberi petunjuk dalam surah ini agar manusia memohon pertolongan hanya kepada Allah sebagaimana Dia telah memberi petunjuk yang serupa dalam surah al-Fatihah, bahwa dasar yang terpenting dalam agama adalah menghadapkan diri dengan penuh keikhlasan kepada Allah baik dalam ucapan, maupun perbuatan lainnya dan memohon perlindungan kepada-Nya dari segala godaan setan yang ia sendiri tidak mampu menolaknya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 6236,
                    "inSurah": 6
                },
                "meta": {
                    "juz": 30,
                    "page": 604,
                    "manzil": 7,
                    "ruku": 556,
                    "hizbQuarter": 240,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مِنَ الْجِنَّةِ وَالنَّاسِ",
                    "transliteration": {
                        "en": "Minal jinnati wan naas"
                    }
                },
                "translation": {
                    "en": "From among the jinn and mankind.\"",
                    "id": "dari (golongan) jin dan manusia.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/6236",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/6236.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/6236.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Aku berlindung kepada-Nya dari setan pembisik kejahatan dan kesesatan yang berasal dari golongan jin, yakni makhluk halus yang tercipta dari api, dan juga dari golongan manusia yang telah menjadi budak setan.",
                        "long": "Allah menerangkan dalam ayat ini tentang godaan tersebut, yaitu bisikan setan yang tersembunyi yang ditiupkan ke dalam dada manusia, yang mungkin datangnya dari jin atau manusia, sebagaimana dalam ayat lain Allah berfirman:\n\nDan demikianlah untuk setiap nabi Kami menjadikan musuh yang terdiri dari setan-setan manusia dan jin. (al-An'am/6: 112)\n\nSetan-setan jin itu seringkali membisikkan suatu keraguan dengan cara yang sangat halus kepada manusia. Seringkali dia menampakkan dirinya sebagai penasihat yang ikhlas, tetapi bila engkau menghardiknya ia mundur dan bila diperhatikan bicaranya ia terus melanjutkan godaannya secara berlebih-lebihan. \n\nSurah ini dimulai dengan kata pendidik, karena itu Tuhan sebagai pendidik manusia, berkuasa untuk menolak semua godaan setan dan bisikannya dari manusia. Allah memberi petunjuk dalam surah ini agar manusia memohon pertolongan hanya kepada Allah sebagaimana Dia telah memberi petunjuk yang serupa dalam surah al-Fatihah, bahwa dasar yang terpenting dalam agama adalah menghadapkan diri dengan penuh keikhlasan kepada Allah baik dalam ucapan, maupun perbuatan lainnya dan memohon perlindungan kepada-Nya dari segala godaan setan yang ia sendiri tidak mampu menolaknya."
                    }
                }
            }
        ]
    }
}