{
    "code": 200,
    "status": "OK.",
    "message": "Success fetching surah.",
    "data": {
        "number": 13,
        "sequence": 96,
        "numberOfVerses": 43,
        "name": {
            "short": "الرعد",
            "long": "سورة الرعد",
            "transliteration": {
                "en": "Ar-Ra'd",
                "id": "Ar-Ra'd"
            },
            "translation": {
                "en": "The Thunder",
                "id": "Guruh"
            }
        },
        "revelation": {
            "arab": "مدينة",
            "en": "Medinan",
            "id": "Madaniyyah"
        },
        "tafsir": {
            "id": "Surat Ar Ra'd ini terdiri atas 43 ayat termasuk golongan surat-surat Madaniyyah. Surat ini dinamakan Ar Ra'd yang berarti guruh karena dalam ayat 13 Allah berfirman yang artinya Dan guruh itu bertasbih sambil memuji-Nya, menunjukkan sifat kesucian dan kesempurnaan Allah s.w.t.  Dan lagi sesuai dengan sifat Al Quran yang mengandung ancaman dan harapan, maka demikian pulalah halnya bunyi guruh itu menimbulkan kecemasan dan harapan kepada manusia. Isi yang terpenting dari surat ini ialah bahwa bimbingan Allah kepada makhluk-Nya bertalian erat dengan hukum sebab dan akibat. Bagi Allah s.w.t. tidak ada pilih kasih dalam menetapkan hukuman. Balasan atau hukuman adalah akibat dan ketaatan atau keingkaran terhadap hukum Allah."
        },
        "preBismillah": {
            "text": {
                "arab": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
                "transliteration": {
                    "en": "Bismillaahir Rahmaanir Raheem"
                }
            },
            "translation": {
                "en": "In the name of Allah, the Entirely Merciful, the Especially Merciful.",
                "id": "Dengan nama Allah Yang Maha Pengasih, Maha Penyayang."
            },
            "audio": {
                "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1",
                "secondary": [
                    "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1.mp3",
                    "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1.mp3"
                ]
            }
        },
        "verses": [
            {
                "number": {
                    "inQuran": 1708,
                    "inSurah": 1
                },
                "meta": {
                    "juz": 13,
                    "page": 249,
                    "manzil": 3,
                    "ruku": 205,
                    "hizbQuarter": 99,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "المر ۚ تِلْكَ آيَاتُ الْكِتَابِ ۗ وَالَّذِي أُنزِلَ إِلَيْكَ مِن رَّبِّكَ الْحَقُّ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يُؤْمِنُونَ",
                    "transliteration": {
                        "en": "Alif-Laaam-Meeem-Raa; tilka Aayaatul Kitaab; wallazee unzila ilaika mir Rabbikal haqqu wa laakinna aksaran naasi laa yu'minoon"
                    }
                },
                "translation": {
                    "en": "Alif, Lam, Meem, Ra. These are the verses of the Book; and what has been revealed to you from your Lord is the truth, but most of the people do not believe.",
                    "id": "Alif Lam Mim Ra. Ini adalah ayat-ayat Kitab (Al-Qur'an). Dan (Kitab) yang diturunkan kepadamu (Muhammad) dari Tuhanmu itu adalah benar; tetapi kebanyakan manusia tidak beriman (kepadanya)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1708",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1708.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1708.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Alif Laam Miim Raa . Hanya Allah yang mengetahui maksud ungkapan ini. Itu adalah ayat-ayat Kitab Al-Qur'an yang Allah turunkan kepada Nabi Muhammad. Ia berisi petunjuk dan ajaran bagi umat manusia. Dan ketahuilah bahwa Kitab yang diturunkan kepadamu, wahai Nabi Muhammad, dari Tuhanmu itu adalah benar dari-Nya, Tuhan Yang Maha Mengetahui; tetapi kebanyakan manusia tidak beriman kepada-Nya.",
                        "long": "Al-Quran adalah kitab suci yang diturunkan kepada Nabi Muhammad, dan tidak mengandung hal-hal yang bisa meragukan orang terhadap kebenarannya.\n\nKebenaran Al-Quran meliputi seluruh aspek yang terkandung di dalamnya seperti hukum, syariat yang bersifat shalih fi kulli zaman wa makan (cocok untuk sepanjang zaman dan di semua tempat), bermacam-macam perumpamaan, kisah, dan petunjuknya yang harus diikuti oleh manusia untuk mencapai kebahagiaan di dunia dan akhirat.\n\nKebenaran Al-Quran telah terbukti pada masa-masa awal Islam. Dengan berpegang teguh pada Al-Quran, umat Islam mampu membangun bangsa yang berbudaya tinggi dan berakhlak mulia. Al-Quran memotivasi manusia untuk bangkit berjuang menegakkan kebenaran, menghancurkan kemungkaran, menegakkan keadilan, dan melenyapkan kezaliman. Dengan menjalankan petunjuk Al-Quran umat Islam mampu menjadi bangsa yang berwibawa. Tapi ketika Al-Quran ditinggalkan, umat Islam lebih memilih keduniaan daripada akhirat yang kekal, dan akibat ketidakyakinan umat Islam terhadap janji-janji Allah yang termaktub dalam Al-Quran, umat Islam berubah menjadi bangsa yang terbelakang, terbelit kemiskinan dan kebodohan. Jika umat Islam saat ini tidak menyadari kekeliruannya dan tidak berusaha memperbaikinya, dengan cara kembali menjalankan pesan-pesan Al-Quran, maka umat Islam akan tetap terpuruk dalam kebodohannya. Allah tidak akan mengubah nasib mereka jika mereka tidak mengubah nasib mereka sendiri. Firman Allah swt.:\n\nSesungguhnya Allah tidak akan mengubah keadaan suatu kaum sebelum mereka mengubah keadaan diri mereka sendiri. (ar-Rad/13: 11)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1709,
                    "inSurah": 2
                },
                "meta": {
                    "juz": 13,
                    "page": 249,
                    "manzil": 3,
                    "ruku": 205,
                    "hizbQuarter": 99,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "اللَّهُ الَّذِي رَفَعَ السَّمَاوَاتِ بِغَيْرِ عَمَدٍ تَرَوْنَهَا ۖ ثُمَّ اسْتَوَىٰ عَلَى الْعَرْشِ ۖ وَسَخَّرَ الشَّمْسَ وَالْقَمَرَ ۖ كُلٌّ يَجْرِي لِأَجَلٍ مُّسَمًّى ۚ يُدَبِّرُ الْأَمْرَ يُفَصِّلُ الْآيَاتِ لَعَلَّكُم بِلِقَاءِ رَبِّكُمْ تُوقِنُونَ",
                    "transliteration": {
                        "en": "Allaahul lazee raf'as samaawaati bighairi 'amadin tarawnahaa summas tawaa 'alal 'Arshi wa sakhkharash shamsa walqamara kulluny yajree li ajalim musammaa; yudabbirul amra yufassilil Aayaati la'allakum biliqaaa'i Rabbikum tooqinoon"
                    }
                },
                "translation": {
                    "en": "It is Allah who erected the heavens without pillars that you [can] see; then He established Himself above the Throne and made subject the sun and the moon, each running [its course] for a specified term. He arranges [each] matter; He details the signs that you may, of the meeting with your Lord, be certain.",
                    "id": "Allah yang meninggikan langit tanpa tiang (sebagaimana) yang kamu lihat, kemudian Dia bersemayam di atas ‘Arsy. Dia menundukkan matahari dan bulan; masing-masing beredar menurut waktu yang telah ditentukan. Dia mengatur urusan (makhluk-Nya), dan menjelaskan tanda-tanda (kebesaran-Nya), agar kamu yakin akan pertemuan dengan Tuhanmu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1709",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1709.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1709.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Setelah pada ayat sebelumnya Allah menjelaskan bahwa Al-Qur'an adalah benar dari-Nya, lalu pada ayat ini Allah membuktikan kebenarannya melalui keunikan penciptaan alam semesta. Hanya Allah yang meninggikan langit tanpa tiang penyangga sebagaimana yang kamu lihat, kemudian Dia bersemayam di atas 'Arsy. Dia menundukkan matahari dan bulan di bawah aturan hukum alam-Nya; masing-masing dari keduanya beredar menurut waktu yang telah ditentukan. Dia mengatur urusan makhluk-Nya, baik yang di bumi maupun di langit, dan Dia menjelaskan tanda-tanda kebesaran-Nya agar kamu yakin akan pertemuan dengan Tuhanmu kelak di akhirat.",
                        "long": "Ayat ini menjelaskan bukti-bukti kebenaran Al-Quran dengan memaparkan tanda-tanda atau bukti-bukti adanya Allah yang menurunkan Al-Quran. Keberadaan Allah ini dibuktikan dengan berbagai ciptaannya yang bisa dilihat dan dirasakan manusia di alam raya ini.\n\nSecara terperinci Allah menerangkan keadaan langit yang ditinggikan tanpa tiang, perjalanan matahari dan bulan yang masing-masing beredar menurut waktu dan tempat yang sudah ditentukan, keadaan bumi yang penuh dengan gunung dan lembah yang mengalir sungai di antaranya, dan adanya bermacam-macam kebun yang menghasilkan beraneka ragam buah-buahan. Semua itu menunjukkan bahwa hanya Allah yang dapat memberi manfaat dan mudarat, yang dapat menghidupkan dan mematikan dan Yang Mahakuasa atas segala sesuatu. \n\nTanda-tanda kekuasaan Allah di langit dipaparkan dalam ayat ini:\n\n1.Menciptakan langit di atas bumi tanpa adanya tiang sebagaimana yang biasa dilihat oleh seluruh makhluk, dan jarak yang sangat jauh di antara benda-benda di langit yang kesemuanya beredar menurut ketentuan dan peraturan Allah sendiri seperti benda-benda yang terlihat melayang di angkasa.\n\n2.Kemudian Allah bersemayam di atas Arasy-Nya dan mengatur alam semesta ini. Tentang kebijaksanaan-Nya telah dibentangkan secara panjang lebar di dalam Surah al-Araf dan Surah Yunus.\n\n3.Allah swt telah menundukkan matahari dan bulan untuk kemanfaatan sekalian makhluk-Nya, masing-masing berjalan pada rotasi/lintasannya menurut waktu yang ditentukan. Tentang perjalanan matahari dan bulan telah dijelaskan dengan terperinci dalam Surah Yunus dan Surah Hud. Allah swt mengatur segala kejadian dalam kerajaan-Nya secara sempurna, Dialah yang menghidupkan dan mematikan, mengadakan dan meniadakan, memberi kekayaan dan kemiskinan, menurunkan wahyu kepada siapa yang dikehendaki-Nya. Semua itu menunjukkan bahwa Allahlah yang mempunyai kekuasaan yang mutlak dan rahmat yang luas, karena menentukan penciptaan suatu makhluk dengan keadaan sifat dan tabiat tertentu, tidak dapat dilaksanakan kecuali oleh Tuhan Yang Mahaagung dan Mahakuasa. Dialah yang mengatur alam kebendaan dan alam kerohanian dan Dialah yang mengatur benda-benda yang amat besar dan amat kecil, semuanya dengan penuh hikmah kebijaksanaan. \n\nDitinjau dari sudut saintifik, langit atau sama dalam ayat ini dapat berarti langit biru atau atmosfer yang dekat dengan bumi ini. Dalam pengertian yang lebih luas sama juga dapat diartikan dengan langit antariksa (space) yang sangat luas ini. \n\nAtmosfer adalah selubung gas yang meliputi suatu planet (termasuk bumi). Ia membentuk ruang udara. Atmosfer dibagi ke dalam 6 (enam) wilayah menurut ketinggiannya, yang satu berada di atas yang lainnya. Secara berurutan dari wilayah yang terendah, maka atmosfer dibagi menjadi: (1) Troposfer (Troposphere ketinggian: 0-8 Km), (2) Tropopause, ketinggian: 8-12 Km (3) Stratosfer (Stratosphere, ketinggian: 12-80 Km), (4) Mesosfer (Mesosphere, ketinggian: 80 Km) (5) Ionosfer (Ionosphere, ketinggian: 100 Km) dan (6) Eksosfer (Exosphere, ketinggian >100Km). Terjadinya awan, cuaca dan sebagainya berada di wilayah Troposfer. Komposisi atmosfer (di wilayah Troposfer), mayoritas terdiri dari gas nitrogen (78%), juga oksigen (20%). Atmosfer ini menyeliputi bumi dan dapat tegak di atas bumi karena adanya gaya gravitasi bumi. Inilah pengertian dari meninggikan langit tanpa tiang itu. Tentu saja ini adalah tafsir langit yang berbeda dengan tujuh lapis langit yang menyangkut galaksi dan lain sebagainya. \n\nBerkaitan dengan langit tanpa tiang, ditinjau dari struktur konstruksi maka struktur tanpa tiang hanya dimungkinkan kalau konstruksinya berbentuk bola atau mirip bola (spherical, surface of revolution), meskipun demikian para ahli belum sepakat tentang bentuknya; ada yang menyatakan sebagai bola, seperti sadel, bahkan sebagai terompet. Pada konstruksi ini dinding dan tiang menyatu menjadi permukaan bola itu sendiri. Jadi, konstruksi langit tanpa tiang hanya dimungkinkan bila langit itu berbentuk bola, sesuai dengan temuan ilmiah yang menyatakan bahwa alam semesta adalah bola besar yang mengembang makin membesar dengan kecepatan cahaya yaitu dengan kecepatan cahaya 300 ribu kilometer setiap detiknya (the expanding universe).\n\nLangit-antariksa, memang terbentuk sejak Dentuman Besar (Big Bang) dan terus mengembang dan meluas. Dalam Surah az-zariat/51:47 disebutkan: Dan langit Kami bangun dengan kekuasaan (Kami) dan Kami benar-benar meluaskannya. Kata sama pada ayat 47 Surah az-zariat/51 di atas lebih tepat diartikan langit-antariksa. Langit-antariksa (space) memang terus-menerus mengembang (space expansion). Penelitian spektrum Galaksi, menunjukkan adanya pergeseran spektrum pita-merah yang teratur, hal ini menjelaskan bahwa jarak antar Galaksi semakin menjauh, dan inilah yang merupakan indikasi langit-antariksa semakin mengembang. Tentu langit ini tidak memerlukan tiang; karena dibangun dengan kekuatan maha dahsyat dari Allah swt yang berupa Dentuman Besar. Dentuman Besar (Big Bang) ini telah memecah Gaya Superforce menjadi Gaya-gaya Fundamental seperti: Gaya Gravitasi, Gaya Nuklir Kuat, Gaya Nuklir Lemah, dan Gaya Elektromagnetik; yang kesemuanya ini menstabilkan langit-antariksa ini.\n\nSeterusnya dalam ayat-2 ini disebutkan: \"Dia menundukkan matahari dan bulan; masing-masing beredar menurut waktu yang telah ditentukan\". Kata \"menundukkan\" berarti bahwa baik matahari maupun bulan tunduk pada sunatullah, atau hukum-hukum alam dari Allah. Tentang \"masing-masing beredar menurut waktu yang ditentukan\", lihat keterangan pada Surah Yunus/10: 5 di atas. Demikian penjelasan dari sudut pandang saintis.\n\nKesemuanya itu terjadi berkat kesempurnaan Allah dalam Zat, sifat, ilmu, dan kekuasaan-Nya yang tidak dapat ditiru oleh siapapun juga. Allah mengatur urusan makhluk-Nya, menjelaskan tanda-tanda kebesaran-Nya dengan peraturan yang sangat rapi dan sempurna, serta mengatur benda-benda di langit sehingga berjalan menurut lintasan yang telah ditentukan, seperti bentuk mata rantai yang sambung menyambung sehingga tidak terjadi tabrakan di ruang angkasa yang dapat menimbulkan malapetaka dan bencana. Semua ini berlangsung terus-menerus sampai datang hari kiamat, dimana akan terjadi kekacauan dan ketidakteraturan kerja benda-benda langit di alam angkasa. Kehancuran alam semesta dimulai dengan terbelahnya langit, seperti dijelaskan dalam firman Allah:\n\nApabila langit terbelah, dan apabila bintang-bintang jatuh berserakan. (al-Infithar/82:1-2)\n\nKemudian Allah menerangkan bahwa tanda-tanda kesempurnaan kekuasaan-Nya di langit dan di bumi merupakan sarana yang bisa menimbulkan keyakinan bagi umat manusia akan adanya perjumpaan dengan Allah Sang Pencipta pada hari kiamat, dimana Dia akan memberikan ganjaran kepada orang-orang yang berbuat kebajikan dan menghukum orang-orang yang berbuat kejahatan. Jika manusia meyakini kebenaran ini, niscaya dia dapat berpaling dari penyembahan berhala dan patung kepada keikhlasan beribadah hanya kepada Allah Yang Maha Esa, percaya kepada janji dan ancaman-Nya, percaya kepada semua rasul-Nya, mengikuti segala perintah dan menjauhi larangan-Nya, sehingga mereka menjadi manusia yang bahagia di dunia dan di akhirat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1710,
                    "inSurah": 3
                },
                "meta": {
                    "juz": 13,
                    "page": 249,
                    "manzil": 3,
                    "ruku": 205,
                    "hizbQuarter": 99,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَهُوَ الَّذِي مَدَّ الْأَرْضَ وَجَعَلَ فِيهَا رَوَاسِيَ وَأَنْهَارًا ۖ وَمِن كُلِّ الثَّمَرَاتِ جَعَلَ فِيهَا زَوْجَيْنِ اثْنَيْنِ ۖ يُغْشِي اللَّيْلَ النَّهَارَ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ",
                    "transliteration": {
                        "en": "Wa Huwal lazee maddal arda wa ja'ala feehaa rawaasiya wa anhaaraa; wa min kullis samaraati ja'ala feehaa zawjainis yaini Yughshil lailan nahaar; inna fee zaalika la aayaatil liqawminy yatafakkaroon"
                    }
                },
                "translation": {
                    "en": "And it is He who spread the earth and placed therein firmly set mountains and rivers; and from all of the fruits He made therein two mates; He causes the night to cover the day. Indeed in that are signs for a people who give thought.",
                    "id": "Dan Dia yang menghamparkan bumi dan menjadikan gunung-gunung dan sungai-sungai di atasnya. Dan padanya Dia menjadikan semua buah-buahan berpasang-pasangan; Dia menutupkan malam kepada siang. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang berpikir."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1710",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1710.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1710.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Usai berbicara tentang matahari dan bulan, Allah melalui ayat ini menjelaskan perihal bumi dan isinya. Dan Dia Yang Maha Pencipta adalah Tuhan yang juga menghamparkan bumi untuk tempat kamu berdiam, dan menjadikan gunung-gunung yang beragam tingginya, dan sungai-sungai yang mengalir di atas permukaan-nya. Dan padanya Dia menjadikan semua buah-buahan dari bermacam jenisnya secara berpasang-pasangan sehingga dapat berkembang biak. Dia pula yang menutupkan malam kepada siang. Sungguh, pada yang demikian itu terdapat tanda-tanda kebesaran Allah bagi orang-orang yang mau berpikir.",
                        "long": "Pada ayat ini Allah menerangkan sisi lain dari tanda-tanda kekuasaan-Nya yang ada di bumi, yaitu:\n\n1.Dialah Allah yang membentangkan bumi menjadi luas dan lebar supaya mudah dijadikan tempat kediaman makhluk-Nya. Semua binatang dapat hidup di atasnya dengan leluasa. Manusia dapat mengambil manfaat dari hasil buminya, hewan-hewannya, dan benda-benda logam yang terpendam di dalam perutnya, serta dapat berkeliaran di muka bumi untuk mencari rezeki dan segala kemanfaatannya. Karena sangat luas, bumi ini kelihatannya seperti lahan datar, meskipun keadaan yang sebenarnya berbentuk bola sebagaimana diyakini oleh para ulama ahli falak. \n\n2.Allah telah mengadakan gunung-gunung di atas permukaan bumi ini sebagai tonggak dan pasak yang menjaga kestabilan bumi supaya tidak bergerak dan tidak bergeser.\n\n3.Allah telah menciptakan sungai-sungai di bumi untuk kepentingan manusia dan binatang-binatang. Manusia dapat mengairi dengan air sungai itu kebun-kebun dan sawah ladangnya yang nantinya menghasil-kan bermacam-macam hasil bumi dan buah-buahan. \n\n4.Bunga dari pohon buah-buahan dijadikan Allah berpasang-pasangan dimana terdapat unsur jantan dan unsur betina. Ilmu pengetahuan telah menetapkan bahwa sebuah pohon itu tidak akan berbuah kecuali jika telah terjadi perkawinan antara unsur jantan (serbuk sari) dan betina (putik bunga) yang biasanya berada pada sebagian besar dari jenis pohon. Ada pohon yang hanya memiliki unsur jantan saja, sedangkan unsur betinanya ada pada pohon yang lain sehingga perlu dikawinkan supaya dapat berbuah seperti pohon kurma. Ada pula yang mempunyai unsur jantan dan betina dalam satu bunga seperti pohon kapas. \n\n5.Allah menutupkan malam kepada siang sehingga suasana alam yang terang berubah menjadi gelap gulita seperti menutup sesuatu dengan kain hitam. Demikian pula Allah menyinarkan siang kepada malam sehingga kegelapan hilang dan alam kelihatan terang benderang. Semuanya itu dijadikan Allah untuk menyempurnakan kemanfaatan bagi manusia dengan memberikan kesempatan istirahat dan tidur di malam hari dan bekerja mencari nafkah pada siang hari sesuai dengan firman Allah:\n\nApakah mereka tidak memperhatikan bahwa Kami telah menjadikan malam agar mereka beristirahat padanya dan (menjadikan) siang yang menerangi? (an-Naml/27: 86)\n\nDalam ayat 3 di atas, dijelaskan bahwa Allah menutupkan malam kepada siang. Dalam ayat yang lainnya juga disebutkan bahwa malam menutup siang dan siang menutup malam. Kata-kata yang digunakan dalam bahasa Arab ini mirip seperti orang memakai sorban, yaitu kain yang satu menutup yang lain dan secara berlapis-lapis menutup kepala. Dengan demikian kata menutupkan malam kepada siang, sebetulnya mengisyaratkan bahwa planet bumi kita ini bulat; bukannya datar seperti gambaran orang-orang jahiliah kuno. \n\nSetelah Allah menerangkan dalil-dalil kekuasaan-Nya yang dapat dilihat oleh mata tiap pagi dan petang, tiap-tiap waktu dan keadaan, maka Allah menerangkan bahwa tanda-tanda itu tidak diperhatikan kecuali oleh orang-orang yang suka bersyukur dan merenungi tanda-tanda kekuasaan-Nya. Lalu dengan akal pikirannya dapat mencapai kebenaran dan beralih dari memandang sebab kepada yang menyebabkan. Sesungguhnya pada yang demikian itu ada tanda-tanda kebesaran Allah bagi kaum yang mau memikirkan bahwa pencipta alam itu adalah Tuhan yang mempunyai kehendak yang mutlak dan kekuasaan yang meliputi segala sesuatu, yang Kuasa untuk menghidupkan yang telah mati di antara makhluk-Nya, dan mengembalikan mereka dari alam fana. Oleh karena itu, tidak boleh beribadah kecuali kepada-Nya, tidak boleh tunduk dan berserah diri kecuali kepada kekuasaan-Nya. Beribadah tidak boleh ditujukan kepada patung-patung, berhala-berhala, batu-batu, pohon, malaikat, nabi-nabi, dan lain sebagainya karena benda-benda itu tidak dapat menolak kemudaratan dari dirinya sendiri, sesuai dengan firman Allah:\n\nSesungguhnya segala yang kamu seru selain Allah tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tidak akan dapat merebutnya kembali dari lalat itu. (al-hajj/22: 73)\n\nDan telah diriwayatkan pula dalam sebuah hadis Nabi saw\n\nPikirkanlah olehmu sekalian tentang makhluk Allah dan jangan memikirkan tentang Allah. (Riwayat Abu Nuaim dari Ibnu Abbas)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1711,
                    "inSurah": 4
                },
                "meta": {
                    "juz": 13,
                    "page": 249,
                    "manzil": 3,
                    "ruku": 205,
                    "hizbQuarter": 99,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَفِي الْأَرْضِ قِطَعٌ مُّتَجَاوِرَاتٌ وَجَنَّاتٌ مِّنْ أَعْنَابٍ وَزَرْعٌ وَنَخِيلٌ صِنْوَانٌ وَغَيْرُ صِنْوَانٍ يُسْقَىٰ بِمَاءٍ وَاحِدٍ وَنُفَضِّلُ بَعْضَهَا عَلَىٰ بَعْضٍ فِي الْأُكُلِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَعْقِلُونَ",
                    "transliteration": {
                        "en": "Wa fil ardi qita'um muta jaawiraatunw wa jannaatum min a'naabinw wa zar'unw wa nakheelun sinwaanunw wa ghairu sinwaaniny yusqaa bimaaa'inw waahid; wa nufaddilu ba'dahaa 'alaa ba'din fil-ukul; inna fee zaalika la aayaatil liqawminy ya'qiloon"
                    }
                },
                "translation": {
                    "en": "And within the land are neighboring plots and gardens of grapevines and crops and palm trees, [growing] several from a root or otherwise, watered with one water; but We make some of them exceed others in [quality of] fruit. Indeed in that are signs for a people who reason.",
                    "id": "Dan di bumi terdapat bagian-bagian yang berdampingan, kebun-kebun anggur, tanaman-tanaman, pohon kurma yang bercabang, dan yang tidak bercabang; disirami dengan air yang sama, tetapi Kami lebihkan tanaman yang satu dari yang lainnya dalam hal rasanya. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang mengerti."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1711",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1711.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1711.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan di bumi yang terhampar dengan gunung-gunung yang tegak berdiri dan sungai-sungai yang berkelok-kelok dan bermuara ke laut, terdapat bagian-bagian tanah yang berdampingan dengan jarak yang berbeda serta kualitas kesuburan yang berbeda pula. Ada bagian tanah yang baik menjadi kebun-kebun anggur, ada yang cocok ditanami tanaman-tanaman tertentu, dan ada pula yang cocok ditanami pohon kurma yang bercabang dan yang tidak bercabang. Bagian-bagian tanah yang ditanami itu disirami dengan air yang sama. Tanaman-tanaman itu tumbuh, berkembang, lalu mengeluarkan bunga dan buah yang jenisnya beragam. Meski demikian, Kami lebihkan tanaman yang satu dari yang lainnya, baik dalam hal rasa, warna, ukuran, maupun bobot-nya. Sungguh, pada yang demikian itu terdapat tanda-tanda kebesaran Allah bagi orang-orang yang mau mengerti.",
                        "long": "Ungkapan ayat ini merupakan kelanjutan dari tanda-tanda kekuasaan Allah yang ada di bumi, yaitu bahwa di bumi terdapat bagian-bagian tanah yang berdekatan dan berdampingan tetapi berlainan kesuburannya. Ada tanah yang sangat subur untuk ditanami tanaman apa saja, ada pula tanah yang hanya dapat ditanami pohon-pohon besar saja, tetapi tidak baik untuk ditanami tanaman palawija atau sebaliknya, ada pula tanah yang lunak dan ada pula yang keras yang sulit untuk digemburkan. Di bumi terdapat kebun-kebun anggur, tanaman palawija, dan pohon yang bercabang dan tidak bercabang. Semuanya itu disiram dengan air yang sama tetapi menghasilkan buah yang beraneka ragam rasanya, seperti pohon tebu yang rasanya manis, buah jeruk yang rasanya manis dan masam, serta buah paria yang rasanya pahit, dan lain sebagainya. Allah melebihkan sebahagian tanaman-tanaman atas sebagian yang lain baik dari bentuknya, rasanya dan baunya. Semua tanda-tanda itu menunjukkan kekuasaan Allah dan menjadi dalil yang bisa menimbulkan keyakinan bagi orang-orang yang mau berpikir.\n\nMenurut kajian saintis, perbedaan rasa dari buah-buahan atau tanaman, disebabkan perbedaan kandungan kimiawi yang ada di dalamnya. Zat atau molekul kimiawi ini, dalam bahasa ilmu biokimia dikenal dengan sebutan metabolit. Perbedaan jenis maupun kuantitas metabolit inilah yang memberikan rasa yang berbeda-beda dari tanaman atau buah yang berbeda. Biji dari semua tanaman, hampir semuanya berbentuk sama atau dikenal sebagai mempunyai morfologi yang sama, atau hampir sama, yaitu morfologi-nya bulat atau sedikit lonjong. Semua biji ini, di dalamnya terkandung embrio tanaman (Encyclopedia Britannica, 1965,Vol.20, Seed, 273-275). Dalam embrio tanaman itu terkandung materi-materi genetik (atau yang sering disebut dengan DNA, Desoxyribo Nucleic Acid, atau Asam Desoksiribo Nukleat). \n\nDalam biji tanaman yang berbeda, kandungan embrioniknya berbeda, demikian pula kandungan materi DNA-nya juga berbeda. DNA suatu materi yang akan sangat menentukan proses pembentukan metabolit dalam semua makhluk hidup termasuk tanaman. Maka Mahabesar Allah, apabila biji-biji yang berbeda itu ditanam dan disiram dengan air yang sama, biji-biji itu akan tumbuh menjadi berbagai tanaman yang berbeda rasanya, tergantung materi genetik yang dikandungnya; karena materi genetik inilah yang akan menentukan (membuat) metabolit-metabolit di dalam tanaman itu yang menentukan rasa buah atau tanaman itu.."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1712,
                    "inSurah": 5
                },
                "meta": {
                    "juz": 13,
                    "page": 249,
                    "manzil": 3,
                    "ruku": 205,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ وَإِن تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ أَإِذَا كُنَّا تُرَابًا أَإِنَّا لَفِي خَلْقٍ جَدِيدٍ ۗ أُولَٰئِكَ الَّذِينَ كَفَرُوا بِرَبِّهِمْ ۖ وَأُولَٰئِكَ الْأَغْلَالُ فِي أَعْنَاقِهِمْ ۖ وَأُولَٰئِكَ أَصْحَابُ النَّارِ ۖ هُمْ فِيهَا خَالِدُونَ",
                    "transliteration": {
                        "en": "Wa in ta'jab fa'ajabun qawluhm 'a-izaa kunna turaaban 'a-inna lafee khalqin jadeed; ulaaa 'ikal lazeena kafaroo bi Rabbihim wa ulaaa'ikal aghlaalu feee a'naaqihim wa ulaa'ika Ashaabun Naari hum feehaa khaalidoon"
                    }
                },
                "translation": {
                    "en": "And if you are astonished, [O Muhammad] - then astonishing is their saying, \"When we are dust, will we indeed be [brought] into a new creation?\" Those are the ones who have disbelieved in their Lord, and those will have shackles upon their necks, and those are the companions of the Fire; they will abide therein eternally.",
                    "id": "Dan jika engkau merasa heran, maka yang mengherankan adalah ucapan mereka, “Apabila kami telah menjadi tanah, apakah kami akan (dikembalikan) menjadi makhluk yang baru?” Mereka itulah yang ingkar kepada Tuhannya; dan mereka itulah (yang dilekatkan) belenggu di lehernya. Mereka adalah penghuni neraka, mereka kekal di dalamnya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1712",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1712.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1712.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Semua itu dengan sangat jelas membuktikan keesaan Allah. Dan sebab itu, jika ada sesuatu yang engkau patut merasa heran, maka yang mengherankan adalah ucapan mereka, \"Apa-kah benar, bila kami telah meninggal, dikubur, dan kemudian menjadi tanah, apakah kami kelak akan dikembalikan atau dibangkitkan menjadi makhluk yang baru lagi?\" Mereka yang berkata seperti itulah orang-orang yang ingkar kepada Tuhannya. Mereka mengingkari keesaan Allah dan kepastian datangnya hari Kiamat, dan mereka itulah orang-orang yang akan dilekatkan belenggu di lehernya. Mereka adalah para penghuni neraka, dan mereka kekal di dalamnya untuk waktu yang sangat lama.",
                        "long": "Ayat ini menjelaskan sikap orang kafir terhadap keesaan Allah, dimana Allah mengatakan kepada Nabi Muhammad bahwa jika beliau heran terhadap penyembahan mereka kepada berhala-berhala yang tidak memberi mudarat dan membawa manfaat setelah dikemukakan dalil-dalil keesaan Allah, maka yang lebih patut mengherankan adalah ucapan mereka yang mendustakan hari kebangkitan pada hari kiamat. Mereka berkata, \"Apabila kami telah menjadi tanah apakah kami benar-benar akan dikembalikan lagi menjadi makhluk yang baru?\"\n\nMereka mengucapkan kata-kata pengingkaran itu padahal mereka tidak mengingkari kekuasaan Allah dalam menciptakan mereka sejak berada dalam kandungan ibunya. Pertanyaan yang mengandung keingkaran itu berulang-ulang disebut dalam sebelas tempat di delapan surah dalam Al-Quran, yaitu Surah ar-Rad/13: 5, al-Isra/17: 49 dan 98, al-Muminun/23: 35 dan 82, an-Nahl/16: 38, as-Sajdah/32: 10, ash-shaffat/37: 16 dan 53, al-Waqiah/56: 47, dan an-Naziat/79: 11. Semuanya mengandung keingkaran yang sangat keras sehingga mengesankan bahwa hari kebangkitan itu mustahil akan terjadi. Menurut mereka tidak mungkin orang yang sudah meninggal dunia dan menjadi tulang-belulang akan hidup kembali. Kemudian Allah menegaskan bahwa orang yang ingkar pada hari kebangkitan itulah yang juga ingkar terhadap Tuhannya. Mengingkari kekuasaan Allah sama halnya dengan mengingkari Allah itu sendiri. Mereka akan dipasangkan belenggu di lehernya sebagai akibat di dunia tidak meyakini kebenaran dan mengikuti petunjuk. Ada pula yang menafsirkan bahwa mereka itu pada hari kiamat ketika diadili dan dipasangkan beberapa belenggu di lehernya seperti seorang tawanan. Firman Allah:\n\nKetika belenggu dan rantai dipasang di leher mereka, seraya mereka diseret, ke dalam air yang sangat panas, kemudian mereka dibakar dalam api. (al-Mumin/40: 71-72)\n\nMereka adalah penghuni neraka yang kekal di dalamnya dan hidup dalam kehinaan sebagai akibat dari keingkaran dan kejahatannya selama hidup di dunia.\n\nAllah swt dengan sifat kemahakuasaan-Nya, mampu menciptakan segala sesuatu yang ada di dunia ini, baik yang hidup dan bergerak, maupun yang mati, bahkan dari tidak ada menjadi ada. Oleh karena itu, Allah akan dengan mudah membangkitkan kembali manusia setelah mati. Firman Allah:\n\n... dia berkata, \"Siapakah yang dapat menghidupkan tulang-belulang yang telah hancur luluh? Katakanlah (Muhammad), \"Yang akan menghidupkan-nya ialah (Allah) yang menciptakannya pertama kali... (Yasin/36: 78-79)\n\nFirman Allah:\n\nApakah manusia mengira, bahwa Kami tidak akan mengumpulkan (kembali) tulang-belulangnya? (Bahkan), Kami mampu menyusun (kembali) jari-jemarinya dengan sempurna. (al-Qiyamah/75: 3-4)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1713,
                    "inSurah": 6
                },
                "meta": {
                    "juz": 13,
                    "page": 250,
                    "manzil": 3,
                    "ruku": 205,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَيَسْتَعْجِلُونَكَ بِالسَّيِّئَةِ قَبْلَ الْحَسَنَةِ وَقَدْ خَلَتْ مِن قَبْلِهِمُ الْمَثُلَاتُ ۗ وَإِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ لِّلنَّاسِ عَلَىٰ ظُلْمِهِمْ ۖ وَإِنَّ رَبَّكَ لَشَدِيدُ الْعِقَابِ",
                    "transliteration": {
                        "en": "Wa yasta'jiloonaka bis saiyi'ati qablal hasanati wa qad khalat min qablihimul masulaat; wa inna Rabbaka lazoo maghfiratil linnaasi 'alaa zulmihim wa inna Rabbaka lashadeedul 'iqaab"
                    }
                },
                "translation": {
                    "en": "They impatiently urge you to bring about evil before good, while there has already occurred before them similar punishments [to what they demand]. And indeed, your Lord is full of forgiveness for the people despite their wrongdoing, and indeed, your Lord is severe in penalty.",
                    "id": "Dan mereka meminta kepadamu agar dipercepat (datangnya) siksaan, sebelum (mereka meminta) kebaikan, padahal telah terjadi bermacam-macam contoh siksaan sebelum mereka. Sungguh, Tuhanmu benar-benar memiliki ampunan bagi manusia atas kezaliman mereka, dan sungguh, Tuhanmu sangat keras siksaan-Nya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1713",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1713.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1713.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Selain pertanyaan mereka tentang kebangkitan, permintaan mereka yang aneh juga mengherankan. Dan mereka, yakni kaum kafir Mekah, meminta kepadamu agar dipercepat datangnya siksaan yang akan dijatuhkan bagi mereka, sebelum mereka meminta kebaikan, padahal telah terjadi bermacam-macam contoh siksaan yang telah dijatuhkan kepada kaum sebelum mereka. Sungguh, Tuhanmu, wahai Nabi Muhammad, benar-benar memiliki ampunan bagi manusia atas kezaliman yang mereka lakukan, dan sungguh, Tuhanmu benar-benar sangat keras siksaan-Nya bagi orang-orang yang terus-menerus durhaka dan enggan bertobat.",
                        "long": "Setelah mendustakan Rasul dan mengingkari azab hari kiamat, mereka mengingkari pula azab di dunia yang telah diancamkan oleh Rasulullah kepada mereka. Mereka meminta kepadanya agar siksa yang telah diancamkan kepada mereka disegerakan datangnya. Semestinya mereka memohon kebaikan dan keselamatan dari turunnya azab dan mengharapkan pahala yang dijanjikan oleh Rasulullah di akhirat. Padahal bermacam-macam azab telah ditimpakan Allah kepada umat-umat yang mendustakan para rasul sebelumnya. Di antara mereka ada yang diubah rupa dan sifatnya menjadi seperti kera, ada pula yang dihancurkan dengan gempa bumi, dan sebagainya. Tentang keadaan mereka yang lebih suka menantang turunnya azab daripada meminta kebaikan disebutkan pula dalam firman Allah:\n\nDan (ingatlah), ketika mereka (orang-orang musyrik) berkata, \"Ya Allah, jika (Al-Quran) ini benar (wahyu) dari Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih. (al-Anfal/8: 32)\n\nSesungguhnya Allah benar-benar mempunyai ampunan yang luas terhadap dosa-dosa hamba-Nya yang bertobat dan menutupi kesalahan-kesalahannya pada hari kiamat. Seandainya tidak bersifat Maha Penyantun, tentu Allah akan menyiksa manusia karena kezalimannya. Firman Allah:\n\nDan sekiranya Allah menghukum manusia disebabkan apa yang telah mereka perbuat, niscaya Dia tidak akan menyisakan satu pun makhluk bergerak yang bernyawa di bumi ini. (Fathir/35: 45)\n\nSesungguhnya siksaan Allah sangat pedih terhadap orang yang mengerja-kan kejahatan dan terus bergelimang dalam kesesatan dan dosa. Ada sebagian azab yang disegerakan turunnya di dunia sebagai akibat dari berbagai dosa, seperti terganggunya kesehatan orang-orang yang biasa minum minuman keras, bangkrutnya orang-orang yang suka berjudi padahal sebelumnya kaya, dan seseorang koruptor yang dicopot dari kedudukannya yang tinggi karena terlibat soal korupsi dan manipulasi. Sering sekali ampunan dari Allah itu disebut berdampingan dengan siksaan agar seorang hamba Allah selalu berada di posisi tengah antara khauf dan raja (ketakutan terhadap azab Allah dan harapan memperoleh ampunan-Nya) seperti dalam firman Allah:\n\nSesungguhnya Tuhanmu sangat cepat siksa-Nya, dan sesungguhnya Dia Maha Pengampun, Maha Penyayang. (al-Araf/7: 167)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1714,
                    "inSurah": 7
                },
                "meta": {
                    "juz": 13,
                    "page": 250,
                    "manzil": 3,
                    "ruku": 205,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنزِلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ ۗ إِنَّمَا أَنتَ مُنذِرٌ ۖ وَلِكُلِّ قَوْمٍ هَادٍ",
                    "transliteration": {
                        "en": "Wa yaqoolul lazeena kafaroo law laaa unzila 'alaihi Aayatum mir Rabbih; innamaaa anta munzirunw wa likulli qawmin haad"
                    }
                },
                "translation": {
                    "en": "And those who disbelieved say, \"Why has a sign not been sent down to him from his Lord?\" You are only a warner, and for every people is a guide.",
                    "id": "Dan orang-orang kafir berkata, “Mengapa tidak diturunkan kepadanya (Muhammad) suatu tanda (mukjizat) dari Tuhannya?” Sesungguhnya engkau hanyalah seorang pemberi peringatan; dan bagi setiap kaum ada orang yang memberi petunjuk."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1714",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1714.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1714.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Tidak cukup sampai di situ, kaum kafir Mekah juga meminta Nabi Muhammad mendatangkan mukjizat yang kasat mata seperti mukjizat Nabi Musa. Dan orang-orang kafir berkata dengan maksud mengejek Nabi Muhammad dan kaum muslim, \"Mengapa tidak diturunkan kepadanya suatu tanda mukjizat inderawi dari Tuhannya?\" Sesungguhnya engkau, wahai Muhammad, hanyalah seorang pemberi peringatan, petunjuk, dan bimbingan menuju jalan kebenaran; dan bagi setiap kaum di mana pun berada, selalu ada orang yang memberi petunjuk, baik itu nabi maupun pewarisnya.",
                        "long": "Dalam ayat ini dijelaskan bagaimana orang-orang kafir berkata kepada Nabi Muhammad dengan nada menantang mengapa tidak diturunkan kepadanya tanda kebesaran dari Tuhannya seperti tongkat sebagai mukjizat yang diberikan kepada Nabi Musa dan unta kepada Nabi Saleh, serta mengapa Muhammad tidak bisa menjadikan bukit Safa menjadi emas atau mengubah bukit-bukit ini menjadi lembah dengan sungai yang mengalir. Mereka menuntut yang demikian itu karena menyangka bahwa Al-Quran bukan merupakan mukjizat. Allah swt telah menolak tuntutan mereka itu dengan firman-Nya:\n\nDan tidak ada yang menghalangi Kami untuk mengirimkan (kepadamu) tanda-tanda (kekuasaan Kami), melainkan karena (tanda-tanda) itu telah didustakan oleh orang terdahulu. (al-Isra/17: 59)\n\nSunatullah yang berlaku adalah jika tanda-tanda kekuasaan Allah telah diminta, dan setelah tanda-tanda itu diturunkan, namun mereka yang menuntutnya tetap membangkang dan tidak percaya, pasti mereka akan dimusnahkan dengan azab Allah. Allah tidak menghendaki yang demikian itu sehingga tidak menurunkan tanda-tanda mukjizat seperti yang mereka tuntut. Nabi Muhammad saw telah diberi mukjizat yang lain untuk menunjukkan kebenaran risalahnya. Tugas pokok Nabi Muhammad saw hanya sekedar menyampaikan risalahnya seperti tugas nabi-nabi sebelum-nya, bukan memenuhi usul dan permintaan kaumnya agar mereka dapat petunjuk. Urusan memberi petunjuk ke dalam hati seseorang hanya di tangan Allah dan tidak menjadi wewenang Nabi Muhammad, seperti diterangkan dalam firman Allah:\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allahlah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah/2: 272)\n\nSesungguhnya Nabi Muhammad hanyalah seorang pemberi peringatan. Bagi tiap-tiap umat ada pemimpin yang memberi petunjuk kepada kebaikan. Mereka itu adalah para nabi dan jika mereka telah tiada, maka ahli hikmah, ulama, dan mujtahidin yang melanjutkan tugas nabi untuk menggali dan menjelaskan syariat secara lebih terperinci yang mengandung unsur-unsur akhlak yang baik dan pedoman hidup bagi umat manusia. Firman Allah:\n\nDan tidak ada satu pun umat melainkan di sana telah datang seorang pemberi peringatan. (Fathir/35: 24)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1715,
                    "inSurah": 8
                },
                "meta": {
                    "juz": 13,
                    "page": 250,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "اللَّهُ يَعْلَمُ مَا تَحْمِلُ كُلُّ أُنثَىٰ وَمَا تَغِيضُ الْأَرْحَامُ وَمَا تَزْدَادُ ۖ وَكُلُّ شَيْءٍ عِندَهُ بِمِقْدَارٍ",
                    "transliteration": {
                        "en": "Allaahu ya'lamu maa tahmilu kullu unsaa wa maa tagheedul arhaamu wa maa tazdaad, wa kullu shai'in 'indahoo bimiqdaar"
                    }
                },
                "translation": {
                    "en": "Allah knows what every female carries and what the wombs lose [prematurely] or exceed. And everything with Him is by due measure.",
                    "id": "Allah mengetahui apa yang dikandung oleh setiap perempuan, apa yang kurang sempurna dan apa yang bertambah dalam rahim. Dan segala sesuatu ada ukuran di sisi-Nya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1715",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1715.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1715.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Usai membeberkan bukti-bukti kemahakuasaan-Nya, pada ayat berikut Allah menjelaskan betapa luas ilmu yang dimiliki-Nya. Allah mengetahui apa yang dikandung oleh setiap perempuan berupa janin, baik terkait jenis kelaminnya, berat badan, maupun tinggi badannya kelak semenjak dalam kandungan. Allah juga mengetahui batas usia dan rezeki janin tersebut ketika kelak ia lahir dan tumbuh. Allah pun mengetahui apa yang kurang sempurna dari janin itu dan apa yang bertambah sehingga janin itu tumbuh dan berkembang dalam rahim. Dan segala sesuatu, baik yang ada dalam kandungan maupun tidak, pasti ada ukuran di sisi-Nya.",
                        "long": "Ayat ini menjelaskan bahwa Allah mengetahui apa yang dikandung oleh setiap perempuan dalam rahimnya, baik isi kandungan itu berjenis kelamin laki-laki ataupun perempuan, satu atau kembar, dan akan panjang usianya atau pendek, seperti tersebut dalam firman-Nya:\n\nDia mengetahui tentang kamu, sejak Dia menjadikan kamu dari tanah lalu ketika kamu masih janin dalam perut ibumu. (an-Najm/53: 32)\n\nAllah mengetahui kandungan rahim yang kurang sempurna, dimana bayinya memiliki cacat tubuh. Allah mengetahui kandungan rahim yang kembar dua, tiga, empat, atau lebih, dan yang masa kandungannya sempurna sembilan bulan, kurang dari itu, ataupun lebih. Menurut penelitian beberapa rumah sakit di London, janin tidak dapat hidup dalam kandungan ibunya lebih dari 305 hari, sedangkan menurut penelitian rumah sakit di Berlin tidak lebih dari 308 hari. Bagi tiap-tiap sesuatu telah ada ukurannya di sisi Allah swt, tidak ada kekurangan atau tambahannya, seperti tersebut dalam firman-Nya:\n\nSungguh, Kami menciptakan segala sesuatu menurut ukuran. (al-Qamar/54: 49)\n\nAyat di atas memberikan pernyataan mengenai proses embriologi yang terjadi dalam kandungan. Ayat selengkapnya mengenai perubahan yang terjadi dalam proses embriologi manusia dapat dilihat pada Surah Al-Muminun/23: 12-16 yang penggalannya sebagai berikut: Dan sungguh, Kami telah menciptakan manusia dari saripati (berasal) dari tanah. Kemudian Kami menjadikannya air mani (yang disimpan) dalam tempat yang kokoh (rahim).¦\n\nDua ayat lain yang membicarakan secara umum mengenai tahapan-tahapan dalam perkembangan manusia. Pertama adalah Surah Nuh/71: 13-14 berikut: Mengapa kamu tidak takut akan kebesaran Allah? Dan sungguh, Dia telah menciptakan kamu dalam beberapa tingkatan (kejadian). Ayat kedua adalah Surah Fathir/35: 11 yang penggalannya sebagai berikut: Dan Allah menciptakan kamu dari tanah kemudian dari air mani, kemudian Dia menjadikan kamu berpasangan (laki-laki dan perempuan)."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1716,
                    "inSurah": 9
                },
                "meta": {
                    "juz": 13,
                    "page": 250,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "عَالِمُ الْغَيْبِ وَالشَّهَادَةِ الْكَبِيرُ الْمُتَعَالِ",
                    "transliteration": {
                        "en": "'Aalimul Ghaibi wash shahaadatil Kaabeerul Muta'aal"
                    }
                },
                "translation": {
                    "en": "[He is] Knower of the unseen and the witnessed, the Grand, the Exalted.",
                    "id": "(Allah) Yang mengetahui semua yang gaib dan yang nyata; Yang Mahabesar, Mahatinggi."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1716",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1716.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1716.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah adalah Tuhan Yang Maha Mengetahui semua yang gaib dan yang nyata; Dia adalah Tuhan Yang Mahabesar, Mahatinggi.",
                        "long": "Ayat ini menjelaskan bahwa Dialah Tuhan Yang Mengetahui yang gaib, yang tampak, dan yang tidak bisa diketahui oleh pancaindra manusia. Ilmu pengetahuan telah membuktikan bahwa ada makhluk yang tidak dapat dilihat dengan mata telanjang, karena kecil sekali. Ia baru dapat dilihat dengan mikroskop dan teleskop, seperti bakteri dan virus yang dapat menularkan bermacam-macam penyakit yang sulit sekali untuk diberantas, atau sampai sekarang belum ditemukan obat pembasminya. Bakteri dan virus itu termasuk tentara Allah, yang tidak dapat diketahui berapa jumlahnya melainkan oleh Allah sendiri, seperti diterangkan dalam firman-Nya:"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1717,
                    "inSurah": 10
                },
                "meta": {
                    "juz": 13,
                    "page": 250,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "سَوَاءٌ مِّنكُم مَّنْ أَسَرَّ الْقَوْلَ وَمَن جَهَرَ بِهِ وَمَنْ هُوَ مُسْتَخْفٍ بِاللَّيْلِ وَسَارِبٌ بِالنَّهَارِ",
                    "transliteration": {
                        "en": "Sawaaa'um minkum man asarral qawla wa man jahara bihee wa man huwa mustakhfim billaili wa saaribum binnahaar"
                    }
                },
                "translation": {
                    "en": "It is the same [to Him] concerning you whether one conceals [his] speech or one publicizes it and whether one is hidden by night or conspicuous [among others] by day.",
                    "id": "Sama saja (bagi Allah), siapa di antaramu yang merahasiakan ucapannya dan siapa yang berterus terang dengannya; dan siapa yang bersembunyi pada malam hari dan yang berjalan pada siang hari."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1717",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1717.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1717.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Karena Dia mengetahui yang gaib dan yang nyata, maka sama saja bagi Allah, siapa di antaramu yang mencoba merahasiakan ucapannya sehingga tidak diketahui orang lain, dan siapa yang berterus terang dengan ucapan-nya; dan sama mudahnya bagi-Nya untuk tahu siapa di antara kamu yang bersembunyi pada malam hari sehingga tidak diketahui orang lain, dan yang berjalan pada siang hari sehingga disaksikan orang lain.",
                        "long": "Selanjutnya ayat ini menerangkan sifat Maha Mengetahui Allah terhadap seseorang yang merahasiakan ucapannya dan menyimpan dalam hatinya, atau yang berterus terang mengucapkannya. Semua itu sama di hadapan Allah. Tidak ada yang samar atau terselubung bagi-Nya. seperti Firman Allah:\n\nDan jika engkau mengeraskan ucapanmu, sungguh, Dia mengetahui rahasia dan yang lebih tersembunyi. (thaha/20: 7)\n\nBegitu pula Allah mengetahui siapa yang bersembunyi di malam hari dan berjalan menampakkan diri di siang hari. Semua itu tetap berada dalam ruang lingkup pengetahuan-Nya karena Allah Maha Mengetahui segalanya. Firman Allah:\n\nDan kunci-kunci semua yang gaib ada pada-Nya; tidak ada yang mengetahui selain Dia. Dia mengetahui apa yang ada di darat dan di laut. Tidak ada sehelai daun pun yang gugur yang tidak diketahui-Nya. Tidak ada sebutir biji pun dalam kegelapan bumi dan tidak pula sesuatu yang basah atau yang kering, yang tidak tertulis dalam Kitab yang nyata (Lauh Mahfudh). (al-Anam/6: 59)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1718,
                    "inSurah": 11
                },
                "meta": {
                    "juz": 13,
                    "page": 250,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَهُ مُعَقِّبَاتٌ مِّن بَيْنِ يَدَيْهِ وَمِنْ خَلْفِهِ يَحْفَظُونَهُ مِنْ أَمْرِ اللَّهِ ۗ إِنَّ اللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا مَا بِأَنفُسِهِمْ ۗ وَإِذَا أَرَادَ اللَّهُ بِقَوْمٍ سُوءًا فَلَا مَرَدَّ لَهُ ۚ وَمَا لَهُم مِّن دُونِهِ مِن وَالٍ",
                    "transliteration": {
                        "en": "Lahoo mu'aqqibaatum mim baini yadaihi wa min khalfihee yahfazoonahoo min amril laah; innal laaha laa yughaiyiru maa biqawmin hattaa yughaiyiroo maa bianfusihim; wa izaaa araadal laahu biqawmin sooo'an falaa maradda lah; wa maa lahum min dooniheeminw waal"
                    }
                },
                "translation": {
                    "en": "For each one are successive [angels] before and behind him who protect him by the decree of Allah. Indeed, Allah will not change the condition of a people until they change what is in themselves. And when Allah intends for a people ill, there is no repelling it. And there is not for them besides Him any patron.",
                    "id": "Baginya (manusia) ada malaikat-malaikat yang selalu menjaganya bergiliran, dari depan dan belakangnya. Mereka menjaganya atas perintah Allah. Sesungguhnya Allah tidak akan mengubah keadaan suatu kaum sebelum mereka mengubah keadaan diri mereka sendiri. Dan apabila Allah menghendaki keburukan terhadap suatu kaum, maka tak ada yang dapat menolaknya dan tidak ada pelindung bagi mereka selain Dia."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1718",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1718.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1718.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Tidak saja mengetahui sesuatu yang tersembunyi di malam hari dan yang tampak di siang hari, Allah, melalui malaikat-Nya, juga mengawasinya dengan cermat dan teliti. Baginya, yakni bagi manusia, ada malaikat-malaikat yang selalu menjaga dan mengawasi-nya secara bergiliran, dari depan dan dari belakangnya. Mereka menjaga dan mengawasinya atas perintah Allah. Sesungguhnya Allah Yang Mahakuasa tidak akan mengubah keadaan suatu kaum dari suatu kondisi ke kondisi yang lain, sebelum mereka mengubah keadaan diri menyangkut sikap mental dan pemikiran mereka sendiri. Dan apabila,yakni andai kata,Allah menghendaki keburukan terhadap suatu kaum-dan ini adalah hal yang mustahil bagi Allah-maka tak ada kekuatan apa pun yang dapat menolaknya dan tidak ada yang dapat menjadi pelindung bagi mereka selain Dia.",
                        "long": "Ayat ini menjelaskan bahwa Allah swt menugaskan kepada beberapa malaikat untuk selalu mengikuti manusia secara bergiliran, di muka dan di belakangnya. Mereka menjaganya atas perintah Allah. Ada malaikat yang bertugas menjaga manusia di malam hari, dan ada yang di siang hari, menjaga dari pelbagai bahaya dan kemudaratan. Ada pula malaikat yang mencatat semua amal perbuatan manusia, yang baik atau yang buruk, yaitu malaikat yang berada di sebelah kanan dan kiri. Malaikat yang berada di sebelah kanan mencatat segala kebaikan, dan yang di sebelah kiri mencatat amal keburukan, dan dua malaikat lainnya, yang satu di depan dan satu lagi di belakang. Setiap orang memiliki empat malaikat empat pada siang hari dan empat pada malam hari. Mereka datang secara bergiliran, sebagaimana diterangkan dalam hadis yang sahih:\n\nAda beberapa malaikat yang menjaga kamu secara bergiliran di malam hari dan di siang hari. Mereka bertemu (untuk mengadakan serah terima) pada waktu salat Subuh dan salat Ashar, lalu naiklah malaikat-malaikat yang menjaga di malam hari kepada Allah Taala. Dia bertanya, sedangkan Ia sudah mengetahui apa yang akan ditanyakannya itu, \"Bagaimana keadaan hamba-hamba-Ku ketika kamu meninggalkan mereka (di dunia)?\" Malaikat menjawab, \"Kami datang kepada mereka ketika salat dan kami meninggalkan mereka, dan mereka pun sedang salat.\" (Riwayat al-Bukhari dari Abu Hurairah)\n\nApabila manusia mengetahui bahwa di sisinya ada malaikat-malaikat yang mencatat semua amal perbuatan dan mengawasinya, maka dia harus selalu menjaga diri dari perbuatan maksiat karena setiap aktivitasnya akan dilihat oleh malaikat-malaikat itu. Pengawasan malaikat terhadap perbuatan manusia dapat diyakini kebenarannya setelah ilmu pengetahuan menciptakan alat-alat modern yang dapat mencatat semua kejadian yang terjadi pada diri manusia. Sebagai contoh, alat pengukur pemakaian aliran listrik dan air minum di tiap-tiap kota dan desa telah diatur sedemikian rupa sehingga dapat diketahui berapa jumlah yang telah dipergunakan dan berapa yang harus dibayar oleh si pemakai. Demikian pula alat-alat yang dipasang di kendaraan bermotor yang dapat mencatat kecepatannya dan mengukur berapa jarak yang telah ditempuh. \n\nPerkembangan ilmu pengetahuan yang dapat mengungkapkan bermacam-macam perkara gaib, sebagai bukti yang dapat memberi keyakinan kepada kita tentang benarnya teori ketentuan agama. Hal itu juga menjadi sebab untuk meyakinkan orang-orang yang dikuasai oleh doktrin kebendaan, sehingga mereka mengakui adanya hal-hal gaib yang tidak dapat dirasakan dan diketahui hanya dengan panca indera. Oleh karena itu, sungguh tepat orang yang mengatakan bahwa kedudukan agama dan pengetahuan dalam Islam laksana dua anak kembar yang tidak dapat dipisahkan, atau seperti dua orang kawan yang selalu bersama seiring sejalan dan tidak saling berbantahan.\n\nMalaikat-malaikat itu menjaga manusia atas perintah Allah dan seizin-Nya. Mereka menjalankan tugas dengan sempurna. Sebagaimana dalam alam kebendaan ada hubungan erat antara sebab dan akibat, sesuai dengan hikmahnya, seperti adanya pelupuk mata yang dapat melindungi mata dari benda yang mungkin masuk dan bisa merusaknya, demikian pula dalam kerohanian, Allah telah menugaskan beberapa malaikat untuk menjaga manusia dari berbagai kemudaratan dan godaan hawa nafsu dan setan. \n\nAllah swt telah menugaskan para malaikat itu untuk mencatat amal perbuatan manusia meskipun kita tidak tahu bagaimana cara mereka mencatat. Kita mengetahui bahwa sesungguhnya Allah sendiri cukup untuk mengetahuinya, tetapi mengapa Dia masih menugaskan malaikat untuk mencatatnya? Mungkin di dalamnya terkandung hikmah agar manusia lebih tunduk dan berhati-hati dalam bertindak karena kemahatahuan Allah melingkupi mereka. Amal mereka terekam dengan akurat sehingga kelak tidak ada yang merasa dizalimi dalam pengadilan Allah.\n\nAli bin Abi Talib mengatakan bahwa tidak ada seorang hamba pun melainkan ada malaikat yang menjaganya dari kejatuhan tembok, jatuh ke dalam sumur, dimakan binatang buas, tenggelam, atau terbakar. Akan tetapi, bilamana datang kepastian dari Allah atau saat datangnya ajal, mereka membiarkan manusia ditimpa oleh bencana dan sebagainya. \n\nAllah tidak akan mengubah keadaan suatu bangsa dari kenikmatan dan kesejahteraan yang dinikmatinya menjadi binasa dan sengsara, melainkan mereka sendiri yang mengubahnya. Hal tersebut diakibatkan oleh perbuatan aniaya dan saling bermusuhan, serta berbuat kerusakan dan dosa di muka bumi. Hadis Rasulullah saw: \n\nJika manusia melihat seseorang yang zalim dan tidak bertindak terhadapnya, maka mungkin sekali Allah akan menurunkan azab yang mengenai mereka semuanya. (Riwayat Abu Dawud, at-Tirmidzi, dan Ibnu Majah dari Abu Bakar ash-shiddiq)\n\nPernyataan ini diperkuat dengan firman Allah:\n\nDan peliharalah dirimu dari siksaan yang tidak hanya menimpa orang-orang yang zalim saja di antara kamu. (al-Anfal/8: 25)\n\nKaum muslimin pada fase pertama penyebaran Islam telah mengikuti ajaran-ajaran Al-Quran dengan penuh keyakinan dan kesadaran, sehingga mereka menjadi umat terbaik di antara manusia. Mereka menguasai berbagai kawasan yang makmur pada waktu itu, serta mengalahkan kerajaan Roma dan Persia dengan menjalankan kebijaksanaan dalam pemerintahan yang adil, dan disaksikan oleh musuh-musuhnya. Orang-orang yang teraniaya dibela dalam rangka menegakkan keadilan. Oleh karena itu, agama Islam telah diakui sebagai unsur mutlak dalam pembinaan karakter bangsa dan pembangunan negara.\n\nSetelah generasi mereka berlalu dan diganti dengan generasi yang datang kemudian, ternyata banyak yang melalaikan ajaran agama tentang keadilan dan kebenaran, sehingga keadaan mereka berubah menjadi bangsa yang hina. Padahal sebelum itu, mereka merupakan bangsa yang terhormat, berwibawa, mulia, dan disegani oleh kawan maupun lawan. Mereka menjadi bangsa yang diperbudak oleh kaum penjajah, padahal sebelumnya mereka sebagai penguasa. Mereka menjadi bangsa yang mengekor, padahal dahulunya mereka merupakan bangsa yang memimpin.\n\nIbnu Khaldun dalam Muqaddimah-nya telah mencantumkan sebuah bab dengan judul: Kezaliman dapat Menghancurkan Kemakmuran. Beliau mengemukakan beberapa contoh dalam sejarah sebelum dan sesudah Islam, bahwa kezaliman itu menghancurkan kekuasaan umat Islam dan merendahkan derajatnya, sehingga menjadi rongrongan dari semua bangsa. Umat Islam yang pernah jaya terpuruk beberapa abad lamanya di bawah kekuasaan dan penjajahan orang Barat.\n\nApabila Allah menghendaki keburukan bagi suatu kaum dengan penyakit, kemiskinan, atau bermacam-macam cobaan yang lain sebagai akibat dari perbuatan buruk yang mereka kerjakan, maka tak ada seorang pun yang dapat menolaknya dan sekali-kali tidak ada pelindung bagi mereka selain Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1719,
                    "inSurah": 12
                },
                "meta": {
                    "juz": 13,
                    "page": 250,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هُوَ الَّذِي يُرِيكُمُ الْبَرْقَ خَوْفًا وَطَمَعًا وَيُنشِئُ السَّحَابَ الثِّقَالَ",
                    "transliteration": {
                        "en": "Huwal lazee yureekumul barqa khawfanw wa tama'anw wa yunshi'us sahaabas siqaal"
                    }
                },
                "translation": {
                    "en": "It is He who shows you lightening, [causing] fear and aspiration, and generates the heavy clouds.",
                    "id": "Dialah yang memperlihatkan kilat kepadamu, yang menimbulkan ketakutan dan harapan, dan Dia menjadikan mendung."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1719",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1719.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1719.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Melanjutkan penyebutan tanda-tanda kekuasaan-Nya pada ayatayat yang lalu, beberapa ayat berikut Allah berbicara tentang kilat, halilintar, mendung, dan air hujan. Allah berfirman, \"Dialah Allah, Tuhan Yang Mahakuasa, yang memperlihatkan kilat kepadamu, yakni seberkas cahaya yang memancar dan menghilang secara cepat, yang kadangkala menimbulkan ketakutan pada diri kamu, dan kadangkala menimbulkan harapan yang menggembirakan”yakni pertanda segera turun hujan. Dan Dia pula yang menjadikan mendung yang akan menurunkan hujan.",
                        "long": "Dialah Tuhan yang memperlihatkan kilat, yang menimbulkan ketakutan disambar petir bagi orang-orang yang sedang berada di alam bebas atau bepergian. Tetapi kadangkala kilat dan petir itu menimbulkan harapan bagi orang lain seperti para petani yang mengharapkan turunnya hujan untuk mengairi sawah dan ladangnya. Demikian pula segala sesuatu di dunia ini, kadang-kadang dipandang baik karena dibutuhkan pada masa-masa tertentu, dan kadangkala dipandang buruk mengingat kemudaratan yang mungkin ditimbulkannya. Allah pula yang mengadakan awan mendung yang mengandung air hujan dan karena beratnya, maka awan tersebut tercurah ke permukaan bumi turun menjadi hujan.\n\nMenurut kajian saintis, terbentuknya awan-awan mendung (thunder-clouds), kilat, guruh, dan halilintar, sebagaimana diungkapkan dalam Al-Quran, sejak awal diyakini oleh banyak ilmuwan merupakan fenomena alam yang mempunyai hubungan yang erat dengan proses kejadian hujan dan atau badai yang sering terjadi di permukaan bumi. Fenomena ini adalah salah satu tanda kekuasaan dan keperkasaan Allah.\n\nMemang tidak semua jenis awan bisa mendatangkan hujan. Awan yang dapat menyebabkan turunnya hujan adalah awan dari jenis kumulonimbus (cumulonimbus). Menurut saintis, awan yang terbentuk akan menghasilkan pemisah muatan (listrik) positif dan negatif. Muatan positif umumnya berkumpul di bagian atas awan, sedangkan muatan negatif berkumpul di bagian bawah awan. Muatan tersebut akan mengalir melalui berbagai cara seperti antar kantong muatan di awan, dari awan ke bumi, lepas melalui udara sebagai aliran muatan elektrostatik, dan meloncat ke ionosfer. Lompatan bunga api raksasa ini dikenal sebagai petir, kilat, atau halilintar. Sebagai akibatnya udara terbelah, sambarannya yang memiliki kecepatan mencapai 150.000 km/detik akan menimbulkan bunyi menggele-gar yang biasa kita sebut geluduk, geledek, guruh, guntur, dan lain-lain. Suara geledek ini menciutkan hati manusia yang mendengarnya dan dampaknya kerap bisa mematikan manusia. Inilah yang dimaksud dengan \"kilat yang menakutkan\".\n\nBenjamin Franklin (1752) berhasil membuktikan bahwa petir adalah suatu lompatan listrik (electric discharge) yang sangat besar. Dari hasil penelitian kemudian diketahui bahwa besar medan listrik minimal yang memungkinkan terpicunya petir ini adalah sekitar 1.000.000 volt per meter. \n\nDalam kondisi tertentu, bumi yang cenderung menjadi peredam listrik statis, bisa pula ikut berinteraksi. Hal ini dimungkinkan terjadi peng-konsentrasian listrik bermuatan positif karena adanya beda muatan antara dasar awan dengan permukaan bumi. Yang terjadi kemudian adalah perpindahan muatan listrik. Maka secara fisik kita akan melihat sambaran petir dengan muatan listrik yang begitu besar, selanjutnya akan segera menyebar ke bagian permukaan bumi yang kemudian menjalar ke dalam tanah dan akhirnya ternetralisasi pada kedalaman yang mengandung air tanah. Tempat terjadinya perpindahan muatan listrik ini yang sering kali mendatangkan musibah dan kerusakan. Ini yang biasa dikenal dengan istilah disambar petir atau geledek.\n\nDari sisi pengamatan lainnya diketahui bahwa petir mempunyai manfaat bagi bumi dan manusia. Petir merupakan proses alam yang menghasilkan unsur nitrogen yang dibutuhkan tumbuh-tumbuhan dan mengisi sekitar 4/5 atmosfir bumi, bahkan petir juga berfungsi dalam sirkuit global listrik. Kilatan petir raksasa diyakini akan dapat membantu menyeimbangkan sirkuit global listrik antara bumi dan angkasa dan juga berkonsentrasi dalam pembentukan ozon. Selain itu maka kilat yang berkilauan itu bisa menghasilkan jamur. Menurut penelitian di Jepan, jamur shiitake bisa tumbuh subur bila di sekitar benih yang ditaburkan itu diberi loncatan listrik, yang sama dengan efek kilat. Hal ini berdasarkan pengalaman bahwa setelah kemarin sorenya ada kilat, besoknya di sekitarnya tumbuh banyak sekali jamur. Selain itu panjang (kekuatan) kilat bisa meramalkan curah hujan yang bakal turun keesokan harinya. Demikian penjelasan dari pandangan saintis."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1720,
                    "inSurah": 13
                },
                "meta": {
                    "juz": 13,
                    "page": 250,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَيُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ وَيُرْسِلُ الصَّوَاعِقَ فَيُصِيبُ بِهَا مَن يَشَاءُ وَهُمْ يُجَادِلُونَ فِي اللَّهِ وَهُوَ شَدِيدُ الْمِحَالِ",
                    "transliteration": {
                        "en": "Wa yusabbihur ra'du bihamdihee walmalaaa'ikatu min kheefatihee wa yursilus sawaa'iqa fa yuseebu bihaa mai yashaaa'u wa hum yujaadiloona fil laahi wa Huwa shadeedul mihaal"
                    }
                },
                "translation": {
                    "en": "And the thunder exalts [Allah] with praise of Him - and the angels [as well] from fear of Him - and He sends thunderbolts and strikes therewith whom He wills while they dispute about Allah; and He is severe in assault.",
                    "id": "Dan guruh bertasbih memuji-Nya, (demikian pula) para malaikat karena takut kepada-Nya, dan Allah melepaskan halilintar, lalu menimpakannya kepada siapa yang Dia kehendaki, sementara mereka berbantah-bantahan tentang Allah, dan Dia Mahakeras siksaan-Nya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1720",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1720.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1720.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Lazimnya, sambaran kilat akan diiringi oleh guruh. Dan guruh senantiasa bertasbih kepada Allah dengan memuji-Nya, demikian pula para malaikat karena takut kepada-Nya, dan Allah melepaskan halilintar yang kadangkala membakar apa yang ditemuinya, lalu Allah menimpakannya kepada siapa yang Dia kehendaki melalui hukum sebab akibat yang telah diletakkan Allah di alam semesta. Sementara itu, walaupun bukti-bukti kekuasaan Allah tampak begitu nyata, namun mereka (orang-orang kafir) masih berbantah-bantahan dengan engkau, wahai Nabi Muhammad, tentang Allah. Dan Dia-lah Tuhan Yang Mahakeras siksaan-Nya.",
                        "long": "Suara menggelegar yang dikeluarkan oleh petir akibat terjadinya lompatan listrik yang sangat besar menurut Al-Quran adalah bacaan tasbihnya dalam memuji Allah. Ini merupakan tanda ketundukannya kepada Allah, menyucikan-Nya dari persekutuan dan pengungkapan kelemahan dirinya dibandingkan kekuasaan Penciptanya Yang Mahaluhur dan Maha Agung. Tiap-tiap benda yang bersuara maka suaranya itu berarti tasbih, hanya saja manusia tidak mengerti bahasanya:\n\nDan tidak ada sesuatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. (al-Isra/17: 44)\n\nApabila kita mendengar suara guntur dan halilintar, maka disunatkan untuk membaca doa, sebagaimana hadis Rasulullah yang diriwayatkan oleh al-Bukhari, Ahmad, at-Tirmidzi, an-Nasai dari Ibnu Umar, bahwa Nabi Muhammad saw bila mendengar suara guntur dan halilintar beliau membaca:\n\nYa Allah, janganlah Engkau membunuh kami dengan kemurkaan-Mu, janganlah Engkau membinasakan kami dengan azab-Mu, dan berilah kesehatan kepada kami sebelum itu.\n\nIbnu Mardawaih meriwayatkan hadis dari Abu Hurairah sebagai berikut:\n\nBahwa Rasulullah saw bila ada tiupan angin yang keras, atau mendengar suara guruh, warna mukanya berubah, lalu beliau berkata untuk guruh itu, \"Mahasuci Zat, yang guruh bertasbih kepada-Nya.\" Dan kepada angin beliau berkata, \"Ya Allah jadikanlah angin itu sebagai rahmat dan jangan jadikan sebagai azab.\"\n\nDemikian pula para malaikat bertasbih karena takut kepada Allah dan memuji kepada-Nya. Allah melepaskan halilintar, lalu mengenai siapa yang Dia kehendaki dan membinasakannya. Namun demikian, mereka tetap berbantah-bantahan tentang sifat-sifat Allah yang telah diterangkan oleh rasul-Nya, seperti: ilmu-Nya yang sempurna, kekuasaan, keesaan, dan ketentuan-Nya menghidupkan manusia kembali di hari kiamat untuk menghisab mereka pada hari pengadilan dan pembalasan. \n\nPada ayat ini, Allah swt menyuruh Nabi supaya bersikap sabar atas keingkaran orang-orang musyrik yang menuntutnya untuk mendatangkan mukjizat seperti tongkat Musa, mukjizat Isa, dan lain-lain. Padahal, Al-Quran sendiri adalah mukjizat terbesar dan kekal sepanjang masa, tidak dapat ditiru oleh siapapun juga. Allah menyuruh Nabi bersabar karena mereka itu sudah melampaui batas sampai mengingkari ketuhanan Allah dan Keesaan-Nya, mengadakan berbagai sekutu bagi-Nya, mengatakan bahwa Allah mempunyai anak, dan mengingkari adanya hari kebangkitan dan pembalasan. Dengan cara demikian, Allah swt menenteramkan hati Nabi supaya jangan larut dalam kesedihan dalam menghadapi semua tantangan itu, dan menyatakan bahwa Dialah Tuhan Yang Mahakeras (siksa-Nya), seperti tercantum dalam firman-Nya:\n\nDan begitulah siksa Tuhanmu apabila Dia menyiksa (penduduk) negeri-negeri yang berbuat zalim. Sungguh, siksa-Nya sangat pedih, sangat berat. (Hud/11: 102)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1721,
                    "inSurah": 14
                },
                "meta": {
                    "juz": 13,
                    "page": 251,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَهُ دَعْوَةُ الْحَقِّ ۖ وَالَّذِينَ يَدْعُونَ مِن دُونِهِ لَا يَسْتَجِيبُونَ لَهُم بِشَيْءٍ إِلَّا كَبَاسِطِ كَفَّيْهِ إِلَى الْمَاءِ لِيَبْلُغَ فَاهُ وَمَا هُوَ بِبَالِغِهِ ۚ وَمَا دُعَاءُ الْكَافِرِينَ إِلَّا فِي ضَلَالٍ",
                    "transliteration": {
                        "en": "Lahoo da'watul haqq; wallazeena yad'oona min doonihee laa yastajeeboona lahum bishai'in illaa kabaasiti kaffaihi ilal maaa'i liyablugha faahu wa maa huwa bibaalighih; wa maa du'aaa'ul aafireena illaa fee dalaal"
                    }
                },
                "translation": {
                    "en": "To Him [alone] is the supplication of truth. And those they call upon besides Him do not respond to them with a thing, except as one who stretches his hands toward water [from afar, calling it] to reach his mouth, but it will not reach it [thus]. And the supplication of the disbelievers is not but in error [i.e. futility].",
                    "id": "Hanya kepada Allah doa yang benar. Berhala-berhala yang mereka sembah selain Allah tidak dapat mengabulkan apa pun bagi mereka, tidak ubahnya seperti orang yang membukakan kedua telapak tangannya ke dalam air agar (air) sampai ke mulutnya. Padahal air itu tidak akan sampai ke mulutnya. Dan doa orang-orang kafir itu, hanyalah sia-sia belaka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1721",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1721.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1721.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah Mahakuasa dalam menciptakan dan mengatur alam semesta. Keluasan ilmu Allah juga tak terbatas. Karena itu, hanya kepada-Nyalah seharusnya manusia memanjatkan doa. Hanya kepada Allah doa yang benar untuk dimohonkan. Berhala-berhala yang mereka (kaum kafir) sembah dan agungkan selain Allah tidak akan dapat mengabulkan permintaan apa pun bagi mereka. Keadaan mereka yang memohon kepada berhala tidak ubahnya seperti orang yang membukakan kedua telapak tangannya ke dalam air di dalam sumur agar air itu dapat diciduknya untuk dia arahkan sampai ke mulutnya. Padahal telapak tangannya yang terbuka itu tidak sampai ke kedalaman air sumur itu, sehingga air tersebut tidak akan sampai ke mulutnya. Dan doa orang-orang kafir itu hanyalah doa yang sia-sia belaka.",
                        "long": "Ayat ini menjelaskan bahwa hanya Allah yang memiliki wewenang untuk mengabulkan doa yang benar. Ada pula yang menafsirkan: hanya kepada Allah saja seruan yang benar tentang ketauhidan, kemurnian, dan keikhlasan dalam ibadah. Berhala-berhala yang disembah kaum musyrik tidak dapat mengabulkan permintaan mereka sedikit pun. Meminta sesuatu kepada berhala ibarat orang yang ingin minum, tetapi hanya dengan membuka kedua telapak tangannya ke dalam air. Ia berharap supaya air itu naik sendiri ke dalam mulutnya. Padahal air itu tentu tidak akan mungkin masuk dengan sendirinya ke dalam mulutnya tanpa ditampung dulu dengan kedua telapak tangan. Demikian pula berhala-berhala yang mereka sembah, jangankan memenuhi permintaan penyembahnya, ditanya saja mereka tidak dapat menjawab. Doa dan ibadah orang-orang kafir kepada berhala hanya sia-sia belaka. Bila mereka berdoa kepada Allah, doanya tidak dikabulkan karena mereka tidak meyakini kekuasaan-Nya. Jika mereka berdoa kepada berhala-berhala, sedikit pun mereka tidak bisa mendengar apalagi mengabulkan permintaannya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1722,
                    "inSurah": 15
                },
                "meta": {
                    "juz": 13,
                    "page": 251,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": true,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلِلَّهِ يَسْجُدُ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَظِلَالُهُم بِالْغُدُوِّ وَالْآصَالِ ۩",
                    "transliteration": {
                        "en": "Wa lillaahi yasjudu man fis samaawaati wal ardi taw 'anw wa karhanw wa zilaaluhum bilghuduwwi wal aasaal"
                    }
                },
                "translation": {
                    "en": "And to Allah prostrates whoever is within the heavens and the earth, willingly or by compulsion, and their shadows [as well] in the mornings and the afternoons.",
                    "id": "Dan semua sujud kepada Allah baik yang di langit maupun yang di bumi, baik dengan kemauan sendiri maupun terpaksa (dan sujud pula) bayang-bayang mereka, pada waktu pagi dan petang hari."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1722",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1722.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1722.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Hanya kepada Allah-lah manusia pantas memanjatkan doa. Karena itu, hanya kepada Dia pula seharusnya makhluk bersujud dan merendahkan diri. Dan semua makhluk sujud kepada Allah, baik makhluk yang ada di langit maupun makhluk yang ada di bumi, baik dengan sadar dan kemauan sendiri, maupun dengan cara terpaksa; dan bersujud pula bayang-bayang mereka, pada waktu pagi dan petang hari.",
                        "long": "Ayat ini menegaskan bahwa hanya kepada Allah semua malaikat, jin, dan manusia yang beriman tunduk, sujud, dan patuh, baik dalam keadaan lapang maupun sempit, yang berada di langit dan di bumi, rela dan ikhlas dengan kemauan sendiri. Sedangkan orang-orang kafir hanya tunduk dan patuh apabila dalam keadaan darurat atau terdesak, seperti dalam firman Allah:\n\nDan apabila kamu ditimpa bahaya di lautan, niscaya hilang semua yang (biasa) kamu seru, kecuali Dia. (al-Isra/17: 67)\n\nMaka apabila mereka naik kapal, mereka berdoa kepada Allah dengan penuh rasa pengabdian (ikhlas) kepada-Nya, tetapi ketika Allah menyelamatkan mereka sampai ke darat, malah mereka (kembali) mempersekutukan (Allah). (al-Ankabut/29: 65)\n\nAllah menjelaskan bahwa bukan hanya tubuh-tubuh mereka saja yang tunduk, sujud, dan patuh kepada Allah, tetapi sujud pula bayang-bayang mereka di waktu pagi dan petang. Setiap benda yang kena sinar matahari terutama di waktu pagi dan petang tentu kelihatan bayang-bayangnya memendek atau memanjang. Semua benda dan bayang-bayangnya tunduk kepada Allah, baik dengan kemauan sendiri maupun terpaksa. Hal ini menunjukkan kekuasaan Allah yang Mahasempurna."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1723,
                    "inSurah": 16
                },
                "meta": {
                    "juz": 13,
                    "page": 251,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قُلْ مَن رَّبُّ السَّمَاوَاتِ وَالْأَرْضِ قُلِ اللَّهُ ۚ قُلْ أَفَاتَّخَذْتُم مِّن دُونِهِ أَوْلِيَاءَ لَا يَمْلِكُونَ لِأَنفُسِهِمْ نَفْعًا وَلَا ضَرًّا ۚ قُلْ هَلْ يَسْتَوِي الْأَعْمَىٰ وَالْبَصِيرُ أَمْ هَلْ تَسْتَوِي الظُّلُمَاتُ وَالنُّورُ ۗ أَمْ جَعَلُوا لِلَّهِ شُرَكَاءَ خَلَقُوا كَخَلْقِهِ فَتَشَابَهَ الْخَلْقُ عَلَيْهِمْ ۚ قُلِ اللَّهُ خَالِقُ كُلِّ شَيْءٍ وَهُوَ الْوَاحِدُ الْقَهَّارُ",
                    "transliteration": {
                        "en": "Wul mar Rabbus samaawaati wal ard; qulillaah; qul afattakhaztum min dooniheee awliyaaa'a laa yamlikoona li anfusihim naf'anw wa laa darraa; qul hal yastawil a'maa wal baseeru am hal tastawiz zulumaatu wannoor; am ja'aloo lillaahi shurakaaa'a khalaqoo kakhalqihee fatashaa bahal khalqu 'alaihim; qulil laahu Khaaliqu kulli shai'inw wa Huwal Waahidul Qahhar"
                    }
                },
                "translation": {
                    "en": "Say, \"Who is Lord of the heavens and earth?\" Say, \"Allah.\" Say, \"Have you then taken besides Him allies not possessing [even] for themselves any benefit or any harm?\" Say, \"Is the blind equivalent to the seeing? Or is darkness equivalent to light? Or have they attributed to Allah partners who created like His creation so that the creation [of each] seemed similar to them?\" Say, \"Allah is the Creator of all things, and He is the One, the Prevailing.\"",
                    "id": "Katakanlah (Muhammad), “Siapakah Tuhan langit dan bumi?” Katakanlah, “Allah.”  Katakanlah, “Pantaskah kamu mengambil pelindung-pelindung selain Allah, padahal mereka tidak kuasa mendatangkan manfaat maupun menolak mudarat bagi dirinya sendiri?”  Katakanlah, “Samakah orang yang buta dengan yang dapat melihat? Atau samakah yang gelap dengan yang terang? Apakah mereka menjadikan sekutu-sekutu bagi Allah yang dapat menciptakan seperti ciptaan-Nya sehingga kedua ciptaan itu serupa menurut pandangan mereka?” Katakanlah, “Allah adalah Pencipta segala sesuatu dan Dia Tuhan Yang Maha Esa, Mahaperkasa.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1723",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1723.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1723.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat-ayat yang lalu telah membuktikan betapa Allah Mahakuasa, Maha Mengetahui, dan Mahaperkasa. Melalui ayat berikut Allah lalu meminta Nabi Muhammad mengajukan pertanyaan kepada orang-orang kafir. Katakanlah, \"Siapakah Tuhan pemilik langit dan bumi?\" Katakanlah, wahai Nabi Muhammad, \"Allah\". Katakanlah lagi kepada mereka, \"Pantaskah kamu, wahai penduduk Mekah, mengambil berhala sebagai pelindung-pelindung selain Allah, padahal mereka tidak kuasa mendatangkan manfaat maupun menolak mudarat bagi dirinya sendiri?\" Katakanlah, wahai Nabi, \"Samakah orang yang buta dengan yang dapat melihat? Atau samakah keadaan yang gelap gulita dengan keadaan yang terang benderang? Apakah mereka, yakni orang yang menyekutukan Allah, menjadikan pula sekutu-sekutu bagi Allah yang dapat menciptakan seperti ciptaan-Nya, sehingga kedua ciptaan itu serupa menurut pandangan mereka?\" Katakanlah, \"Allah adalah Pencipta segala sesuatu, tidak akan pernah ada yang wujud kecuali Dia ciptakan, dan Dia Tuhan Yang Maha Esa, Mahaperkasa.\"",
                        "long": "Ayat ini menjelaskan bahwa Nabi diminta oleh Allah swt untuk menanyakan kepada orang-orang yang menyekutukan Allah, \"Siapakah pencipta alam semesta yang keindahannya sangat mengagumkan manusia?\" Kemudian Nabi sendiri diminta untuk menjawab pertanyaan itu dan mengatakan kepada mereka, \"Dialah Allah yang menciptakan semuanya, mengatur, dan memeliharanya secara tertib dan sempurna.\" Allah swt memerintahkan Nabi Muhammad saw supaya menjawab pertanyaan itu karena bunyi jawaban itu akan sama dengan yang diucapkan oleh orang-orang musyrik sendiri. Mereka tidak akan mengingkari bahwa penciptanya adalah Allah sendiri, seperti tersebut dalam firman-Nya:\n\nDan jika engkau bertanya kepada mereka, \"Siapakah yang menciptakan langit dan bumi dan menundukkan matahari dan bulan?\" Pasti mereka akan menjawab, \"Allah.\" Maka mengapa mereka bisa dipalingkan (dari kebenaran). (al-Ankabut/29: 61)\n\nJika memang Allah pencipta alam semesta, maka patutkah mereka mengambil pelindung-pelindung selain Allah, padahal berhala-berhala yang mereka sembah itu tidak dapat memberi kemanfaatan atau menolak kemudaratan. Mengapa mereka tetap menjadikan benda-benda mati itu menjadi pelindung? Mengapa akal pikiran mereka tidak digunakan untuk menentukan pilihan yang benar? Padahal benda-benda tersebut tidak mempunyai kemampuan apa-apa meskipun hanya menciptakan seekor lalat. Firman Allah:\n\nSesungguhnya segala yang kamu seru selain Allah tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tidak akan dapat merebutnya kembali dari lalat itu. (al-hajj/22: 73)\n\nKemudian dalam rangka membuka tabir kepicikan akal mereka, sehingga tidak dapat membandingkan antara yang baik dan yang buruk, Nabi saw diperintahkan untuk mengatakan kepada mereka adakah sama orang buta yang sama sekali tidak dapat melihat dengan orang yang matanya sehat, dapat melihat semua benda di hadapannya dengan terang dan jelas? Tentu saja jawabannya adalah tidak sama. Jika ditanyakan pula kepada mereka apakah sama gelap gulita dengan terang benderang? Tentu jawabannya juga tidak sama. Dengan demikian, akhirnya dapat disimpulkan bahwa Allah Yang Maha Esa dan Sempurna dalam segala-galanya tidak bisa disamakan dengan berhala, benda mati yang sama sekali tidak dapat memberi manfaat dan menolak kemudaratan. Demikian pula kekafiran seseorang kepada Allah dan rasul-Nya tidak sama dengan cahaya keimanan seorang mukmin yang memancar dari wajah dan hatinya. Pertanyaan selanjutnya, apakah berhala-berhala yang mereka sembah itu dapat menciptakan makhluk seperti ciptaan Allah, sehingga kedua ciptaan itu serupa menurut pandangan mereka, dan sukar dibedakan mana ciptaan berhala dan mana ciptaan Allah?\n\nJika Allah bisa disamakan dengan berhala dalam penciptaan maka ada alasan bagi mereka untuk menyekutukan-Nya. Akan tetapi, kenyataannya tidak demikian. Berhala-berhala itu adalah benda mati, jangankan dapat disamakan ciptaannya dengan ciptaan Allah, wujudnya saja ada karena diukir oleh tangan manusia. Mereka tidak dapat menjawab jika ditanya dan tidak dapat memberi kemanfaatan dan kemudaratan sedikit pun kepada penyembahnya. Sesajen yang dihidangkan di hadapannya jika dicuri oleh lalat, mereka sama sekali tidak dapat mengambilnya kembali. Bahkan jika penyembah-penyembahnya sedang lengah, seekor serigala pun dapat mengencingi kepalanya.\n\nAllah adalah Pencipta segala sesuatu, termasuk pula Pencipta berhala-berhala, dan Dialah Allah Yang Maha Esa lagi Mahaperkasa. Mengapa kamu menyembah kepada selain-Nya, yang sama sekali tidak memberi manfaat dan kemudaratan?"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1724,
                    "inSurah": 17
                },
                "meta": {
                    "juz": 13,
                    "page": 251,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَنزَلَ مِنَ السَّمَاءِ مَاءً فَسَالَتْ أَوْدِيَةٌ بِقَدَرِهَا فَاحْتَمَلَ السَّيْلُ زَبَدًا رَّابِيًا ۚ وَمِمَّا يُوقِدُونَ عَلَيْهِ فِي النَّارِ ابْتِغَاءَ حِلْيَةٍ أَوْ مَتَاعٍ زَبَدٌ مِّثْلُهُ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْحَقَّ وَالْبَاطِلَ ۚ فَأَمَّا الزَّبَدُ فَيَذْهَبُ جُفَاءً ۖ وَأَمَّا مَا يَنفَعُ النَّاسَ فَيَمْكُثُ فِي الْأَرْضِ ۚ كَذَٰلِكَ يَضْرِبُ اللَّهُ الْأَمْثَالَ",
                    "transliteration": {
                        "en": "Anzala minas samaaa'i maaa'an fasaalat awdiyatum biqadarihaa fahtamalas sailu zabadar raabiyaa; wa mimmmaa yooqidoona 'alaihi fin naarib tighaaa'a bilyatin aw mataa'in zabadum misluh; kazaalika yadribul laahul haqqa wal baatil; fa ammaz zabadu fa yazhabu jufaaa'aa; wa ammaa maa yanfa'un naasa fa yamkusu fil ard; kazaalika yadribul laahul amsaal"
                    }
                },
                "translation": {
                    "en": "He sends down from the sky, rain, and valleys flow according to their capacity, and the torrent carries a rising foam. And from that [ore] which they heat in the fire, desiring adornments and utensils, is a foam like it. Thus Allah presents [the example of] truth and falsehood. As for the foam, it vanishes, [being] cast off; but as for that which benefits the people, it remains on the earth. Thus does Allah present examples.",
                    "id": "Allah telah menurunkan air (hujan) dari langit, maka mengalirlah ia (air) di lembah-lembah menurut ukurannya, maka arus itu membawa buih yang mengambang. Dan dari apa (logam) yang mereka lebur dalam api untuk membuat perhiasan atau alat-alat, ada (pula) buihnya seperti (buih arus) itu. Demikianlah Allah membuat perumpamaan tentang yang benar dan yang batil. Adapun buih, akan hilang sebagai sesuatu yang tidak ada gunanya; tetapi yang bermanfaat bagi manusia, akan tetap ada di bumi. Demikianlah Allah membuat perumpamaan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1724",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1724.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1724.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat berikut merinci kekuasaan Allah yang tidak dimiliki oleh berhala sesembahan orang-orang musyrik Mekah. Allah telah menurunkan dalam bentuk curahan air hujan dari langit, maka mengalirlah ia, yakni air hujan yang dicurahkan itu, di lembah-lembah menurut ukurannya, maka arus itu membawa buih yang mengambang. Dan dari apa (logam) yang mereka lebur dalam api untuk membuat perhiasan atau alat-alat yang beraneka ragam, ada pula buihnya seperti buih arus itu. Demikianlah Allah membuat perumpamaan tentang mana yang benar dan mana yang batil. Adapun buih, lambang dari kebatilan, akan hilang sebagai sesuatu yang tidak ada gunanya; tetapi kebenaran adalah sesuatu yang bermanfaat bagi manusia, dan manfaat itu akan tetap ada di bumi. Demikianlah Allah membuat perumpamaan bagi orang-orang yang mau berpikir.",
                        "long": "Allah menurunkan air hujan dari langit yang mengandung awan, lalu mengalirkan air hujan itu ke berbagai lembah yang lebar dan yang sempit sesuai dengan ukurannya. Kajian saintis menjelaskan bahwa lembah-lembah umumnya terbentuk oleh gerusan air. Air pertama-tama menggerus bagian-bagian batuan yang paling lunak dan kemudian membentuk aliran sungai. Alur aliran sungai ini lambat laun membesar membentuk lembah-lembah sungai. Ukuran lembah-lembah sungai umumnya selain dipengaruhi oleh besarnya aliran air yang juga ditentukan oleh besarnya curah hujan, kekerasan batuan dan umur batuan. Dalam bidang geomorfologi dikenal besaran kerapatan sungai, yaitu jumlah panjang sungai yang terdapat pada satu luasan daerah dengan satuan km/km2. Besarnya kerapatan sungai umumnya menggambarkan besarnya curah hujan di daerah tersebut. \n\nArus air itu akan menimbulkan banyak buih di permukaannya yang merupakan gumpalan buih yang ikut bergerak dengan arus air, sehingga bila ada angin kencang yang bertiup, maka buih itu akan segera lenyap dari pandangan mata. Menurut kajian saintifik, buih adalah zat mengambang di atas air yang mengandung banyak udara. Terjadinya buih merupakan bagian dari proses pemurnian air yang terjadi secara alami dalam pengalirannya (dikenal dengan istilah self purification). Pemurnian ini terjadi karena adanya pencampuran dengan udara yang melarut ke dalam air terutama oksigen. Dengan adanya oksidasi, pengotor (umumya senyawa organik) yang terlarut di dalam air mengurai dan bagian yang ringan mengapung di atas permukaan air, sedangkan bagian yang berat akan tenggelam dan mengendap. Inilah perumpamaan yang pertama yang dikemukakan oleh Allah swt tentang kebenaran dan kebatilan serta tentang keimanan dan kekafiran.\n\nBuih juga bisa terbentuk dalam proses pemurnian logam dengan pemanasan. Bijih logam di alam umumnya ditemukan dalam bahan padat yang tidak murni. Pada proses peleburan, bijih mencair, dan logam-logam yang berat akan tenggelam sedangkan bagian yang kurang bermanfaat atau yang dapat merusak mutu hasil biasanya berupa buih dan akan mengapung ke permukaan bersama udara yang terkandung di dalamnya. Logam tersebut dibuat untuk perhiasan dan alat-alat keperluan rumah tangga, pertanian, pertukangan, dan perindustrian. Inilah perumpamaan yang kedua. \n\nDemikianlah Allah membuat perumpamaan bagi yang benar dan yang batil. Kebenaran dan kebatilan itu bila bercampur, seperti arus air yang bercampur dengan buih, atau seperti logam yang dibakar yang sama-sama juga mengeluarkan buih berupa kotoran karat yang semula melekat pada logam itu, kemudian terpisah karena pengaruh api yang membakarnya. Maka sebagaimana buih yang berada di atas arus air akan lenyap setelah ada tiupan angin, dan buih yang berada di atas logam yang sedang dibakar akan hilang pula karena api, demikian pula perkara yang batil akan hilang musnah bilamana datang hak dan kebenaran yang jelas. \n\nBuih itu akan hilang tersangkut di pinggir lembah dan pohon atau ditiup angin. Demikian pula kotoran atau karat yang semula melekat pada logam akan habis terbakar. Yang tinggal hanya yang memberi manfaat saja kepada manusia, yaitu air, yang dapat diminum, digunakan untuk mengairi tanaman yang bermanfaat bagi manusia dan binatang, emas yang digunakan untuk perhiasan, dan logam-logam lainnya untuk alat rumah tangga, pertanian, dan sebagainya.\n\nDari kedua perumpamaan itu dapat diambil pengertian bahwa Allah swt telah menurunkan Al-Quran kepada Nabi Muhammad saw kemudian disampaikan ke dalam hati manusia yang masing-masing tidak sama potensi dan persiapannya untuk menerima. Masing-masing mempunyai keterbatasan dalam hal bacaan, pengertian, hafalan, dan pengamalannya. Ayat Al-Quran menjadi unsur kehidupan kerohanian dan kebahagiaan hidup sebagaimana air menjadi sebab hidup semua makhluk.\n\nDi antara tanah yang ditimpa hujan itu ada yang tandus, tidak dapat menumbuhkan tanam-tanaman, hanya sekedar menyimpan air saja, yang dapat dijadikan sumber penampungan air jernih. Ada pula tanah yang subur yang setelah disiram dengan air hujan dapat menghasilkan bermacam-macam hasil bumi. Itulah air yang bermanfaat bagi manusia dan binatang-binatang. Di antara logam yang dilebur dalam api seperti emas, perak, tembaga, perunggu, dan timah, ada yang dijadikan alat rumah tangga, pertukangan, perindustrian dan sebagainya. Orang mukmin diumpamakan seperti air dan logam yang bermanfaat bagi manusia dan binatang. Buih yang semula bercampur kemudian lenyap karena tiupan angin atau habis dibakar oleh api, adalah perumpamaan bagi kekafiran dan kebatilan yang akhirnya hancur bila berhadapan dengan hak dan kebenaran, firman Allah:\n\nDan katakanlah, \"Kebenaran telah datang dan yang batil telah lenyap.\" Sungguh, yang batil itu pasti lenyap. (al-Isra/17: 81)\n\nDemikianlah Allah membuat perumpamaan yang indah yang dapat menjelaskan kepada manusia apa yang masih dipandang sulit oleh mereka tentang masalah-masalah agamanya, agar jelas perbedaan antara yang hak dan yang batil, antara keimanan dan kekafiran, sehingga mereka dapat menempuh jalan petunjuk kepada kebahagiaan dan menghindari jalan yang dimurkai Allah dan menyesatkan.\n\nDengan memperhatikan perumpamaan-perumpamaan yang tepat dan baik itu niscaya umat Islam akan menjadi umat terbaik yang dikeluarkan di muka bumi untuk jadi teladan bagi umat yang lain. Al-Bukhari dan Muslim meriwayatkan hadis dari Abu Musa Al-Asyari:\n\nSesungguhnya perumpamaan petunjuk dan ilmu yang Allah mengutus diriku, adalah seperti air hujan yang menimpa bumi. Di antaranya ada sebagian bumi yang menerima air itu, lalu menumbuhkan rumput dan tanam-tanaman. Ada pula tanah yang tandus, hanya menyimpan air saja, lalu Allah memberikan manfaat air itu kepada manusia. Maka ada yang meminumnya dan mempergunakannya untuk mengairi kebun-kebun tanamannya dan ladang-ladangnya. Ada pula sebagian tanah yang keras, tidak dapat menyimpan dan menyerap air, sehingga tidak menumbuhkan tanaman apa-apa. Itulah perumpamaan orang yang memahami agama Allah dan Allah memberikan manfaat kepadanya dalam ajaran agama yang Allah mengutusku untuk menyampaikannya kepada manusia, sehingga ia mengetahui dan mengajarkannya (kepada orang lain), dan perumpamaan orang yang sama sekali tidak memperhatikan dan tidak menerima petunjuk Allah yang mengutusku untuk menyampaikannya. (Riwayat al-Bukhari dan Muslim)\n\nDiriwayatkan pula oleh Imam Ahmad dari Abu Hurairah: \n\nPerumpamaanku denganmu seperti orang menyalakan api, ketika api menerangi tempat sekelilingnya, mulailah kupu-kupu dan serangga yang mendatangi berjatuhan ke dalam api, dan orang itu menghalangi, namun dikalahkan oleh serangga-serangga lalu masuklah serangga-serangga itu ke dalam api. Itulah perumpamaanku denganmu. Aku menghalangimu dari api, jauhilah api itu, namun kamu mengalahkanku dan menerobos masuk ke dalamnya. (Riwayat Ahmad, al-Bukhari, dan Muslim dari Abu Hurairah)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1725,
                    "inSurah": 18
                },
                "meta": {
                    "juz": 13,
                    "page": 251,
                    "manzil": 3,
                    "ruku": 206,
                    "hizbQuarter": 100,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لِلَّذِينَ اسْتَجَابُوا لِرَبِّهِمُ الْحُسْنَىٰ ۚ وَالَّذِينَ لَمْ يَسْتَجِيبُوا لَهُ لَوْ أَنَّ لَهُم مَّا فِي الْأَرْضِ جَمِيعًا وَمِثْلَهُ مَعَهُ لَافْتَدَوْا بِهِ ۚ أُولَٰئِكَ لَهُمْ سُوءُ الْحِسَابِ وَمَأْوَاهُمْ جَهَنَّمُ ۖ وَبِئْسَ الْمِهَادُ",
                    "transliteration": {
                        "en": "Lillazeenas tajaaboo lirabbihimul husnaa; wallazeena lam yastajeeboo lahoo law anna lahum maa fil ardi jamee'anw wa mislahoo ma'ahoo laftadaw bih; ulaaa'ika lahum sooo'ul hisaab; wa maawaahum Jahannamu wa bi'sal mihaad"
                    }
                },
                "translation": {
                    "en": "For those who have responded to their Lord is the best [reward], but those who did not respond to Him - if they had all that is in the earth entirely and the like of it with it, they would [attempt to] ransom themselves thereby. Those will have the worst account, and their refuge is Hell, and wretched is the resting place.",
                    "id": "Bagi orang-orang yang memenuhi seruan Tuhan, mereka (disediakan) balasan yang baik. Dan orang-orang yang tidak memenuhi seruan-Nya, sekiranya mereka memiliki semua yang ada di bumi dan (ditambah) sebanyak itu lagi, niscaya mereka akan menebus dirinya dengan itu. Orang-orang itu mendapat hisab (perhitungan) yang buruk dan tempat kediaman mereka Jahanam, dan itulah seburuk-buruk tempat kediaman."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1725",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1725.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1725.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah menyebut perumpamaan-perumpaan itu agar menjadi pelajaran bagi orang-orang yang mau berpikir. Melalui berpikir dan merenung, manusia akan menemukan kebenaran. Bagi orang-orang yang mau berpikir jernih dan memenuhi seruan Tuhan, maka bagi mereka disediakan balasan yang terbaik. Dan orang-orang yang tidak memenuhi seruan-Nya dan enggan menerima kebenaran dari Allah maka mereka akan menemui kesulitan dan kesengsaraan. Oleh sebab itu, sekiranya mereka memiliki semua yang ada di bumi dan ditambah pula kekayaan sebanyak itu lagi, niscaya mereka akan menebus dirinya dengan kekayaan itu. Orang-orang itu jauh dari rahmat Allah dan akan mendapat hisab yang buruk di hari Kiamat sebagai akibat dari keburukan yang mereka lakukan. Dan tempat kediaman mereka adalah neraka Jahanam, dan itulah seburuk-buruk tempat kediaman.",
                        "long": "Bagi orang-orang yang taat kepada Allah dan rasul-Nya, mengikuti semua perintah-Nya, dan membenarkan apa yang diturunkan oleh Allah kepada rasul-Nya, disediakan pembalasan yang baik, yang bersih dari segala penderitaan dan kesusahan dan kekal selama-lamanya. Sesuai dengan firman Allah:\n\nBagi orang-orang yang berbuat baik, ada pahala yang terbaik (surga) dan tambahannya (kenikmatan melihat Allah). (Yunus/10: 26)\n\nDan firman-Nya:\n\nAdapun orang yang beriman dan mengerjakan kebajikan, maka dia mendapat (pahala) yang terbaik sebagai balasan, dan akan kami sampaikan kepadanya perintah kami yang mudah-mudah. (al-Kahf/18: 88)\n\nBagi mereka yang tidak memenuhi seruan Allah, tidak menaati-Nya, tidak mengikuti perintah-Nya dan tidak mencegah diri dari larangan-Nya, ada bermacam-macam perlakuan dan azab, di antaranya:\n\n1.Ketika menghadapi azab yang sangat pedih, niscaya mereka melepaskan seluruh kekayaan itu untuk menebus dirinya dari azab Allah. Sebab yang paling dicintai oleh setiap orang adalah dirinya sendiri. Apabila dirinya terancam bahaya, maka seluruh kekayaannya akan dijadikan sandera atau tebusan, demi untuk keselamatan dirinya.\n\n2.Mereka akan diperiksa secara rinci dan diteliti semua amal perbuatannya sampai sekecil-kecilnya. Tersebut dalam sebuah hadis: Barang siapa yang dihisab secara rinci pasti kena azab.\n\n3.Tempat kediaman mereka ialah Jahanam, dan itulah seburuk-buruknya tempat kediaman dan tempat kembali."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1726,
                    "inSurah": 19
                },
                "meta": {
                    "juz": 13,
                    "page": 252,
                    "manzil": 3,
                    "ruku": 207,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ أَفَمَن يَعْلَمُ أَنَّمَا أُنزِلَ إِلَيْكَ مِن رَّبِّكَ الْحَقُّ كَمَنْ هُوَ أَعْمَىٰ ۚ إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ",
                    "transliteration": {
                        "en": "Afamai ya'lamu annamaaa unzila ilaika mir Rabbikal haqqu kaman huwa a'maa; innamaa yatazakkaru ulul albaab"
                    }
                },
                "translation": {
                    "en": "Then is he who knows that what has been revealed to you from your Lord is the truth like one who is blind? They will only be reminded who are people of understanding -",
                    "id": "Maka apakah orang yang mengetahui bahwa apa yang diturunkan Tuhan kepadamu adalah kebenaran, sama dengan orang yang buta? Hanya orang berakal saja yang dapat mengambil pelajaran,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1726",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1726.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1726.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Usai menjelaskan balasan bagi manusia yang memenuhi dan yang abai atas seruan-seruan-Nya, Allah lalu membandingkan antara orang yang mengetahui kebenaran dengan yang tidak. Bila dibandingkan, maka apakah orang yang mengetahui bahwa apa (Al-Qur'an) yang diturunkan Tuhan kepadamu itu adalah kebenaran, lalu dia beriman kepadanya, sama dengan orang yang buta mata hatinya dan enggan beriman kepadanya? Tentu tidak sama. Hanya orang berakal saja-yang biasa Al-Qur'an sebut dengan Ulul Albab-yang dapat memahami perbandingan tersebut dan mengambil pelajaran darinya.",
                        "long": "Pada ayat ini, Allah swt menjelaskan bahwa tidak sama orang yang mengetahui bahwa apa yang diturunkan kepada Muhammad adalah sesuatu yang nyata benarnya dan datang dari Allah dibandingkan dengan orang buta yang tidak memahami dan mempercayainya. Firman Allah:\n\nDan telah sempurna firman Tuhanmu (Al-Quran) dengan benar dan adil. (al-Anam/6: 115)\n\nMenurut Ibnu Abbas, ayat ini turun berkaitan dengan dua orang, yang seorang mukmin dan yang lainnya kafir, yaitu Hamzah dan Abu Jahal. Apakah (Hamzah) yang percaya dan mengetahui bahwa apa yang diturunkan kepada Nabi Muhammad saw itu benar, tanpa keraguan lagi, sama dengan (Abu Jahal) yang buta hatinya, dan sama sekali tidak mendapat petunjuk kepada kebaikan? Tentu tidak sama. Hanya orang-orang yang sehat pikirannya saja yang dapat menyadari hal seperti ini, dan yang dapat mengambil manfaat dari perumpamaan-perumpamaan yang dikemukakan Allah swt dalam kitab suci-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1727,
                    "inSurah": 20
                },
                "meta": {
                    "juz": 13,
                    "page": 252,
                    "manzil": 3,
                    "ruku": 207,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "الَّذِينَ يُوفُونَ بِعَهْدِ اللَّهِ وَلَا يَنقُضُونَ الْمِيثَاقَ",
                    "transliteration": {
                        "en": "Allazeena yoofoona bi'ahdil laahi wa laa yanqu doonal meesaaq"
                    }
                },
                "translation": {
                    "en": "Those who fulfill the covenant of Allah and do not break the contract,",
                    "id": "(yaitu) orang yang memenuhi janji Allah dan tidak melanggar perjanjian,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1727",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1727.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1727.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ulul Albab yaitu orang yang senantiasa memenuhi janji dengan sesama manusia yang dikukuhkan dengan nama Allah dan tidak melanggar perjanjian tersebut,",
                        "long": "Allah swt menyifati ulul albab dari kalangan orang-orang yang beriman, yaitu orang-orang yang meyakini bahwa yang diturunkan kepada Nabi Muhammad adalah suatu kebenaran yang berlaku, sebagai berikut:\n\na. Sifat pertama: bahwa orang-orang tersebut senantiasa memenuhi janji Allah, dan tidak mau mengingkari perjanjian itu. Yang dimaksud dengan \"janji Allah\" di sini ialah janji-janji yang telah mereka ikrarkan atas diri mereka, baik mengenai hubungan mereka dengan Allah, maupun hubungan mereka dengan orang lain. Fitrah mereka yang suci, dan hati mereka yang murni mengakui adanya perjanjian itu dan wahyu Allah pun mengharuskan adanya perjanjian tersebut.\n\nMereka tidak mau mengingkari atau pun memungkiri perjanjian yang telah mereka kukuhkan, karena mereka sangat menjauhi sifat-sifat kemunafikan. \n\nBetapa pentingnya sifat memenuhi janji ini, oleh Qatadah telah disebutkan bahwa dalam Al-Quran, Allah swt telah menyebutnya sebanyak lebih dua puluh kali.\n\nb.Sifat kedua: mereka memelihara semua perintah Allah dan tidak melanggarnya, baik hak-hak Allah maupun hak-hak hamba-Nya, termasuk memelihara silaturrahim.\n\nHubungan antara sesama manusia ialah menjalin hubungan tolong-menolong, menjalin cinta dan kasih-sayang, sebagaimana disebutkan dalam hadis:\n\nDari Abi Hurairah r.a. bahwasanya ia berkata, \"Aku mendengar Rasulullah saw bersabda, \"Barang siapa senang dilapangkan rezekinya dan selalu disebut-sebut kebaikannya, maka hendaklah pelihara hubungan silaturrahim.\" (Riwayat al-Bukhari dan Muslim).\n\nDan hadis Nabi saw:\n\nDari Ibnu Abbas ia berkata, \"Bersabda Rasulullah saw, \"Sesungguh-nya kebajikan dan menghubungkan silaturrahim itu, kedua-duanya benar-benar meringankan hisab yang buruk di hari kiamat.\" Kemudian Rasulullah saw membaca ayat ini.\" (Riwayat al-Khatib dan Ibnu Asakir)\n\nc. Sifat ketiga: mereka benar-benar takut kepada Allah swt. Sifat takut kepada Allah adalah perasaan takut yang dilandasi dengan rasa hormat yang mendorong orang untuk taat kepada-Nya. Sifat ini dimiliki oleh para ulama, dan ciri dari orang-orang \"muqarrabin\". Dalam hubungan ini Allah swt telah berfirman:\n\nDi antara hamba-hamba Allah yang takut kepada-Nya, hanyalah para ulama. (Fathir/35: 28)\n\nd. Sifat keempat: mereka senantiasa takut kepada hisab yang sifatnya merugikan mereka pada hari kiamat, yaitu hasil yang buruk dari amalan mereka di hari kiamat, karena banyaknya kejahatan yang dilakukannya selagi hidup di dunia ini. Oleh sebab itu, mereka senantiasa mawas diri, sebelum dihisab amalannya di akhirat kelak. Mereka selalu membandingkan antara amal-amal mereka yang baik dengan yang buruk, selalu berusaha agar amal yang baik lebih banyak dari perbuatan yang buruk, agar neraca kebajikan mereka di akhirat kelak lebih berat daripada neraca keburukan. Dalam hal ini, Allah telah berfirman:\n\nMaka adapun orang yang berat timbangan (kebaikan)-nya, maka dia berada dalam kehidupan yang memuaskan (senang). Dan adapun orang yang ringan timbangan (kebaikan)-nya maka tempat kembalinya adalah neraka Hawiyah. (al-Qariah/101: 6 - 9)\n\ne.Sifat kelima: mereka senantiasa sabar dalam menghadapi segala cobaan dan rintangan, demi mengharapkan rida Allah. Sabar dalam hal ini berarti menahan diri terhadap segala hal yang tidak disenanginya, baik dengan cara melakukan ketaatan dan menunaikan segala kewajiban yang telah ditetapkan agama maupun dengan jalan menjauhi hal-hal yang dilarang agama. Bisa juga berarti bersikap rela menerima segala ketentuan Allah yang telah berlaku berupa musibah dan lain sebagainya.\n\nKesabaran yang diminta dari setiap orang yang berakal dan beriman ialah kesabaran yang dilakukan semata-mata karena mengharapkan keridaan Allah dan ganjaran-Nya, bukan kesabaran yang dibuat-buat karena ingin dipuji dan disebut-sebut. Itulah kesabaran yang sejati, yang menjadi sifat bagi orang-orang yang berakal dan beriman.\n\nf. Sifat keenam: mereka senantiasa mendirikan salat. Arti \"mendirikan salat\" ialah menunaikan dengan cara yang sebaik-baiknya, dengan menyempurnakan rukun dan syaratnya, disertai rasa khusyuk dan tawaduk menghadapkan wajah dan hati kepada Allah semata, tidak dibarengi dengan ria, serta memelihara waktu yang telah ditetapkan untuknya. Hal ini hanya dapat dilakukan bila pada saat-saat melakukan salat, kita merasa sedang berdiri sendiri di hadapan Allah swt, Pencipta dan Penguasa semesta alam. Dengan demikian, maka tak ada sesuatu pun yang dipikirkan pada saat itu, kecuali semata-mata bermunajah kepada Allah.\n\ng. Sifat ketujuh: mereka senantiasa menginfakkan sebagian dari rezeki yang telah dilimpahkan Allah kepada mereka, baik secara tersembunyi maupun terang-terangan, baik infak wajib seperti terhadap istri, anak, dan karib kerabat maupun infak sunah seperti terhadap fakir miskin. Kenyataan dapat memberikan pengertian kepada kita tentang rahasia yang tersimpan di dalamnya. Al-Quran berulang kali menganjurkan kepada orang-orang mukmin untuk menginfakkan sebagian dari rezeki yang telah diperolehnya kepada yang memerlukan pertolongan, dan untuk menyokong kepentingan umum. Jika mereka mau melakukannya, niscaya kemiskinan dan kemelaratan dapat dilenyapkan dari kehidupan masyarakat.\n\nh. Sifat kedelapan: mereka senantiasa menolak kejahatan dengan kebajikan, karena kebajikan itu dapat menolak kejahatan. Kenyataan menunjukkan bahwa apabila seseorang dapat bergaul dengan orang lain dengan akrab dan kasih sayang serta menolong orang-orang yang memerlukan pertolongan, ia tidak akan dimusuhi atau dibenci oleh masyarakatnya. Apabila ia mendapat musibah, maka orang yang pernah mendapat pertolongannya akan segera pula mengulurkan pertolongan kepadanya. Sebaliknya orang yang suka menyakiti orang lain, atau enggan memberikan bantuan dan pertolongan adalah orang yang egois dan tidak menggunakan akalnya. Sikap dan perbuatannya itu hanyalah mempersempit ruang lingkup kehidupannya sendiri, serta menimbulkan kebencian dan kedengkian orang lain terhadap dirinya.\n\nBerbuat kebaikan untuk menghindari kejahatan, atau sedapat mungkin membalas perbuatan jahat orang lain dengan berbuat kebajikan atau dengan diam adalah tanda orang yang mau menggunakan akalnya dan bijaksana. Firman Allah:\n\n\"... dan apabila orang-orang bodoh menyapa mereka (dengan kata-kata yang menghina), mereka mengucapkan, \"salam.\" (al-Furqan/25: 63)\n\nDari sini dapat dipahami, betapa tingginya nilai ajaran agama Islam dalam membina hubungan baik antara sesama manusia guna menciptakan kerukunan dan kesejahteraan masyarakat.\n\nPada akhir ayat ini, Allah swt menegaskan bahwa orang-orang yang memiliki sifat-sifat tersebut pasti akan memperoleh tempat kediaman terakhir yang baik, yaitu surga Jannatun Naim di akhirat kelak di samping kebahagiaan, ketenangan, dan kesejahteraan di dunia ini."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1728,
                    "inSurah": 21
                },
                "meta": {
                    "juz": 13,
                    "page": 252,
                    "manzil": 3,
                    "ruku": 207,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِينَ يَصِلُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوءَ الْحِسَابِ",
                    "transliteration": {
                        "en": "Wallazeena yasiloona maaa amaral laahu bihee an yoosala wa yakhshawna Rabbahum wa yakhaafoona sooo'al hisaab"
                    }
                },
                "translation": {
                    "en": "And those who join that which Allah has ordered to be joined and fear their Lord and are afraid of the evil of [their] account,",
                    "id": "dan orang-orang yang menghubungkan apa yang diperintahkan Allah agar dihubungkan, dan mereka takut kepada Tuhannya dan takut kepada hisab yang buruk."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1728",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1728.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1728.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "dan orang-orang yang senantiasa menghubungkan apa yang diperintahkan oleh Allah agar dihubungkan, seperti kekerabatan, dan mereka takut kepada Tuhannya dengan menaati segala perintah-Nya dan menjauhi larangan-Nya, dan takut kepada hisab yang buruk dan berat pada hari Kemudian,",
                        "long": "Allah swt menyifati ulul albab dari kalangan orang-orang yang beriman, yaitu orang-orang yang meyakini bahwa yang diturunkan kepada Nabi Muhammad adalah suatu kebenaran yang berlaku, sebagai berikut:\n\na. Sifat pertama: bahwa orang-orang tersebut senantiasa memenuhi janji Allah, dan tidak mau mengingkari perjanjian itu. Yang dimaksud dengan \"janji Allah\" di sini ialah janji-janji yang telah mereka ikrarkan atas diri mereka, baik mengenai hubungan mereka dengan Allah, maupun hubungan mereka dengan orang lain. Fitrah mereka yang suci, dan hati mereka yang murni mengakui adanya perjanjian itu dan wahyu Allah pun mengharuskan adanya perjanjian tersebut.\n\nMereka tidak mau mengingkari atau pun memungkiri perjanjian yang telah mereka kukuhkan, karena mereka sangat menjauhi sifat-sifat kemunafikan. \n\nBetapa pentingnya sifat memenuhi janji ini, oleh Qatadah telah disebutkan bahwa dalam Al-Quran, Allah swt telah menyebutnya sebanyak lebih dua puluh kali.\n\nb.Sifat kedua: mereka memelihara semua perintah Allah dan tidak melanggarnya, baik hak-hak Allah maupun hak-hak hamba-Nya, termasuk memelihara silaturrahim.\n\nHubungan antara sesama manusia ialah menjalin hubungan tolong-menolong, menjalin cinta dan kasih-sayang, sebagaimana disebutkan dalam hadis:\n\nDari Abi Hurairah r.a. bahwasanya ia berkata, \"Aku mendengar Rasulullah saw bersabda, \"Barang siapa senang dilapangkan rezekinya dan selalu disebut-sebut kebaikannya, maka hendaklah pelihara hubungan silaturrahim.\" (Riwayat al-Bukhari dan Muslim).\n\nDan hadis Nabi saw:\n\nDari Ibnu Abbas ia berkata, \"Bersabda Rasulullah saw, \"Sesungguh-nya kebajikan dan menghubungkan silaturrahim itu, kedua-duanya benar-benar meringankan hisab yang buruk di hari kiamat.\" Kemudian Rasulullah saw membaca ayat ini.\" (Riwayat al-Khatib dan Ibnu Asakir)\n\nc. Sifat ketiga: mereka benar-benar takut kepada Allah swt. Sifat takut kepada Allah adalah perasaan takut yang dilandasi dengan rasa hormat yang mendorong orang untuk taat kepada-Nya. Sifat ini dimiliki oleh para ulama, dan ciri dari orang-orang \"muqarrabin\". Dalam hubungan ini Allah swt telah berfirman:\n\nDi antara hamba-hamba Allah yang takut kepada-Nya, hanyalah para ulama. (Fathir/35: 28)\n\nd. Sifat keempat: mereka senantiasa takut kepada hisab yang sifatnya merugikan mereka pada hari kiamat, yaitu hasil yang buruk dari amalan mereka di hari kiamat, karena banyaknya kejahatan yang dilakukannya selagi hidup di dunia ini. Oleh sebab itu, mereka senantiasa mawas diri, sebelum dihisab amalannya di akhirat kelak. Mereka selalu membandingkan antara amal-amal mereka yang baik dengan yang buruk, selalu berusaha agar amal yang baik lebih banyak dari perbuatan yang buruk, agar neraca kebajikan mereka di akhirat kelak lebih berat daripada neraca keburukan. Dalam hal ini, Allah telah berfirman:\n\nMaka adapun orang yang berat timbangan (kebaikan)-nya, maka dia berada dalam kehidupan yang memuaskan (senang). Dan adapun orang yang ringan timbangan (kebaikan)-nya maka tempat kembalinya adalah neraka Hawiyah. (al-Qariah/101: 6 - 9)\n\ne.Sifat kelima: mereka senantiasa sabar dalam menghadapi segala cobaan dan rintangan, demi mengharapkan rida Allah. Sabar dalam hal ini berarti menahan diri terhadap segala hal yang tidak disenanginya, baik dengan cara melakukan ketaatan dan menunaikan segala kewajiban yang telah ditetapkan agama maupun dengan jalan menjauhi hal-hal yang dilarang agama. Bisa juga berarti bersikap rela menerima segala ketentuan Allah yang telah berlaku berupa musibah dan lain sebagainya.\n\nKesabaran yang diminta dari setiap orang yang berakal dan beriman ialah kesabaran yang dilakukan semata-mata karena mengharapkan keridaan Allah dan ganjaran-Nya, bukan kesabaran yang dibuat-buat karena ingin dipuji dan disebut-sebut. Itulah kesabaran yang sejati, yang menjadi sifat bagi orang-orang yang berakal dan beriman.\n\nf. Sifat keenam: mereka senantiasa mendirikan salat. Arti \"mendirikan salat\" ialah menunaikan dengan cara yang sebaik-baiknya, dengan menyempurnakan rukun dan syaratnya, disertai rasa khusyuk dan tawaduk menghadapkan wajah dan hati kepada Allah semata, tidak dibarengi dengan ria, serta memelihara waktu yang telah ditetapkan untuknya. Hal ini hanya dapat dilakukan bila pada saat-saat melakukan salat, kita merasa sedang berdiri sendiri di hadapan Allah swt, Pencipta dan Penguasa semesta alam. Dengan demikian, maka tak ada sesuatu pun yang dipikirkan pada saat itu, kecuali semata-mata bermunajah kepada Allah.\n\ng. Sifat ketujuh: mereka senantiasa menginfakkan sebagian dari rezeki yang telah dilimpahkan Allah kepada mereka, baik secara tersembunyi maupun terang-terangan, baik infak wajib seperti terhadap istri, anak, dan karib kerabat maupun infak sunah seperti terhadap fakir miskin. Kenyataan dapat memberikan pengertian kepada kita tentang rahasia yang tersimpan di dalamnya. Al-Quran berulang kali menganjurkan kepada orang-orang mukmin untuk menginfakkan sebagian dari rezeki yang telah diperolehnya kepada yang memerlukan pertolongan, dan untuk menyokong kepentingan umum. Jika mereka mau melakukannya, niscaya kemiskinan dan kemelaratan dapat dilenyapkan dari kehidupan masyarakat.\n\nh. Sifat kedelapan: mereka senantiasa menolak kejahatan dengan kebajikan, karena kebajikan itu dapat menolak kejahatan. Kenyataan menunjukkan bahwa apabila seseorang dapat bergaul dengan orang lain dengan akrab dan kasih sayang serta menolong orang-orang yang memerlukan pertolongan, ia tidak akan dimusuhi atau dibenci oleh masyarakatnya. Apabila ia mendapat musibah, maka orang yang pernah mendapat pertolongannya akan segera pula mengulurkan pertolongan kepadanya. Sebaliknya orang yang suka menyakiti orang lain, atau enggan memberikan bantuan dan pertolongan adalah orang yang egois dan tidak menggunakan akalnya. Sikap dan perbuatannya itu hanyalah mempersempit ruang lingkup kehidupannya sendiri, serta menimbulkan kebencian dan kedengkian orang lain terhadap dirinya.\n\nBerbuat kebaikan untuk menghindari kejahatan, atau sedapat mungkin membalas perbuatan jahat orang lain dengan berbuat kebajikan atau dengan diam adalah tanda orang yang mau menggunakan akalnya dan bijaksana. Firman Allah:\n\n\"... dan apabila orang-orang bodoh menyapa mereka (dengan kata-kata yang menghina), mereka mengucapkan, \"salam.\" (al-Furqan/25: 63)\n\nDari sini dapat dipahami, betapa tingginya nilai ajaran agama Islam dalam membina hubungan baik antara sesama manusia guna menciptakan kerukunan dan kesejahteraan masyarakat.\n\nPada akhir ayat ini, Allah swt menegaskan bahwa orang-orang yang memiliki sifat-sifat tersebut pasti akan memperoleh tempat kediaman terakhir yang baik, yaitu surga Jannatun Naim di akhirat kelak di samping kebahagiaan, ketenangan, dan kesejahteraan di dunia ini."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1729,
                    "inSurah": 22
                },
                "meta": {
                    "juz": 13,
                    "page": 252,
                    "manzil": 3,
                    "ruku": 207,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِينَ صَبَرُوا ابْتِغَاءَ وَجْهِ رَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَنفَقُوا مِمَّا رَزَقْنَاهُمْ سِرًّا وَعَلَانِيَةً وَيَدْرَءُونَ بِالْحَسَنَةِ السَّيِّئَةَ أُولَٰئِكَ لَهُمْ عُقْبَى الدَّارِ",
                    "transliteration": {
                        "en": "Wallazeena sabarub tighaaa'a Wajhi Rabbihim wa aqaamus Salaata wa anfaqoo mimmaa razaqnaahum sirranw wa 'alaaniyatanw wa yadra'oona bilhasanatis saiyi'ata ulaaa'ika lahum 'uqbad daar"
                    }
                },
                "translation": {
                    "en": "And those who are patient, seeking the countenance of their Lord, and establish prayer and spend from what We have provided for them secretly and publicly and prevent evil with good - those will have the good consequence of [this] home -",
                    "id": "Dan orang yang sabar karena mengharap keridaan Tuhannya, melaksanakan salat, dan menginfakkan sebagian rezeki yang Kami berikan kepada mereka, secara sembunyi atau terang-terangan serta menolak kejahatan dengan kebaikan; orang itulah yang men-dapat tempat kesudahan (yang baik),"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1729",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1729.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1729.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "dan orang yang sabar dalam melaksanakan perintah dan menjauhi larangan-Nya karena mengharap keridaan Tuhannya, melaksanakan salat dengan konsisten, menginfakkan seacara wajib atau sunah sebagian rezeki yang Kami berikan kepada mereka, baik secara sembunyi atau terang-terangan, serta menolak kejahatan secara sungguh-sungguh tetapi penuh hikmah dengan cara membalas kejahatan dengan kebaikan; orang yang dalam diri mereka terdapat pada sifat-sifat itulah orang yang mendapat tempat kesudahan yang baik di akhirat.",
                        "long": "Allah swt menyifati ulul albab dari kalangan orang-orang yang beriman, yaitu orang-orang yang meyakini bahwa yang diturunkan kepada Nabi Muhammad adalah suatu kebenaran yang berlaku, sebagai berikut:\n\na. Sifat pertama: bahwa orang-orang tersebut senantiasa memenuhi janji Allah, dan tidak mau mengingkari perjanjian itu. Yang dimaksud dengan \"janji Allah\" di sini ialah janji-janji yang telah mereka ikrarkan atas diri mereka, baik mengenai hubungan mereka dengan Allah, maupun hubungan mereka dengan orang lain. Fitrah mereka yang suci, dan hati mereka yang murni mengakui adanya perjanjian itu dan wahyu Allah pun mengharuskan adanya perjanjian tersebut.\n\nMereka tidak mau mengingkari atau pun memungkiri perjanjian yang telah mereka kukuhkan, karena mereka sangat menjauhi sifat-sifat kemunafikan. \n\nBetapa pentingnya sifat memenuhi janji ini, oleh Qatadah telah disebutkan bahwa dalam Al-Quran, Allah swt telah menyebutnya sebanyak lebih dua puluh kali.\n\nb.Sifat kedua: mereka memelihara semua perintah Allah dan tidak melanggarnya, baik hak-hak Allah maupun hak-hak hamba-Nya, termasuk memelihara silaturrahim.\n\nHubungan antara sesama manusia ialah menjalin hubungan tolong-menolong, menjalin cinta dan kasih-sayang, sebagaimana disebutkan dalam hadis:\n\nDari Abi Hurairah r.a. bahwasanya ia berkata, \"Aku mendengar Rasulullah saw bersabda, \"Barang siapa senang dilapangkan rezekinya dan selalu disebut-sebut kebaikannya, maka hendaklah pelihara hubungan silaturrahim.\" (Riwayat al-Bukhari dan Muslim).\n\nDan hadis Nabi saw:\n\nDari Ibnu Abbas ia berkata, \"Bersabda Rasulullah saw, \"Sesungguh-nya kebajikan dan menghubungkan silaturrahim itu, kedua-duanya benar-benar meringankan hisab yang buruk di hari kiamat.\" Kemudian Rasulullah saw membaca ayat ini.\" (Riwayat al-Khatib dan Ibnu Asakir)\n\nc. Sifat ketiga: mereka benar-benar takut kepada Allah swt. Sifat takut kepada Allah adalah perasaan takut yang dilandasi dengan rasa hormat yang mendorong orang untuk taat kepada-Nya. Sifat ini dimiliki oleh para ulama, dan ciri dari orang-orang \"muqarrabin\". Dalam hubungan ini Allah swt telah berfirman:\n\nDi antara hamba-hamba Allah yang takut kepada-Nya, hanyalah para ulama. (Fathir/35: 28)\n\nd. Sifat keempat: mereka senantiasa takut kepada hisab yang sifatnya merugikan mereka pada hari kiamat, yaitu hasil yang buruk dari amalan mereka di hari kiamat, karena banyaknya kejahatan yang dilakukannya selagi hidup di dunia ini. Oleh sebab itu, mereka senantiasa mawas diri, sebelum dihisab amalannya di akhirat kelak. Mereka selalu membandingkan antara amal-amal mereka yang baik dengan yang buruk, selalu berusaha agar amal yang baik lebih banyak dari perbuatan yang buruk, agar neraca kebajikan mereka di akhirat kelak lebih berat daripada neraca keburukan. Dalam hal ini, Allah telah berfirman:\n\nMaka adapun orang yang berat timbangan (kebaikan)-nya, maka dia berada dalam kehidupan yang memuaskan (senang). Dan adapun orang yang ringan timbangan (kebaikan)-nya maka tempat kembalinya adalah neraka Hawiyah. (al-Qariah/101: 6 - 9)\n\ne.Sifat kelima: mereka senantiasa sabar dalam menghadapi segala cobaan dan rintangan, demi mengharapkan rida Allah. Sabar dalam hal ini berarti menahan diri terhadap segala hal yang tidak disenanginya, baik dengan cara melakukan ketaatan dan menunaikan segala kewajiban yang telah ditetapkan agama maupun dengan jalan menjauhi hal-hal yang dilarang agama. Bisa juga berarti bersikap rela menerima segala ketentuan Allah yang telah berlaku berupa musibah dan lain sebagainya.\n\nKesabaran yang diminta dari setiap orang yang berakal dan beriman ialah kesabaran yang dilakukan semata-mata karena mengharapkan keridaan Allah dan ganjaran-Nya, bukan kesabaran yang dibuat-buat karena ingin dipuji dan disebut-sebut. Itulah kesabaran yang sejati, yang menjadi sifat bagi orang-orang yang berakal dan beriman.\n\nf. Sifat keenam: mereka senantiasa mendirikan salat. Arti \"mendirikan salat\" ialah menunaikan dengan cara yang sebaik-baiknya, dengan menyempurnakan rukun dan syaratnya, disertai rasa khusyuk dan tawaduk menghadapkan wajah dan hati kepada Allah semata, tidak dibarengi dengan ria, serta memelihara waktu yang telah ditetapkan untuknya. Hal ini hanya dapat dilakukan bila pada saat-saat melakukan salat, kita merasa sedang berdiri sendiri di hadapan Allah swt, Pencipta dan Penguasa semesta alam. Dengan demikian, maka tak ada sesuatu pun yang dipikirkan pada saat itu, kecuali semata-mata bermunajah kepada Allah.\n\ng. Sifat ketujuh: mereka senantiasa menginfakkan sebagian dari rezeki yang telah dilimpahkan Allah kepada mereka, baik secara tersembunyi maupun terang-terangan, baik infak wajib seperti terhadap istri, anak, dan karib kerabat maupun infak sunah seperti terhadap fakir miskin. Kenyataan dapat memberikan pengertian kepada kita tentang rahasia yang tersimpan di dalamnya. Al-Quran berulang kali menganjurkan kepada orang-orang mukmin untuk menginfakkan sebagian dari rezeki yang telah diperolehnya kepada yang memerlukan pertolongan, dan untuk menyokong kepentingan umum. Jika mereka mau melakukannya, niscaya kemiskinan dan kemelaratan dapat dilenyapkan dari kehidupan masyarakat.\n\nh. Sifat kedelapan: mereka senantiasa menolak kejahatan dengan kebajikan, karena kebajikan itu dapat menolak kejahatan. Kenyataan menunjukkan bahwa apabila seseorang dapat bergaul dengan orang lain dengan akrab dan kasih sayang serta menolong orang-orang yang memerlukan pertolongan, ia tidak akan dimusuhi atau dibenci oleh masyarakatnya. Apabila ia mendapat musibah, maka orang yang pernah mendapat pertolongannya akan segera pula mengulurkan pertolongan kepadanya. Sebaliknya orang yang suka menyakiti orang lain, atau enggan memberikan bantuan dan pertolongan adalah orang yang egois dan tidak menggunakan akalnya. Sikap dan perbuatannya itu hanyalah mempersempit ruang lingkup kehidupannya sendiri, serta menimbulkan kebencian dan kedengkian orang lain terhadap dirinya.\n\nBerbuat kebaikan untuk menghindari kejahatan, atau sedapat mungkin membalas perbuatan jahat orang lain dengan berbuat kebajikan atau dengan diam adalah tanda orang yang mau menggunakan akalnya dan bijaksana. Firman Allah:\n\n\"... dan apabila orang-orang bodoh menyapa mereka (dengan kata-kata yang menghina), mereka mengucapkan, \"salam.\" (al-Furqan/25: 63)\n\nDari sini dapat dipahami, betapa tingginya nilai ajaran agama Islam dalam membina hubungan baik antara sesama manusia guna menciptakan kerukunan dan kesejahteraan masyarakat.\n\nPada akhir ayat ini, Allah swt menegaskan bahwa orang-orang yang memiliki sifat-sifat tersebut pasti akan memperoleh tempat kediaman terakhir yang baik, yaitu surga Jannatun Naim di akhirat kelak di samping kebahagiaan, ketenangan, dan kesejahteraan di dunia ini."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1730,
                    "inSurah": 23
                },
                "meta": {
                    "juz": 13,
                    "page": 252,
                    "manzil": 3,
                    "ruku": 207,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "جَنَّاتُ عَدْنٍ يَدْخُلُونَهَا وَمَن صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ ۖ وَالْمَلَائِكَةُ يَدْخُلُونَ عَلَيْهِم مِّن كُلِّ بَابٍ",
                    "transliteration": {
                        "en": "jannaatu 'adiny yadkhu loonahaa wa man salaha min aabaaa'ihim wa man salaha min aabaaa'ihim wa azwaajihim wa zurriyyaatihim walmalaaa'i katu yadkhuloona 'alaihim min kulli baab"
                    }
                },
                "translation": {
                    "en": "Gardens of perpetual residence; they will enter them with whoever were righteous among their fathers, their spouses and their descendants. And the angels will enter upon them from every gate, [saying],",
                    "id": "(yaitu) surga-surga ‘Adn, mereka masuk ke dalamnya bersama dengan orang yang saleh dari nenek moyangnya, pasangan-pasangannya, dan anak cucunya, sedang para malaikat masuk ke tempat-tempat mereka dari semua pintu;"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1730",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1730.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1730.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Tempat kesudahan yang baik itu adalah surga-surga 'Adn; mereka masuk ke dalamnya bersama dengan orang yang saleh yang beriman dan taat kepada Allah dari nenek moyangnya, pasangan-pasangannya, dan anak cucunya. Lebih dari itu, mereka pun mendapat layanan yang sangat membahagiakan, sedang para malaikat masuk ke tempat-tempat mereka dari semua pintu.",
                        "long": "Dalam ayat ini, Allah swt menerangkan bahwa yang akan memperoleh kebahagiaan di dunia dan di akhirat kelak bukan hanya semata-mata yang memiliki sifat tersebut, melainkan juga orang-orang saleh di antara ibu-ibu dan nenek moyang mereka, demikian pula istri dan keturunan mereka yang terdekat. Mereka ini pun akan turut pula merasakan kebahagiaan dan kesejahteraan itu, selama mereka tidak melakukan hal-hal yang menyebabkan mereka kehilangan hak untuk memperoleh rahmat Allah, misalnya karena kekafiran dan kemusyrikan kepada Allah. Ayat ini memberikan isyarat bahwa pada hari tersebut tidak berlaku hubungan kekeluargaan sedikit pun kecuali amal saleh masing-masing. Firman Allah:\n\nApabila sangkakala ditiup, maka tidak ada lagi pertalian keluarga di antara mereka pada hari itu (hari Kiamat), dan tidak (pula) mereka saling bertanya. (al-Muminun/23: 101)\n\nDalam hubungan ini, Rasulullah saw pernah bersabda kepada putrinya Fatimah az-Zahra sebagai berikut:\n\n\"Wahai Fatimah putri Muhammad! Mintalah dari hartaku apa yang kau inginkan karena aku sedikit pun tidak akan dapat menolongmu dari azab Allah.\" (Riwayat at-Tirmidzi dari Abu Hurairah)\n\nDalam Al-Quran, Allah telah menegaskan pula sebagai berikut:\n\n(yaitu) pada hari (ketika) harta dan anak-anak tidak berguna, kecuali orang-orang yang menghadap Allah dengan hati yang bersih. (asy-Syuara/26: 88-89)\n\nOrang-orang yang menggunakan akalnya seperti yang tersebut di atas akan ditempatkan Allah kelak dalam surga-Nya. Mereka di sana duduk berhadap-hadapan di atas balai-balai yang indah disertai orang-orang yang mereka cintai, yaitu nenek moyang, kaum keluarga, dan anak-anak mereka, serta orang-orang yang patut masuk surga dari kalangan orang-orang yang saleh, agar hati mereka menjadi senang dan bahagia.\n\nHal itu merupakan rahmat dan kebaikan Allah swt kepada mereka. Selain itu para malaikat datang kepada mereka dari segala penjuru untuk memberikan ucapan selamat atas keberuntungan yang telah mereka peroleh, yaitu masuk surga. Mereka tinggal dalam rumah yang diliputi kesejahteraan, berdekatan dengan para nabi dan rasul serta orang-orang yang mengakui kebenaran agama Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1731,
                    "inSurah": 24
                },
                "meta": {
                    "juz": 13,
                    "page": 252,
                    "manzil": 3,
                    "ruku": 207,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "سَلَامٌ عَلَيْكُم بِمَا صَبَرْتُمْ ۚ فَنِعْمَ عُقْبَى الدَّارِ",
                    "transliteration": {
                        "en": "Salaamun 'alaikum bimaa sabartum; fani'ma 'uqbad daar"
                    }
                },
                "translation": {
                    "en": "\"Peace be upon you for what you patiently endured. And excellent is the final home.\"",
                    "id": "(sambil mengucapkan), “Selamat sejahtera atasmu karena kesabaranmu.” Maka alangkah nikmatnya tempat kesudahan itu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1731",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1731.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1731.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Para malaikat masuk untuk memberi mereka selamat, \"Selamat sejahtera atasmu. Kamu telah selamat dari segala siksa karena di dunia kamu telah menunjukkan kesabaranmu yang tinggi dalam menaati Allah. Maka alangkah nikmatnya surga tempat kesudahan yang telah Allah sediakan itu.",
                        "long": "Dalam ayat ini, disebutkan bahwa para malaikat mendatangi penghuni surga sambil mengucapkan salam, \"Semoga kamu aman dari segala hal yang tidak diinginkan dan ditakuti, yang telah merusak orang-orang selain kamu. Keberuntungan ini kamu peroleh berkat kesabaran dan penderitaan yang kamu alami selama menjalani kehidupan di dunia.\"\n\nIbnu Jarir ath-thabari dan Ibnu Abi hatim dari Umamah meriwayatkan bahwa Nabi saw semasa hidupnya sering datang ke makam para syuhada pada setiap permulaan tahun. Di sana beliau membaca ayat tersebut. Hal semacam itu dilakukan pula oleh Abu Bakar, Umar, dan Usman r.a."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1732,
                    "inSurah": 25
                },
                "meta": {
                    "juz": 13,
                    "page": 252,
                    "manzil": 3,
                    "ruku": 207,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيُفْسِدُونَ فِي الْأَرْضِ ۙ أُولَٰئِكَ لَهُمُ اللَّعْنَةُ وَلَهُمْ سُوءُ الدَّارِ",
                    "transliteration": {
                        "en": "Wallazeena yanqudoona 'Ahdal laahi mim ba'di meesaaqihee wa yaqta'oona maaa amaral laahu biheee ai yoosala wa yufsidoona fil ardi ulaaa'ika lahumul la'natu wa lahum sooo'ud daar"
                    }
                },
                "translation": {
                    "en": "But those who break the covenant of Allah after contracting it and sever that which Allah has ordered to be joined and spread corruption on earth - for them is the curse, and they will have the worst home.",
                    "id": "Dan orang-orang yang melanggar janji Allah setelah diikrarkannya, dan memutuskan apa yang diperintahkan Allah agar disambungkan dan berbuat kerusakan di bumi; mereka itu memperoleh kutukan dan tempat kediaman yang buruk (Jahanam)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1732",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1732.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1732.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sebagai kebalikan dari mereka yang menerima kebenaran adalah orang-orang yang menolak kebenaran dengan melanggar dan membatalkan janji dengan sesama manusia yang dikukuhkan dengan nama Allah setelah diikrarkannya, dan memutuskan apa yang diperintahkan Allah agar disambungkan, seperti hubungan kekerabatan, dan berbuat kerusakan di bumi dengan bermaksiat; mereka itu memperoleh kutukan sehingga jauh dari rahmat Allah, dan tempat kediaman yang buruk-neraka Jahanam.",
                        "long": "Ada beberapa perjanjian antara Allah dan manusia, di antaranya adalah manusia wajib mengakui kemahaesaan Allah serta kodrat dan iradat-Nya, beriman kepada para nabi-Nya dan wahyu yang diturunkan-Nya, dan sebagainya. Allah swt telah memberikan bukti-bukti dan dalil-dalil yang nyata atas semua itu. Akan tetapi, pada kenyataannya ada di antara manusia yang telah merusak perjanjian tersebut, dalam arti:\n\na. Mereka tidak memperhatikan janji-janji tersebut, sehingga mereka tidak dapat melaksanakan kewajiban yang merupakan akibat yang timbul dari perjanjian itu. Misalnya, bila mereka benar-benar berpegang teguh kepada tauhid, mereka tentunya tidak akan beribadah kepada selain Allah. Allah memberikan bukti-bukti yang nyata tentang kemahaesaan-Nya. Akan tetapi, mereka tidak memperhatikan sehingga mereka tetap menentang landasan tauhid tersebut. Mereka senantiasa menganut kepercayaan syirik, mempercayai dan menyembah selain Allah.\n\nb. Pada mulanya mereka memperhatikan janji-janji yang telah mereka ikrarkan dan dalil-dalil yang telah diberikan. Mereka telah mengakui dan meyakini kebenarannya, tetapi kemudian mereka menyangkal kebenaran itu, dan tidak lagi bersedia mengamalkannya.\n\nOrang yang suka memungkiri dan menyalahi janji yang telah diikrarkan dinamakan \"munafik\". Dalam hubungan ini Rasulullah saw telah bersabda:\n\nAbi Hurairah r.a. meriwayatkan bahwa Nabi saw bersabda, \"Tanda-tanda orang munafik ada tiga macam: apabila ia berkata, ia selalu bohong, apabila ia berjanji selalu ingkar, dan apabila ia dipercayai berkhianat.\" (Riwayat Muslim, at-Tirmidzi dan an-Nasai)\n\nDalam menafsirkan ayat 25 ini, Abu al-Aliyah, seorang mufasir, me-nyebutkan bahwa ada enam macam sifat orang-orang munafik yang mereka tampakkan jika mereka merasa memiliki posisi yang kuat dalam satu masyarakat, yaitu:\n\n1. Apabila berbicara, mereka berbohong.\n\n2. Apabila berjanji, mereka ingkar.\n\n3. Apabila diberi kepercayaan, mereka berkhianat.\n\n4. Suka mengingkari janji Allah yang telah mereka ikrarkan sebelumnya.\n\n5. Suka memutuskan silaturrahim yang diperintahkan Allah untuk di-hubungkan dan dipelihara seperti hubungan dengan para Nabi-Nya yang telah datang membawa kebenaran. Mereka hanya beriman kepada sebagian dari para nabi tersebut, dan kafir terhadap sebagian yang lainnya.\n\nMereka juga memutuskan silaturrahim antara sesama manusia terutama dengan orang-orang mukmin, tetapi mereka tetap menjaga hubungan dan memberikan bantuan kepada orang-orang kafir. Di antara contohnya adalah mereka menghalang-halangi setiap usaha yang menuju kepada pembinaan kehidupan yang harmonis dan penuh kasih sayang. Mereka tidak sudi melihat terwujudnya persatuan dan kesatuan antara orang-orang mukmin, seperti yang dianjurkan Rasulullah:\n\nOrang mukmin terhadap orang mukmin yang lain haruslah seperti suatu bangunan, bagian yang satu menguatkan bagian yang lain. (Riwayat al-Bukhari, Muslim, dan at-Tirmidzi dari Abu Musa al-Asyari)\n\nDan Sabda Rasulullah saw:\n\nOrang-orang mukmin itu adalah seperti satu tubuh, apabila salah satu anggotanya menderita sakit, maka anggota-anggota yang lain pun rela pula menderita karena tidak tidur dan merasa demam karenanya. (Riwayat al-Bukhari dan Muslim dari an-Numan bin Basyir)\n\nOleh sebab itu, umat Islam haruslah hati-hati dalam menjaga kesatuan dan persatuan antara mereka, jangan dimasuki hasutan dan usaha-usaha kaum munafik untuk memecah belah persatuan itu.\n\nc. Mereka suka berbuat kerusakan di bumi, baik berupa kezaliman yang mereka lakukan terhadap diri sendiri maupun kezaliman yang mereka lakukan terhadap hak milik orang lain dengan jalan yang tidak sah, ataupun dengan menimbulkan fitnah dan bencana dalam masyarakat Muslimin, dan mengobarkan permusuhan dan peperangan terhadap mereka.\n\nPada akhir ayat ini, Allah menetapkan hukuman yang layak untuk ditimpakan kepada orang munafik mengingat jahatnya kelakuan dan perbuatan-perbuatan mereka. Hukuman tersebut ialah berupa laknat Allah, yaitu menjauhkan mereka dari rahmat-Nya, sehingga mereka tersingkir dari kebaikan dunia dan akhirat. Mereka akan menemui kesudahan yang sangat buruk, yaitu azab neraka Jahanam, sebagai balasan dari kejahatan dan dosa-dosa yang telah mereka perbuat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1733,
                    "inSurah": 26
                },
                "meta": {
                    "juz": 13,
                    "page": 252,
                    "manzil": 3,
                    "ruku": 207,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "اللَّهُ يَبْسُطُ الرِّزْقَ لِمَن يَشَاءُ وَيَقْدِرُ ۚ وَفَرِحُوا بِالْحَيَاةِ الدُّنْيَا وَمَا الْحَيَاةُ الدُّنْيَا فِي الْآخِرَةِ إِلَّا مَتَاعٌ",
                    "transliteration": {
                        "en": "Allaahu yabsutur rizqa limai yashaaa'u wa yaqdir; wa farihoo bilhayaatid dunyaa wa mal hayaatud dunya fil Aakhirati illaa mataa'"
                    }
                },
                "translation": {
                    "en": "Allah extends provision for whom He wills and restricts [it]. And they rejoice in the worldly life, while the worldly life is not, compared to the Hereafter, except [brief] enjoyment.",
                    "id": "Allah melapangkan rezeki bagi siapa yang Dia kehendaki dan membatasi (bagi siapa yang Dia kehendaki). Mereka bergembira dengan kehidupan dunia, padahal kehidupan dunia hanyalah kesenangan (yang sedikit) dibanding kehidupan akhirat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1733",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1733.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1733.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah yang Maha Pemurah melapangkan rezeki bagi siapa yang Dia kehendaki dan membatasi rezeki siapa yang Dia kehendaki dari hambahamba-Nya. Mereka yang ingkar bergembira ria dengan kebahagian hidup yang mereka peroleh di kehidupan dunia, padahal kehidupan dunia hanyalah kesenangan yang berlangsung begitu singkat dibanding kehidupan akhirat yang kekal dan abadi.",
                        "long": "Allah melapangkan dan memudahkan rezeki bagi sebagian hamba yang dikehendaki-Nya, sehingga mereka memperoleh rezeki yang lebih dari keperluan sehari-hari. Mereka adalah orang-orang yang rajin dan terampil dalam mencari harta, dan melakukan bermacam-macam usaha. Selain itu, mereka hemat dan cermat serta pandai mengelola dan mempergunakan harta bendanya itu.\n\nSebaliknya, Allah juga membatasi rezeki bagi sebagian hamba-Nya, sehingga rezeki yang mereka peroleh tidak lebih dari apa yang diperlukan sehari-hari. Mereka biasanya adalah orang-orang pemalas dan tidak terampil dalam mencari harta, atau tidak pandai mengelola dan mempergunakan harta tersebut.\n\nAllah melapangkan dan menyempitkan rezeki hamba-Nya berdasarkan hikmah serta pengetahuan-Nya tentang masing-masing hamba itu. Kedua hal tersebut tidak ada hubungannya dengan kadar keimanan dan kekafiran hamba-Nya. Oleh karena itu, ada kalanya Allah menganugerahkan rezeki yang banyak kepada hamba-Nya yang kafir. Sebaliknya, kadang-kadang Allah menyempitkan rezeki bagi hamba yang beriman untuk menambah pahala yang kelak akan mereka peroleh di akhirat. Maka kekayaan dan kemiskinan adalah dua hal yang dapat terjadi pada orang-orang beriman maupun yang kafir, yang saleh ataupun yang fasik.\n\nAyat ini selanjutnya menceritakan bahwa kaum musyrik Mekah yang suka memungkiri janji Allah, sangat bergembira dengan banyaknya harta benda yang mereka miliki, dan kehidupan duniawi yang berlimpah-ruah, dan mereka mengira bahwa harta benda tersebut merupakan nikmat dan keberuntungan terbesar.\n\nOleh sebab itu, pada akhir ayat ini Allah menunjukkan kekeliruan mereka, dan menegaskan bahwa kenikmatan hidup duniawi ini hanyalah merupakan kenikmatan yang kecil, pendek waktunya, serta mudah dan cepat hilang, dibandingkan dengan kenikmatan di akhirat yang besar nilainya dan sepanjang masa. Dengan demikian, tidaklah pada tempatnya bila mereka bangga dengan kenikmatan di dunia yang mereka rasakan itu.\n\nDalam hubungan ini, riwayat yang disampaikan oleh Imam at-Tirmidzi dari Ibnu Masud menyebutkan sebagai berikut:\n\nPernah Rasulullah tidur di atas sehelai tikar kemudian beliau bangun dari tidurnya, dan kelihatan bekas tikar itu pada lambungnya, lalu kami berkata, \"Ya Rasulullah seandainya kami ambilkan tempat tidur untukmu?\" Rasulullah bersabda, \"Apalah artinya dunia ini bagiku. Aku hidup di dunia ini hanya laksana seorang pengendara yang berteduh sejenak di bawah pohon, kemudian ia berangkat lagi dan meninggalkan pohon itu.\" (Riwayat at-Tirmidzi dari Ibnu Masud)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1734,
                    "inSurah": 27
                },
                "meta": {
                    "juz": 13,
                    "page": 252,
                    "manzil": 3,
                    "ruku": 208,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَيَقُولُ الَّذِينَ كَفَرُوا لَوْلَا أُنزِلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ ۗ قُلْ إِنَّ اللَّهَ يُضِلُّ مَن يَشَاءُ وَيَهْدِي إِلَيْهِ مَنْ أَنَابَ",
                    "transliteration": {
                        "en": "Wa yaqoolul lazeena kafaroo law laaa unzila 'alaihi Aayatum mir Rabbih; qul innal laaha yudillu mai yashaa'u wa yahdeee ilaihi man anaab"
                    }
                },
                "translation": {
                    "en": "And those who disbelieved say, \"Why has a sign not been sent down to him from his Lord?\" Say, [O Muhammad], \"Indeed, Allah leaves astray whom He wills and guides to Himself whoever turns back [to Him] -",
                    "id": "Dan orang-orang kafir berkata, “Mengapa tidak diturunkan kepadanya (Muhammad) tanda (mukjizat) dari Tuhannya?” Katakanlah (Muhammad), “Sesungguhnya Allah menyesatkan siapa yang Dia kehendaki dan memberi petunjuk orang yang bertobat kepada-Nya,”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1734",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1734.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1734.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Demikianlah Allah menjelaskan balasan bagi orang yang enggan menerima kebenaran dan orang kafir yang hanya mengejar kesenangan duniawi. Dan tidak hanya menolak kebenaran, orang-orang kafir juga berkata dengan nada mengejek, \"Mengapa tidak diturunkan kepadanya (Nabi Muhammad) tanda berupa mukjizat yang dapat dilihat secara kasat mata dari Tuhannya, seperti halnya mukjizat Nabi Musa dan Isa?\" Katakanlah, wahai Nabi Muhammad, \"Sesungguhnya Allah menyesatkan-membiarkan sesat-siapa yang Dia kehendaki karena keingkarannya sendiri, betapapun banyak mukjizat yang dilihatnya, dan Allah memberi petunjuk bagi orang yang bertobat dan kembali kepada-Nya,\"",
                        "long": "Setelah menjelaskan bahwa orang-orang musyrik terpukau oleh fatamorgana kehidupan duniawi dan gembira dengan kenikmatan yang kecil, lalu Allah menyebutkan akibat yang timbul dari sikap dan pandangan mereka yang keliru dengan mengajukan usul kepada Nabi Muhammad, agar kepada beliau diturunkan satu ayat dari Tuhan yang akan membuktikan kenabian dan kerasulannya. Di antara mereka adalah Abu Sufyan bin Harb (sebelum masuk Islam), Abdullah bin Abi Umayyah, dan kawan-kawannya. Mereka pernah mengatakan, \"Mengapa tidak diturunkan kepada Muhammad bukti-bukti sebagaimana yang telah diturunkan kepada para nabi dan rasul terdahulu, seperti jatuhnya langit berkeping-keping kepada mereka, mengubah Bukit shafa menjadi emas, atau menggeser gunung-gunung dari sekitar kota Mekah, sehingga tempat-tempat yang lowong itu dapat dijadikan kebun.\" Ucapan mereka yang lain disebut dalam Al-Quran, antara lain yang terdapat dalam ayat berikut :\n\nCobalah dia datangkan kepada kita suatu mukjizat sebagaimana rasul-rasul yang telah diutus. (al-Anbiya/21: 5)\n\nDengan ucapan-ucapan mereka yang semacam itu, seolah-olah semua tanda dan bukti nyata yang diberikan kepada Nabi Muhammad saw seperti Al-Quran dan lain-lain, bukan bukti nyata kerasulannya yang mampu mendorong mereka untuk taat dan iman kepada Allah, atau sebagai suatu kebenaran yang tak dapat diragukan lagi.\n\nSelanjutnya, Allah memerintahkan kepada Nabi Muhammad saw untuk menjelaskan kepada orang-orang musyrik tersebut bahwa turunnya bukti-bukti tersebut, tidak berperan menjadikan seseorang mendapat petunjuk atau menjadi sesat. Seluruhnya berada dalam kekuasaan Allah semata. Hanya Allah swt yang kuasa menyesatkan orang yang dikehendaki-Nya, dan menuntun orang yang suka bertobat ke jalan yang diridai-Nya.\n\nWalaupun Nabi Muhammad memiliki mukjizat yang membuktikan kerasulannya, namun hal itu tidak akan bermanfaat untuk menjadikan seseorang beriman. Yang harus ditempuh seseorang untuk beriman hanyalah bersikap rendah hati, taat, dan memohon hidayah kepada Allah swt, untuk memperoleh keberuntungan di dunia dan di akhirat, serta terhindar dari tipu daya dan godaan setan.\n\nBagi orang yang beriman, Al-Quran adalah mukjizat yang membuktikan kerasulan Nabi Muhammad saw, sehingga tidak diperlukan bukti-bukti lain. Sebaliknya, orang-orang musyrik tenggelam dalam kesesatan dan keingkaran, sehingga bukti-bukti atau mukjizat apapun yang diperlihatkan oleh Rasulullah tidak akan menjadikan mereka orang-orang yang beriman."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1735,
                    "inSurah": 28
                },
                "meta": {
                    "juz": 13,
                    "page": 252,
                    "manzil": 3,
                    "ruku": 208,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ",
                    "transliteration": {
                        "en": "Allazeena aamanoo wa tatma'innu quloobuhum bizikril laah; alaa bizikril laahi tatma'innul quloob"
                    }
                },
                "translation": {
                    "en": "Those who have believed and whose hearts are assured by the remembrance of Allah. Unquestionably, by the remembrance of Allah hearts are assured.\"",
                    "id": "(yaitu) orang-orang yang beriman dan hati mereka menjadi tenteram dengan mengingat Allah. Ingatlah, hanya dengan mengingat Allah hati menjadi tenteram."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1735",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1735.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1735.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Mereka yang mendapat petunjuk adalah orang-orang yang beriman kepada Allah dan rasul-Nya, dan hati mereka menjadi tenang dan tenteram dengan banyak mengingat Allah. Ingatlah, bahwa hanya dengan banyak mengingat Allah hati menjadi tenteram.",
                        "long": "Dalam ayat ini, Allah menjelaskan orang-orang yang mendapat tuntunan-Nya, yaitu orang-orang beriman dan hatinya menjadi tenteram karena selalu mengingat Allah. Dengan mengingat Allah, hati menjadi tenteram dan jiwa menjadi tenang, tidak merasa gelisah, takut, ataupun khawatir. Mereka melakukan hal-hal yang baik, dan merasa bahagia dengan kebajikan yang dilakukannya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1736,
                    "inSurah": 29
                },
                "meta": {
                    "juz": 13,
                    "page": 253,
                    "manzil": 3,
                    "ruku": 208,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ طُوبَىٰ لَهُمْ وَحُسْنُ مَآبٍ",
                    "transliteration": {
                        "en": "Allazeena aamanoo w a'amilus saalihaati toobaa lahum wa husnu ma aab"
                    }
                },
                "translation": {
                    "en": "Those who have believed and done righteous deeds - a good state is theirs and a good return.",
                    "id": "Orang-orang yang beriman dan mengerjakan kebajikan, mereka mendapat kebahagiaan dan tempat kembali yang baik."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1736",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1736.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1736.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Mereka itulah orang-orang yang beriman kepada Allah dan rasulNya dan mengerjakan kebajikan serta amal saleh. Mereka pasti mendapat kebahagiaan dan tempat kembali yang baik di akhirat kelak, berupa surga dan keridaan Allah.",
                        "long": "Dalam ayat ini dijelaskan bahwa orang yang beriman dan melakukan amal saleh, niscaya akan memperoleh kebahagiaan dan tempat kembali yang baik di sisi Allah pada hari kemudian."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1737,
                    "inSurah": 30
                },
                "meta": {
                    "juz": 13,
                    "page": 253,
                    "manzil": 3,
                    "ruku": 208,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "كَذَٰلِكَ أَرْسَلْنَاكَ فِي أُمَّةٍ قَدْ خَلَتْ مِن قَبْلِهَا أُمَمٌ لِّتَتْلُوَ عَلَيْهِمُ الَّذِي أَوْحَيْنَا إِلَيْكَ وَهُمْ يَكْفُرُونَ بِالرَّحْمَٰنِ ۚ قُلْ هُوَ رَبِّي لَا إِلَٰهَ إِلَّا هُوَ عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ مَتَابِ",
                    "transliteration": {
                        "en": "Kazaalika arsalnaaka feee ummatin qad khalat min qablihaaa umamul litatluwa 'alaihimul lazeee awhainaaa ilaika wa hum yakfuroona bir Rahmaaan; qul Huwa Rabbee laaa ilaaha illaa Huwa Rabbee laaa ilaaha illaa Huwa 'alaihi tawakkaltu wa ilaihi mataab"
                    }
                },
                "translation": {
                    "en": "Thus have We sent you to a community before which [other] communities have passed on so you might recite to them that which We revealed to you, while they disbelieve in the Most Merciful. Say, \"He is my Lord; there is no deity except Him. Upon Him I rely, and to Him is my return.\"",
                    "id": "Demikianlah, Kami telah mengutus engkau (Muhammad) kepada suatu umat yang sungguh sebelumnya telah berlalu beberapa umat, agar engkau bacakan kepada mereka (Al-Qur'an) yang Kami wahyukan kepadamu, padahal mereka ingkar kepada Tuhan Yang Maha Pengasih. Katakanlah, “Dia Tuhanku, tidak ada tuhan selain Dia; hanya kepada-Nya aku bertawakal dan hanya kepada-Nya aku bertobat.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1737",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1737.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1737.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Orang kafir dengan nada mengejek meminta Rasul untuk mendatangkan mukjizat yang kasat mata. Mereka lupa bahwa Al-Qur'an adalah mukjizat yang begitu nyata. Wahai Nabi Muhammad, demikianlah, Kami telah mengutus engkau kepada suatu umat-yakni seluruh manusia sampai akhir zaman-yang sungguh sebelumnya telah berlalu beberapa umat yang kepada mereka juga dikirim para rasul. Kami mengutusmu agar engkau bacakan kepada mereka Al-Qur'an yang Kami wahyukan kepadamu, padahal mereka tetap saja ingkar kepada Tuhan Yang Maha Pengasih, Maha Penyayang. Katakanlah, \"Dia Yang Maha Pengasih dan Penyayang itu adalah Tuhanku, dan tidak ada tuhan yang layak disembah selain Dia; hanya kepada-Nya aku bertawakal dan berserah diri, dan hanya kepada-Nya aku bertobat dan memohon ampunan.\"",
                        "long": "Ayat ini menjelaskan bahwa Allah telah mengutus Nabi Muhammad kepada umat yang belum pernah menerima kedatangan rasul Allah. Walaupun sebelumnya telah ada umat-umat lainnya yang pernah didatangi oleh para rasul-Nya, tetapi mereka tetap mengingkari adanya Tuhan yang Maha Rahmat\n\nAllah swt menjelaskan bahwa tugas Nabi Muhammad adalah untuk membacakan kepada umatnya Al-Quran yang telah diwahyukan kepada beliau. Allah memerintahkan kepada Nabi Muhammad saw agar ia mengatakan kepada umatnya, bahwa Allah adalah Tuhan semesta alam, tidak ada Tuhan selain Allah, dan hanya kepada-Nya ia bertawakal dan bertobat. Oleh karena itu, hendaklah umatnya beriman kepada-Nya.\n\nNabi Muhammad juga diperintahkan untuk menyampaikan kepada umatnya bahwa ia bertawakal dan bertobat kepada Allah swt, walaupun ia adalah seorang nabi dan rasul Allah yang tidak pernah berbuat dosa. Jika seorang rasul masih berbuat demikian, apalagi orang-orang yang berdosa, tentu mereka lebih layak untuk bertawakal dan bertobat kepada Allah dari segala dosa yang telah mereka lakukan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1738,
                    "inSurah": 31
                },
                "meta": {
                    "juz": 13,
                    "page": 253,
                    "manzil": 3,
                    "ruku": 208,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَوْ أَنَّ قُرْآنًا سُيِّرَتْ بِهِ الْجِبَالُ أَوْ قُطِّعَتْ بِهِ الْأَرْضُ أَوْ كُلِّمَ بِهِ الْمَوْتَىٰ ۗ بَل لِّلَّهِ الْأَمْرُ جَمِيعًا ۗ أَفَلَمْ يَيْأَسِ الَّذِينَ آمَنُوا أَن لَّوْ يَشَاءُ اللَّهُ لَهَدَى النَّاسَ جَمِيعًا ۗ وَلَا يَزَالُ الَّذِينَ كَفَرُوا تُصِيبُهُم بِمَا صَنَعُوا قَارِعَةٌ أَوْ تَحُلُّ قَرِيبًا مِّن دَارِهِمْ حَتَّىٰ يَأْتِيَ وَعْدُ اللَّهِ ۚ إِنَّ اللَّهَ لَا يُخْلِفُ الْمِيعَادَ",
                    "transliteration": {
                        "en": "Wa law anna Quraanan suyyirat bihil jibaalu aw qutti'at bihil ardu aw kullima bihil mawtaa; bal lillaahil amru jamee'aa; afalam yai'asil lazeena aamanooo al law yashaaa 'ullaahu lahadan naasa jamee'aa; wa laa yazaalul lazeena kafaroo tuseebuhum bimaa sana'oo qaari'atun aw tahullu qareebam min daarihim hatta yaatiya wa'dul laah; innal laaha laa yukhliful mee'aad"
                    }
                },
                "translation": {
                    "en": "And if there was any qur'an by which the mountains would be removed or the earth would be broken apart or the dead would be made to speak, [it would be this Qur'an], but to Allah belongs the affair entirely. Then have those who believed not accepted that had Allah willed, He would have guided the people, all of them? And those who disbelieve do not cease to be struck, for what they have done, by calamity - or it will descend near their home - until there comes the promise of Allah. Indeed, Allah does not fail in [His] promise.",
                    "id": "Dan sekiranya ada suatu bacaan (Kitab Suci) yang dengan itu gunung-gunung dapat digoncangkan, atau bumi jadi terbelah, atau orang yang sudah mati dapat berbicara, (itulah Al-Qur'an). Sebenarnya segala urusan itu milik Allah. Maka tidakkah orang-orang yang beriman mengetahui bahwa sekiranya Allah menghendaki (semua manusia beriman), tentu Allah memberi petunjuk kepada manusia semuanya. Dan orang-orang kafir senantiasa ditimpa bencana disebabkan perbuatan mereka sendiri atau bencana itu terjadi dekat tempat kediaman mereka, sampai datang janji Allah (penaklukkan Mekah). Sungguh, Allah tidak menyalahi janji."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1738",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1738.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1738.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan peringatkanlah orang kafir bahwa sekiranya ada suatu bacaan dalam bentuk kitab suci yang dengan bacaan itu gunung-gunung dapat digoncangkan dari tempatnya semula, atau bumi jadi terbelah dan mengalirkan sungai-sungai, atau orang yang sudah mati kembali hidup dan dapat berbicara-sekiranya Allah menghendaki-maka bacaan itu adalah Al-Qur'an, bukti kerasulan Nabi Muhammad. Sebenarnya segala urusan itu adalah milik Allah dan atas kehendak serta kewenangan-Nya. Maka tidakkah orang-orang yang beriman mengetahui bahwa sekiranya Allah menghendaki, tentu Allah memberi petunjuk kepada manusia semuanya sehingga semua beriman tanpa kecuali. Dan orang-orang kafir yang mengingkari Al-Qur'an senantiasa ditimpa bencana, seperti kekalahan melawan kaum mukmin, disebabkan perbuatan buruk mereka sendiri, atau bencana itu terjadi dekat tempat kediaman mereka, sampai akhirnya datang janji Allah berupa kemenangan kaum mukmin dalam penaklukan kota Mekah. Sungguh, Allah tidak akan pernah menyalahi janji.",
                        "long": "Pada ayat ini, Allah menjelaskan kebesaran Al-Quran sebagai mukjizat Nabi Muhammad saw. Namun sebelumnya, ayat ini menjelaskan bahwa walaupun ada satu bacaan atau Kitab Suci yang dapat menyebabkan gunung-gunung dapat berjalan, bumi dapat terbelah, atau orang-orang yang telah mati dapat hidup kembali dan berbicara, tetap akan ada orang-orang yang tidak beriman.\n\nMaksud pernyataan di atas adalah bahwa Allah telah memberikan mukjizat kepada Nabi Musa, seperti gunung Tur dapat berjalan, dan batu dapat mengeluarkan mata air setelah dipukul dengan tongkatnya. Allah swt juga telah memberikan mukjizat kepada Nabi Isa, sehingga ia dapat menghidupkan kembali orang-orang yang telah mati. Kepada Nabi Muhammad, Allah telah memberikan mukjizat terbesar yaitu Al-Quran, mukjizat yang bersifat abadi dan tetap dapat dilihat sampai sekarang. Al-Quran mengandung bukti-bukti yang menunjukkan kebesaran kekuasaan Allah dan keindahan ciptaan-Nya. Selain itu, Al-Quran membawa hikmah-hikmah, hukum-hukum, dan peraturan-peraturan yang diperlukan manusia untuk mengatur kehidupan dalam berbagai bidang baik ekonomi, politik, sosial, dan sebagainya, yang menjamin kehidupan yang bahagia di dunia dan akhirat jika mereka mau memahami dan mengamalkannya. Dengan demikian, mereka akan tampil menjadi bangsa dan umat yang terbaik di bumi ini. \n\nMenurut ath-thabrani dari Ibnu Abbas bahwa ada sekelompok kaum musyrikin Mekah, antara lain Abu Jahal dan Abdullah bin Abi Umayyah, mengadakan pertemuan di belakang Kabah, dan mengutus seseorang untuk memanggil Rasulullah saw. Beliau lalu datang ke tempat mereka, dan Abdullah bin Abi Umayyah mengatakan kepadanya bahwa mereka akan bersedia menjadi pengikutnya apabila beliau dapat membuktikan ke-mukjizatan Al-Quran untuk memindahkan gunung-gunung yang berada di sekitar Mekah, sehingga tempat tersebut menjadi lapang dan bisa dijadikan sebagai lahan pertanian. Jika hal tersebut dapat dilakukan Rasulullah, barulah mereka percaya bahwa ia benar-benar nabi dan rasul. Mereka juga meminta kepada Rasulullah agar dapat menguasai angin dan menjadikannya sebagai kendaraan pulang pergi dari Mekah ke negeri Syam. Menurut mereka, ini akan membuktikan bahwa Muhammad betul-betul nabi dan rasul Allah seperti Nabi Sulaiman yang mampu menggunakan angin sebagai kendaraan. Selain itu, mereka juga meminta agar Muhammad saw menghidupkan kembali nenek moyangnya yang telah lama meninggal dunia, seperti Qushai bin Kilab atau siapa saja yang mereka inginkan di antara nenek moyang mereka yang sudah mati. Mereka akan menanyakan kepada orang yang dihidupkan itu apakah dakwah yang disampaikan Muhammad saw benar atau tidak. Menurut mereka, hal ini adalah untuk membuktikan bahwa Nabi Muhammad saw benar-benar nabi dan rasul Allah sebagaimana halnya Nabi Isa as yang dengan mukjizatnya dapat menghidupkan kembali orang-orang yang telah mati.\n\nAllah swt lalu menurunkan ayat di atas untuk menegaskan bahwa seandainya Allah mengabulkan apa-apa yang mereka minta itu menjadi bagian dari kemukjizatan Al-Quran, pasti hal itu dapat terjadi, karena semuanya berada di bawah kekuasaan-Nya. Akan tetapi, seandainya hal tersebut benar-benar dikabulkan, mereka tetap tidak akan beriman kepada Allah, Nabi Muhammad, dan Al-Quran yang merupakan mukjizatnya.\n\nNabi Muhammad sangat ingin agar mereka itu beriman, namun mereka itu tidak juga beriman, bahkan mengajukan permintaan yang beraneka ragam. Oleh karena itu dalam ayat ini, Allah swt memberikan hiburan kepadanya dengan menegaskan bahwa ia dan orang-orang mukmin harus betul-betul memahami bahwa jika Allah menghendaki semua manusia beriman, pastilah Allah memberi petunjuk kepada mereka semuanya. Selain itu, orang-orang mukmin harus meyakini pula bahwa orang-orang kafir itu senantiasa akan ditimpa bencana dan kemurkaan Allah karena kekafiran dan perbuatan buruk mereka. Bencana itu bisa terjadi di dekat tempat kediaman mereka, sehingga akhirnya datanglah apa yang dijanjikan Allah, yaitu kehancuran mereka sendiri.\n\nPada akhir ayat ini, Allah menegaskan bahwa janji Allah untuk menolong kaum Muslimin dan membinasakan orang-orang kafir pasti akan terjadi, karena Allah tidak akan menyalahi janji-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1739,
                    "inSurah": 32
                },
                "meta": {
                    "juz": 13,
                    "page": 253,
                    "manzil": 3,
                    "ruku": 209,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَقَدِ اسْتُهْزِئَ بِرُسُلٍ مِّن قَبْلِكَ فَأَمْلَيْتُ لِلَّذِينَ كَفَرُوا ثُمَّ أَخَذْتُهُمْ ۖ فَكَيْفَ كَانَ عِقَابِ",
                    "transliteration": {
                        "en": "Wa laqadis tuhzi'a bi Rusulim min qablika fa amlaitu lillazeena kafaroo summa akhaztuhum fakaifa kaana 'iqaab"
                    }
                },
                "translation": {
                    "en": "And already were [other] messengers ridiculed before you, and I extended the time of those who disbelieved; then I seized them, and how [terrible] was My penalty.",
                    "id": "Dan sesungguhnya beberapa rasul sebelum engkau (Muhammad) telah diperolok-olokkan, maka Aku beri tenggang waktu kepada orang-orang kafir itu, kemudian Aku binasakan mereka. Maka alangkah hebatnya siksaan-Ku itu!"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1739",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1739.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1739.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ingatlah, wahai Nabi Muhammad, bahwa apabila kaummu yang kafir menghina dan memperolok dakwahmu, sesungguhnya beberapa rasul sebelum engkau telah pula diperolok-olokkan oleh kaum mereka yang ingkar. Karena perbuatan buruk itu, maka Aku beri tenggang waktu be-berapa lama kepada orang-orang kafir itu untuk bersenang-senang dalam kedurhakaan mereka, kemudian setelah waktu yang telah Aku tetapkan tiba, Aku binasakan mereka dengan siksa yang sangat pedih. Maka alangkah hebatnya siksaan-Ku yang Aku timpakan itu!",
                        "long": "Ayat ini berisi hiburan kepada Rasulullah dan umat Islam agar mereka tidak berkecil hati terhadap sikap dan keingkaran orang-orang kafir dan musyrikin Mekah. Di sini, Allah swt menerangkan bahwa bukan hanya Nabi Muhammad yang pernah diperolok-olok oleh kaum kafir dan musyrik, rasul-rasul yang telah diutus Allah kepada mereka sebelumnya pun mengalami keadaan yang demikian. Hanya saja, Allah memberi tenggang waktu dan menangguhkan datangnya azab dan malapetaka kepada orang-orang kafir tersebut. Pada akhirnya, Allah pasti membinasakan mereka dengan azab yang sangat dahsyat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1740,
                    "inSurah": 33
                },
                "meta": {
                    "juz": 13,
                    "page": 253,
                    "manzil": 3,
                    "ruku": 209,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَفَمَنْ هُوَ قَائِمٌ عَلَىٰ كُلِّ نَفْسٍ بِمَا كَسَبَتْ ۗ وَجَعَلُوا لِلَّهِ شُرَكَاءَ قُلْ سَمُّوهُمْ ۚ أَمْ تُنَبِّئُونَهُ بِمَا لَا يَعْلَمُ فِي الْأَرْضِ أَم بِظَاهِرٍ مِّنَ الْقَوْلِ ۗ بَلْ زُيِّنَ لِلَّذِينَ كَفَرُوا مَكْرُهُمْ وَصُدُّوا عَنِ السَّبِيلِ ۗ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِنْ هَادٍ",
                    "transliteration": {
                        "en": "Afaman Huwa qaaa'imun 'alaa kulli nafsim bimaa kasabat; wa ja'aloo illlaahi shurakaaa'a qul samoohum; am tunabbi'oona hoo bimaa laa ya'lamu fil ardi; am bizaahirim minal qawl; bal zuyyina lillazeena kafaroo makruhum wa suddoo 'anis sabeel; wa mai yudlilil laaahu famaa lahoo min haad;"
                    }
                },
                "translation": {
                    "en": "Then is He who is a maintainer of every soul, [knowing] what it has earned, [like any other]? But to Allah they have attributed partners. Say, \"Name them. Or do you inform Him of that which He knows not upon the earth or of what is apparent of speech?\" Rather, their [own] plan has been made attractive to those who disbelieve, and they have been averted from the way. And whomever Allah leaves astray - there will be for him no guide.",
                    "id": "Maka apakah Tuhan yang menjaga setiap jiwa terhadap apa yang diperbuatnya (sama dengan yang lain)? Mereka menjadikan sekutu-sekutu bagi Allah. Katakanlah, “Sebutkanlah sifat-sifat mereka itu.” Atau apakah kamu hendak memberitahukan kepada Allah apa yang tidak diketahui-Nya di bumi, atau (mengatakan tentang hal itu) sekedar perkataan pada lahirnya saja. Sebenarnya bagi orang kafir, tipu daya mereka itu dijadikan terasa indah, dan mereka dihalangi dari jalan (yang benar). Dan barangsiapa disesatkan Allah, maka tidak ada seorang pun yang memberi petunjuk baginya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1740",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1740.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1740.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Azab yang Allah timpakan kepada orang kafir tidak bersifat semena-mena, melainkan berdasarkan hasil pengawasan yang akurat. Maka apakah Tuhan yang menjaga, mengawasi, dan mencatat melalui para malaikat, setiap jiwa terhadap apa yang diperbuatnya sama dengan berhalaberhala yang orang kafir itu sembah? Mereka menjadikan sekutu-sekutu bagi Allah dengan membuat dan menyembah berhala. Katakanlah, wahai Nabi Muhammad, \"Hai orang kafir, sebutkanlah sifat-sifat mereka-yakni berhala-berhala yang kamu sembah itu! Atau apakah kamu mengira dengan nada mengejek hendak memberitahukan kepada Allah apa yang tidak diketahui-Nya di bumi-yaitu terkait berhala-berhala tersebut-atau kamu mengatakan tentang hal itu hanya sekadar perkataan pada lahirnya saja tanpa ada substansinya sama sekali?\" Sebenarnya bagi orang kafir ejekan dan tipu daya mereka itu dijadikan terasa indah oleh setan, dan mereka dihalangi olehnya dari jalan yang benar. Dan barang siapa disesatkan oleh Allah akibat kekufurannya sendiri, maka tidak ada seorang pun yang dapat memberi petunjuk baginya menuju kebenaran.",
                        "long": "Dalam ayat ini, Allah swt mencela kebodohan orang-orang kafir dan musyrik yang menyembah selain Allah, yaitu benda-benda yang mereka anggap sebagai Tuhan mereka, yang tidak dapat memberikan manfaat dan mudarat, tidak mengetahui apa-apa yang dikerjakan manusia, dan tidak pula dapat mengawasi serta memberikan pahala ataupun siksa kepada manusia berdasarkan amal dan perbuatannya. Allah mengatakan, \"Apakah Allah yang mengawasi perbuatan mereka sama dengan apa-apa yang dipertuhankan mereka yang tidak mempunyai sifat-sifat seperti itu?\"\n\nKarena kaum musyrikin menjadikan beberapa sekutu bagi Allah swt, maka Allah memerintahkan rasul-Nya untuk mengatakan kepada mereka, \"Sebutkanlah sifat-sifat yang dimiliki oleh apa yang kamu anggap sebagai tandingan atau sekutu Allah!\" Semuanya sama sekali tidak mempunyai sifat-sifat kesempurnaan seperti yang dimiliki Allah swt. Oleh sebab itu, tidaklah pantas untuk menjadi sekutu-Nya.\n\nUcapan dan tuntutan mereka kepada Nabi Muhammad seperti tersebut di atas juga memberikan kesan adanya anggapan mereka bahwa Allah seakan-akan tidak mengetahui apa yang terjadi di bumi ini. Oleh sebab itu, dalam ayat ini Allah swt mempertanyakan kepada mereka, apakah mereka mengucapkan kata-kata tersebut dengan maksud untuk memberitahukan kepada Allah swt tentang peristiwa-peristiwa yang terjadi di bumi yang mereka anggap tidak diketahui Allah? Padahal Allah mengetahui apa saja yang terjadi di alam ini.\n\nKarena kaum musyrikin itu mempersekutukan Allah dengan yang lain, maka dalam ayat ini Allah swt memerintahkan kepada Nabi Muhammad untuk menanyakan kepada mereka, apakah mereka menyebut-nyebut \"sekutu-sekutu\" Allah hanya sekedar ucapan lahiriyah saja, dan tidak mempunyai hakikat kebenaran sama sekali? Kalau demikian halnya, maka ucapan mereka adalah omong kosong yang tidak mempunyai hakikat kebenaran sama sekali. Padahal Allah sama sekali tidak mempunyai sekutu. Dia Mahatinggi dan Maha Sempurna.\n\nPada akhir ayat ini, Allah swt membuka tabir rahasia dari kesesatan orang-orang kafir dan musyrik, yaitu mereka telah terpukau oleh berbagai godaan setan yang menggambarkan kepada mereka bahwa tipu daya yang mereka lakukan itu adalah suatu kebaikan dan perbuatan yang terpuji. Oleh karena mereka telah menuruti rayuan setan tersebut, maka mereka telah dihalangi dan diselewengkan dari jalan Allah. Siapa yang telah menyimpang dari jalan Allah, maka tidak ada yang dapat memberikan petunjuk kepada orang-orang itu karena mereka telah menuruti kemauan setan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1741,
                    "inSurah": 34
                },
                "meta": {
                    "juz": 13,
                    "page": 253,
                    "manzil": 3,
                    "ruku": 209,
                    "hizbQuarter": 101,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَّهُمْ عَذَابٌ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَشَقُّ ۖ وَمَا لَهُم مِّنَ اللَّهِ مِن وَاقٍ",
                    "transliteration": {
                        "en": "Lahum 'azaabun fil hayaatid dunyaa wa la'azaabul Aakhirati ashaaq, wa maa lahum minal laahi min-waaq"
                    }
                },
                "translation": {
                    "en": "For them will be punishment in the life of [this] world, and the punishment of the Hereafter is more severe. And they will not have from Allah any protector.",
                    "id": "Mereka mendapat siksaan dalam kehidupan dunia, dan azab akhirat pasti lebih keras. Tidak ada seorang pun yang melindungi mereka dari (azab) Allah."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1741",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1741.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1741.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Mereka (orang kafir yang menyimpang dari jalan Allah) mendapat siksaan dalam kehidupan dunia, seperti kekalahan dalam perang dan kehinaan hidup, dan mereka juga akan mendapat azab di akhirat. Sungguh, azab di akhirat itu pasti lebih keras. Tidak ada seorang pun yang dapat melindungi dan menyelamatkan mereka dari azab Allah di dunia maupun akhirat.",
                        "long": "Ayat ini menjelaskan betapa malangnya nasib orang-orang yang sesat itu, dan bagaimana besarnya kerugian yang mereka derita, yaitu: kesengsaraan hidup di dunia ini, sedangkan di akhirat akan diazab lebih berat lagi. Mereka tidak mendapatkan seorang pelindung pun dari azab Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1742,
                    "inSurah": 35
                },
                "meta": {
                    "juz": 13,
                    "page": 254,
                    "manzil": 3,
                    "ruku": 209,
                    "hizbQuarter": 102,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ مَّثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ ۖ تَجْرِي مِن تَحْتِهَا الْأَنْهَارُ ۖ أُكُلُهَا دَائِمٌ وَظِلُّهَا ۚ تِلْكَ عُقْبَى الَّذِينَ اتَّقَوا ۖ وَّعُقْبَى الْكَافِرِينَ النَّارُ",
                    "transliteration": {
                        "en": "Masalul Jannatil latee wu'idal muttaqoona tajree min tahtihal anhaaru ukuluhaa daaa'imunw wa zilluhaa; tilka uqbal lazeenat taqaw wa 'uqbal kafireenan Naar"
                    }
                },
                "translation": {
                    "en": "The example of Paradise, which the righteous have been promised, is [that] beneath it rivers flow. Its fruit is lasting, and its shade. That is the consequence for the righteous, and the consequence for the disbelievers is the Fire.",
                    "id": "Perumpamaan surga yang dijanjikan kepada orang yang bertakwa (ialah seperti taman), mengalir di bawahnya sungai-sungai; senantiasa berbuah dan teduh. Itulah tempat kesudahan bagi orang yang bertakwa; sedang tempat kesudahan bagi orang yang ingkar kepada Tuhan ialah neraka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1742",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1742.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1742.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Usai menggambarkan sanksi bagi orang kafir pada ayat-ayat sebelumnya, pada ayat berikut Allah menjelaskan anugerah-Nya kepada orang yang bertakwa. Perumpamaan dan gambaran surga yang dijanjikan oleh Allah kepada orang yang bertakwa ialah bahwa surga itu seperti taman yang mengalir di bawahnya-yakni di bawah pepohonan dan istana-istananya-sungai-sungai; pepohonan di sana senantiasa berbuah dengan aneka rasa yang lezat dan juga menciptakan suasana yang teduh. Anugerah Allah yang sedemikian indah itulah tempat kesudahan yang hanya diberikan-Nya bagi orang yang bertakwa; sedang tempat kesudahan bagi orang yang ingkar kepada Tuhan ialah neraka beserta siksaannya yang sangat pedih.",
                        "long": "Salah satu kebiasaan Al-Quran adalah setelah menyebutkan hal-hal yang berkenaan dengan neraka, biasanya diiringi dengan menyebutkan hal-hal yang berkenaan dengan surga yang penuh dengan kenikmatan yang akan diperoleh orang-orang yang beriman, bertakwa, dan beramal saleh. \n\nDalam ayat ini, surga yang dijanjikan Allah kepada orang-orang yang bertakwa diumpamakan sebuah kebun yang indah dan subur karena dialiri sungai-sungai. Pohon-pohonnya dilukiskan berbuah tidak henti-hentinya dan memberikan naungan kepada orang yang berteduh di bawahnya. Surga tersebut merupakan tempat tinggal terakhir dan selamanya bagi orang-orang yang bertakwa.\n\nSebaliknya, neraka merupakan tempat kediaman yang penuh kesengsara-an bagi orang-orang kafir.\n\nDengan digambarkannya perbandingan antara kedua tempat tersebut, maka manusia yang hidup di dunia ini dipersilakan untuk memilih jalan ke surga dengan beriman, beramal, dan bertakwa, atau jalan ke neraka dengan kekafiran, kemusyrikan, dan perbuatan-perbuatan jahat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1743,
                    "inSurah": 36
                },
                "meta": {
                    "juz": 13,
                    "page": 254,
                    "manzil": 3,
                    "ruku": 209,
                    "hizbQuarter": 102,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَفْرَحُونَ بِمَا أُنزِلَ إِلَيْكَ ۖ وَمِنَ الْأَحْزَابِ مَن يُنكِرُ بَعْضَهُ ۚ قُلْ إِنَّمَا أُمِرْتُ أَنْ أَعْبُدَ اللَّهَ وَلَا أُشْرِكَ بِهِ ۚ إِلَيْهِ أَدْعُو وَإِلَيْهِ مَآبِ",
                    "transliteration": {
                        "en": "Wallazeena aatainaa humul Kitaaba yafrahoona bimaa unzila ilaika wa minal Ahzaabi mai yunkiru ba'dah; qul innamaa umirtu an a'budal laaha wa laaa ushrika bih; ilaihi ad'oo wa ilaihi maab"
                    }
                },
                "translation": {
                    "en": "And [the believers among] those to whom We have given the [previous] Scripture rejoice at what has been revealed to you, [O Muhammad], but among the [opposing] factions are those who deny part of it. Say, \"I have only been commanded to worship Allah and not associate [anything] with Him. To Him I invite, and to Him is my return.\"",
                    "id": "Dan orang yang telah Kami berikan kitab kepada mereka bergembira dengan apa (kitab) yang diturunkan kepadamu (Muhammad), dan ada di antara golongan (Yahudi dan Nasrani), yang mengingkari sebagiannya. Katakanlah, “Aku hanya diperintah untuk menyembah Allah dan tidak mempersekutukan-Nya. Hanya kepada-Nya aku seru (manusia) dan hanya kepada-Nya aku kembali.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1743",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1743.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1743.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ketahuilah, wahai Nabi Muhammad, bahwa ada sebagian dari orang yang telah Kami berikan kitab kepada mereka (Yahudi dan Nasrani) yang bergembira dengan apa (Al-Qur'an) yang diturunkan kepadamu, seperti 'Abdulla h bin Sala m, karena kesesuaian antara Al-Qur'an dengan kitab mereka; dan ada pula di antara golongan yang bersekutu, yakni kaum musyrik Mekah, Yahudi, dan Nasrani yang mengingkari sebagiannya. Katakanlah kepada mereka, \"Aku hanya diperintah secara tegas untuk menyembah Allah semata dan tidak mempersekutukan-Nya dengan apa pun. Hanya kepada-Nya aku seru manusia menuju kebenaran, dan hanya kepada-Nya aku kembali untuk bertobat.\"",
                        "long": "Ayat ini menjelaskan sikap orang-orang Ahli Kitab (Yahudi dan Nasrani) terhadap Al-Quran setelah mereka memeluk agama Islam, seperti Abdullah bin Salam dari kalangan Yahudi. Mereka ini sangat gembira dengan turunnya Al-Quran dan menerima baik segala ajaran dan hukum-hukumnya. Akan tetapi, di samping itu ada pula segolongan orang-orang Yahudi dan Nasrani yang mengingkari sebagian dari Al-Quran, terutama mengenai ajaran tentang keesaan Allah swt.\n\nAllah memerintahkan kepada Nabi Muhammad untuk menyampaikan kepada golongan tersebut kemantapan imannya kepada Allah swt, dengan mengatakan, \"Sesungguhnya aku hanya diperintahkan untuk menyembah Allah semata dan aku tidak akan mempersekutukan sesuatupun dengan-Nya. Aku seru manusia untuk beriman hanya kepada-Nya dan aku yakin bahwa hanya kepada-Nya aku akan kembali.\"\n\nUcapan Rasul ini dengan tegas menolak kepercayaan syirik, yaitu mempersekutukan sesuatu dengan Allah seperti yang dianut oleh kaum musyrikin. Kepercayaan itu sangat bertentangan dengan ajaran Al-Quran tentang keesaan Allah secara mutlak, yang merupakan inti agama Islam."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1744,
                    "inSurah": 37
                },
                "meta": {
                    "juz": 13,
                    "page": 254,
                    "manzil": 3,
                    "ruku": 209,
                    "hizbQuarter": 102,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَكَذَٰلِكَ أَنزَلْنَاهُ حُكْمًا عَرَبِيًّا ۚ وَلَئِنِ اتَّبَعْتَ أَهْوَاءَهُم بَعْدَمَا جَاءَكَ مِنَ الْعِلْمِ مَا لَكَ مِنَ اللَّهِ مِن وَلِيٍّ وَلَا وَاقٍ",
                    "transliteration": {
                        "en": "Wa kazaalika anzalnaahu hukman 'Arabiyyaa; wa la'init taba'ta ahwaaa 'ahum ba'da maa jaaa'aka minal 'ilmi maa laka minal laahi minw waliyinw wa laa waaq"
                    }
                },
                "translation": {
                    "en": "And thus We have revealed it as an Arabic legislation. And if you should follow their inclinations after what has come to you of knowledge, you would not have against Allah any ally or any protector.",
                    "id": "Dan demikianlah Kami telah menurunkannya (Al-Qur'an) sebagai peraturan (yang benar) dalam bahasa Arab. Sekiranya engkau mengikuti keinginan mereka setelah datang pengetahuan kepadamu, maka tidak ada yang melindungi dan yang menolong engkau dari (siksaan) Allah."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1744",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1744.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1744.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sebagaimana telah Kami turunkan kitab suci kepada kaum Yahudi dan Nasrani dengan bahasa masing-masing, demikianlah pula Kami telah menurunkannya (Al-Qur'an) kepadamu, wahai Nabi Muhammad, sebagai peraturan hukum yang Kami turunkan dalam bahasa Arab. Sekiranya engkau mengikuti keinginan mereka untuk mempersekutukan Allah setelah datang pengetahuan yang benar dan lurus, yakni Al-Qur'an kepadamu, maka tidak akan ada yang dapat melindungi dan menolong engkau dari siksa Allah.",
                        "long": "Pada ayat ini, Allah menjelaskan beberapa ciri utama Al-Quran yang diwahyukan kepada Nabi Muhammad saw, yaitu Al-Quran berisi peraturan-peraturan yang benar, yang harus ditaati manusia untuk mencapai kebahagiaan dan keberuntungan di dunia dan akhirat kelak. Di samping itu, Al-Quran diturunkan dalam bahasa Arab, yaitu bahasa yang memiliki beberapa keistimewaan yang tidak dimiliki oleh bahasa lain.\n\nDi antara keistimewaan bahasa Arab ialah bahasa ini merupakan bahasa yang sudah berkembang, jauh sebelum datangnya Islam sehingga kosakatanya sangat kaya. Bahasa Arab juga memiliki kaedah pembentukan kata (morfologi) yang memungkinkannya bisa dengan mudah menampung konsep-konsep baru untuk pembentukan kata baru. Dengan demikian, dapat dipahami kemampuan bahasa Arab mengungkapkan konsep-konsep wahyu. Karena Al-Quran berbahasa Arab, maka Al-Quran telah melestarikan bahasa Arab sehingga tidak hilang seperti bahasa Suryani, Koptic, dan sebagainya.\n\nKarena Al-Quran diturunkan dalam bahasa Arab dan menjadi mukjizat Nabi Muhammad sebagai kitab suci, maka terjemahan Al-Quran dalam bahasa asing tidak dianggap sebagai kitab suci juga. Sebagaimana diketahui, di antara kehormatan yang dimiliki Al-Quran ialah membacanya dianggap sebagai ibadah, dan tidak boleh disentuh kecuali oleh orang-orang yang suci, yaitu orang-orang yang tidak berhadas besar maupun kecil.\n\nBanyak ayat yang menyebutkan ciri-ciri Al-Quran, antara lain firman Allah swt:\n\n(Yang) tidak akan didatangi oleh kebatilan, baik dari depan maupun dari belakang (pada masa lalu dan yang akan datang), yang diturunkan dari Tuhan Yang Maha Bijaksana, Maha Terpuji. (Fushshilat/41: 42)\n\nSelanjutnya Allah swt memperingatkan Nabi Muhammad saw dan kaum Muslimin umumnya, agar jangan menuruti kehendak hawa nafsu dan keinginan orang-orang yang mengingkari Al-Quran, baik sebagian maupun keseluruhannya, karena Allah swt telah memberikan ilmu yang benar kepada mereka, yaitu Al-Quran al-Karim. Jika Nabi Muhammad dan kaum Muslimin sampai tergoda dan mengikuti kehendak orang-orang yang mengingkari Al-Quran itu, maka siksa Allah pasti akan menimpa mereka dan tidak seorangpun dapat menjadi pelindung terhadap siksa Allah swt Yang Mahakuasa."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1745,
                    "inSurah": 38
                },
                "meta": {
                    "juz": 13,
                    "page": 254,
                    "manzil": 3,
                    "ruku": 210,
                    "hizbQuarter": 102,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَقَدْ أَرْسَلْنَا رُسُلًا مِّن قَبْلِكَ وَجَعَلْنَا لَهُمْ أَزْوَاجًا وَذُرِّيَّةً ۚ وَمَا كَانَ لِرَسُولٍ أَن يَأْتِيَ بِآيَةٍ إِلَّا بِإِذْنِ اللَّهِ ۗ لِكُلِّ أَجَلٍ كِتَابٌ",
                    "transliteration": {
                        "en": "Wa laqad arsalnaa Rusulam min qablika wa ja'alnaa lahum azwaajanw wa zurriyyah; wa maa kaana lirasoolin ai yaatiya bi aayatin illaa bi iznil laah; likulli ajalin kitaab"
                    }
                },
                "translation": {
                    "en": "And We have already sent messengers before you and assigned to them wives and descendants. And it was not for a messenger to come with a sign except by permission of Allah. For every term is a decree.",
                    "id": "Dan sungguh, Kami telah mengutus beberapa rasul sebelum engkau (Muhammad) dan Kami berikan kepada mereka istri-istri dan keturunan. Tidak ada hak bagi seorang rasul mendatangkan sesuatu bukti (mukjizat) melainkan dengan izin Allah. Untuk setiap masa ada Kitab (tertentu)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1745",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1745.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1745.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan jika kaum kafir bertanya mengapa kamu mempunyai istri, maka ketahuilah wahai Nabi Muhammad, bahwa sungguh Kami telah mengutus beberapa rasul kepada umat-umat sebelum engkau dari golongan manusia, dan Kami berikan kepada sebagian dari mereka istri-istri dan keturunan sebagaimana dimiliki oleh manusia lainnya. Jika kaum kafir itu menuntutmu untuk mendatangkan mukjizat yang kasat mata, maka sesungguhnya tidak ada hak bagi seorang rasul pun untuk mendatangkan sesuatu bukti (mukjizat) guna memenuhi tuntutan kaumnya atas kekuatannya sendiri, melainkan dengan izin Allah. Untuk setiap masa ada Kitab, yakni mukjizat para nabi dan rasul yang sesuai kondisi dengan masanya.",
                        "long": "Dalam ayat ini Allah swt menjelaskan bahwa Dia telah mengutus rasul-rasul sebelum Nabi Muhammad saw dan mereka beristri dan berketurunan.\n\nHal ini menunjukkan bahwa kehidupan berkeluarga dan berketurunan adalah hal yang wajar dan merupakan sunatullah bagi makhluk-Nya yang hidup di muka bumi ini. Sunatullah ini juga berlaku bagi para nabi dan rasul-Nya. Hidup berkeluarga tidak boleh dianggap sebagai penghalang dalam perjuangan, baik demi kemajuan pribadi, masyarakat, maupun bangsa. Bahkan pernikahan menurut ajaran Islam, selain bertujuan untuk melanjut-kan keturunan, juga berfungsi memberikan ketenangan, ketenteraman, dan kestabilan hidup. Pernikahan juga mempererat silaturrahim antara keluarga-keluarga yang bersangkutan dan dapat menjadi sarana dakwah Islamiyah, sebagaimana yang dilakukan oleh Rasulullah saw.\n\nKarena hidup berkeluarga adalah suatu yang wajar dan merupakan sunatullah, maka manusia tidak boleh menentangnya. Oleh sebab itu, adalah keliru apabila ada pemimpin agama yang mempunyai anggapan bahwa mereka harus menjauhi hidup berkeluarga, agar tidak mengganggu dalam menjalankan agama. Sikap hidup membujang atau tabattul adalah hal-hal yang tidak dikenal dalam agama Islam, bahkan sangat ditentang. Perkawinan dan anak merupakan nikmat dan rahmat Allah kepada hamba-Nya. Oleh karena itu, perkawinan dan keluarga perlu dipelihara dan dilestarikan sebaik-baiknya.\n\nDalam satu riwayat disebutkan bahwa orang-orang Yahudi mencela Nabi Muhammad saw karena beliau mempunyai beberapa orang istri. Mereka mengatakan kalau benar-benar Muhammad adalah nabi dan rasul, tentu ia akan menyibukkan diri dengan tugas-tugas kenabiannya saja dan tidak akan mempedulikan perempuan. Mereka juga meminta bermacam-macam bukti tentang kenabiannya, selain Al-Quran yang menjadi mukjizatnya. Allah swt telah membantah mereka dengan menegaskan bahwa Nabi Muhammad bukanlah rasul Allah yang pertama, melainkan sebelum itu Allah swt telah mengutus beberapa rasul dan semuanya adalah manusia biasa yang membutuhkan makan, minum, berkeluarga dan berketurunan, serta melakukan perbuatan-perbuatan yang dilakukan oleh orang-orang lainnya, berjalan di pasar, dan sebagainya. Dalam hal ini, Allah swt memerintahkan kepada Nabi Muhammad saw untuk menegaskan:\n\nSesungguhnya aku ini hanya seorang manusia seperti kamu, yang telah menerima wahyu. (al-Kahf/18: 110)\n\nKemudian, dalam ayat ini ditegaskan tentang kewajaran dan kebolehan para rasul itu hidup berkeluarga dan berketurunan. Allah menegaskan bahwa Dia mengaruniai mereka istri dan keturunan.\n\nDalam suatu hadis yang diriwayatkan oleh Imam al-Bukhari dan Imam Muslim dari Anas bin Malik disebutkan bahwa Nabi Muhammad saw bersabda:\n\nAdapun aku, aku berpuasa dan berbuka, aku salat di waktu malam, juga tidur, aku juga makan daging dan juga menikahi wanita; maka siapa yang tidak suka kepada sunahku (jalan kehidupanku) tiadalah ia termasuk umatku. (Riwayat al-Bukhari dan Muslim)\n\nAdapun ayat-ayat atau bukti-bukti kenabian dan kerasulan yang dituntut orang-orang kafir kepada Nabi Muhammad saw dijawab berulang kali dalam Al-Quran, bahwa masalah tersebut adalah wewenang Allah semata. Para rasul hanya memperlihatkan mukjizatnya dengan seizin Allah.\n\nMukjizat terbesar Nabi Muhammad saw adalah Al-Quran yang membawa ajaran-ajaran, hukum-hukum, dan peraturan-peraturan yang berperan menuntun manusia kepada kebahagiaan dunia dan akhirat. Al-Quran senantiasa terpelihara kemurniannya dan tidak satupun makhluk yang dapat menandinginya, baik dari sisi kandungannya maupun redaksi kebahasaannya.\n\nAyat-ayat atau bukti-bukti dan mukjizat tidak muncul begitu saja, melainkan harus sesuai dengan hikmah Allah dan selaras dengan masanya. Masing-masing masa tersebut mempunyai ciri tersendiri yang telah ditetapkan Allah. Setiap peristiwa yang terjadi di alam ini mengikuti ketentuan atau takdir-Nya, baik mengenai waktu, tempat, cara, maupun sebab-sebab terjadinya. Mukjizat tidak akan muncul sebelum waktu yang telah ditetapkan Allah. Ajal seseorang, rezeki, dan peristiwa-peristiwa yang dialami di dunia dan di akhirat terjadi sesuai dengan ketentuan Allah. Manusia tidak dapat meminta agar ajalnya datang lebih cepat ataupun lebih lambat dari apa yang telah ditetapkan Allah dalam takdir-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1746,
                    "inSurah": 39
                },
                "meta": {
                    "juz": 13,
                    "page": 254,
                    "manzil": 3,
                    "ruku": 210,
                    "hizbQuarter": 102,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "يَمْحُو اللَّهُ مَا يَشَاءُ وَيُثْبِتُ ۖ وَعِندَهُ أُمُّ الْكِتَابِ",
                    "transliteration": {
                        "en": "Yamhul laahu maa yashaaa'u wa yusbitu wa 'indahooo ummul Kitaab"
                    }
                },
                "translation": {
                    "en": "Allah eliminates what He wills or confirms, and with Him is the Mother of the Book.",
                    "id": "Allah menghapus dan menetapkan apa yang Dia kehendaki. Dan di sisi-Nya terdapat Ummul-Kitab (Lauh Mahfuzh)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1746",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1746.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1746.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah Yang Mahabijaksana menghapus hukum yang layak untuk dihapus, dan menetapkan apa (hukum) yang Dia kehendaki untuk ditetapkan. Allah melakukan hal itu sesuai dengan hikmah dan kebijaksanaan yang dimiliki-Nya. Dan di sisi-Nya terdapat Ummul-Kitab, yakni Lauh Mahfuz.",
                        "long": "Pada ayat ini, Allah swt menerangkan satu sisi dari kekuasaan-Nya, yaitu menghapuskan atau menetapkan apa-apa yang dikehendaki-Nya, baik mengenai syariat-Nya atau nasib manusia.\n\nTanda-tanda adanya penghapusan dan penetapan Allah, ialah adanya siang dan malam yang datang silih berganti, adanya gelap dan terang, hidup dan mati, kuat dan lemah, sehat dan sakit, bahagia dan sengsara, kaya dan miskin, dan sebagainya.\n\nPada akhir ayat ini, Allah swt menjelaskan bahwa di sisi-Nya atau Lauh Mahfudh terdapat Ummul Kitab. Semua peristiwa dan kejadian yang terjadi di alam ini tertulis di Lauh Mahfudh yang tidak akan mengalami perubahan dan penggantian apapun.\n\nBerdasarkan pengertian tersebut maka ayat ini juga merupakan bantahan terhadap tuntutan kaum kafir dan musyrik yang meminta kepada Nabi Muhammad saw untuk mendatangkan ayat-ayat atau bukti-bukti kenabian dan kerasulannya, selain Al-Quran. Hal tersebut tidak akan pernah terjadi, kecuali jika hal itu termasuk dalam ketentuan yang ditetapkan Allah atau telah ada dalam Lauh Mahfudh."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1747,
                    "inSurah": 40
                },
                "meta": {
                    "juz": 13,
                    "page": 254,
                    "manzil": 3,
                    "ruku": 210,
                    "hizbQuarter": 102,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِن مَّا نُرِيَنَّكَ بَعْضَ الَّذِي نَعِدُهُمْ أَوْ نَتَوَفَّيَنَّكَ فَإِنَّمَا عَلَيْكَ الْبَلَاغُ وَعَلَيْنَا الْحِسَابُ",
                    "transliteration": {
                        "en": "Wa im maa nurriyannaka ba'dal lazee na'iduhum aw nata waffayannaka fa innamaa 'alaikal balaaghu wa 'alainal hisaab"
                    }
                },
                "translation": {
                    "en": "And whether We show you part of what We promise them or take you in death, upon you is only the [duty of] notification, and upon Us is the account.",
                    "id": "Dan sungguh jika Kami perlihatkan kepadamu (Muhammad) sebagian (siksaan) yang Kami ancamkan kepada mereka atau Kami wafatkan engkau, maka sesungguhnya tugasmu hanya menyampaikan saja, dan Kamilah yang memperhitungkan (amal mereka)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1747",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1747.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1747.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kami-Allah-Mahakuasa menetapkan atau menghapus hukum yang Kami kehendaki sesuai kebijaksanaan Kami. Dan sungguh, jika Kami perlihatkan kepadamu, wahai Nabi Muhammad, di dunia ini sebagian dari siksaan dan balasan yang Kami ancamkan kepada mereka (orang kafir) sebagaimana permintaan mereka, atau Kami wafatkan engkau sebelum menyaksikan siksaan itu datang kepada mereka-namun mereka pasti akan merasakannya-maka sesungguhnya tugasmu hanya menyampaikan saja dakwah dan risalah yang kami titipkan kepadamu, dan Kamilah yang akan memperhitungkan amal mereka serta balasan yang akan mereka terima atasnya.",
                        "long": "Dalam ayat ini diterangkan bahwa ada kemungkinan Allah memberikan umur yang panjang kepada Rasulullah, sehingga beliau sempat melihat kedatangan azab yang telah dijanjikan kepada kaum kafir. Bisa juga Allah memberikan usia yang pendek sehingga Rasulullah tidak mendapat kesempatan untuk menyaksikan azab yang diturunkan-Nya itu. Tugas Rasul-Nya hanya mendakwahkan agama Islam kepada manusia. Adapun persoalan mereka mau menerima atau menolaknya adalah urusan Allah. Bagi yang menolak, azab Allah pasti akan datang, apakah disegerakan atau ditunda, adalah wewenang Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1748,
                    "inSurah": 41
                },
                "meta": {
                    "juz": 13,
                    "page": 254,
                    "manzil": 3,
                    "ruku": 210,
                    "hizbQuarter": 102,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَوَلَمْ يَرَوْا أَنَّا نَأْتِي الْأَرْضَ نَنقُصُهَا مِنْ أَطْرَافِهَا ۚ وَاللَّهُ يَحْكُمُ لَا مُعَقِّبَ لِحُكْمِهِ ۚ وَهُوَ سَرِيعُ الْحِسَابِ",
                    "transliteration": {
                        "en": "Awalam yaraw annaa naatil arda nanqusuhaa min atraafihaa; wallaahu yahkumu laa mu'aqqiba lihukmih; wa Huwa saree'ul hisaab"
                    }
                },
                "translation": {
                    "en": "Have they not seen that We set upon the land, reducing it from its borders? And Allah decides; there is no adjuster of His decision. And He is swift in account.",
                    "id": "Dan apakah mereka tidak melihat bahwa Kami mendatangi daerah-daerah (orang yang ingkar kepada Allah), lalu Kami kurangi (daerah-daerah) itu (sedikit demi sedikit) dari tepi-tepinya? Dan Allah menetapkan hukum (menurut kehendak-Nya), tidak ada yang dapat menolak ketetapan-Nya; Dia Mahacepat perhitungan-Nya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1748",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1748.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1748.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Di antara bukti-bukti Allah melaksanakan ancaman-Nya adalah peristiwa yang dialami oleh orang-orang kafir tersebut. Dan apakah mereka orang-orang kafir itu tidak melihat bahwa Kami melalui hambahamba Kami yang berjihad, mendatangi dan menaklukkan daerah-daerah yang dikuasai orang yang ingkar kepada Allah, lalu Kami kurangi daerah-daerah yang dikuasai itu sedikit demi sedikit dari tepi-tepinya? Dan Allah menetapkan hukum menurut kehendak-Nya. Tidak ada kekuatan apa pun yang dapat menolak ketetapan-Nya bila Allah sudah menetapkannya; Dia Mahacepat lagi Mahabijaksana perhitungan-Nya.",
                        "long": "Dalam ayat ini, Allah swt memperlihatkan pula sisi lain dari kekuasaan-Nya dalam menimpakan hukuman terhadap orang-orang kafir, yaitu dengan cara mengurangi luas daerah negeri mereka sedikit demi sedikit. Pengurangan daerah mereka itu, mungkin disebabkan bencana alam yang diturunkan Allah kepada mereka, sehingga sebagian dari daerah mereka menjadi rusak dan tidak dapat didiami lagi; atau karena terjadi peperangan, sehingga wilayah kekuasaannya dikuasai bangsa lain dan mereka menjadi terdesak atau diusir dari negeri mereka.\n\nSelanjutnya, dalam ayat ini dijelaskan kekuasaan Allah dalam hal menetapkan hukum menurut hikmah dan kehendak-Nya, dan hukum yang telah ditetapkan-Nya tidak akan dapat ditolak atau dibantah oleh siapapun juga.\n\nPada akhir ayat ini, ditegaskan bahwa Allah cepat sekali mengadakan perhitungan terhadap perbuatan hamba-Nya, sehingga mereka yang beriman dan berbuat kebajikan akan memperoleh ganjaran kebaikan, sedang mereka yang ingkar kepada-Nya dan berbuat kezaliman pasti mendapat siksa dan kemurkaan-Nya. Segala perbuatan hamba-Nya tidak akan luput dari perhitungan Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1749,
                    "inSurah": 42
                },
                "meta": {
                    "juz": 13,
                    "page": 254,
                    "manzil": 3,
                    "ruku": 210,
                    "hizbQuarter": 102,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَدْ مَكَرَ الَّذِينَ مِن قَبْلِهِمْ فَلِلَّهِ الْمَكْرُ جَمِيعًا ۖ يَعْلَمُ مَا تَكْسِبُ كُلُّ نَفْسٍ ۗ وَسَيَعْلَمُ الْكُفَّارُ لِمَنْ عُقْبَى الدَّارِ",
                    "transliteration": {
                        "en": "Wa qad makaral lazeena min qablihim falillaahil makru jamee'aa; ya'lamu maa taksibu kullu nafs; wa sa ya'lamul kuffaaru liman 'uqbad daar"
                    }
                },
                "translation": {
                    "en": "And those before them had plotted, but to Allah belongs the plan entirely. He knows what every soul earns, and the disbelievers will know for whom is the final home.",
                    "id": "Dan sungguh, orang sebelum mereka (kafir Mekah) telah mengadakan tipu daya, tetapi semua tipu daya itu dalam kekuasaan Allah. Dia mengetahui apa yang diusahakan oleh setiap orang, dan orang yang ingkar kepada Tuhan akan mengetahui untuk siapa tempat kesudahan (yang baik)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1749",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1749.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1749.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kaum kafir Mekah secara rahasia merencanakan penentangan kepada Nabi Muhammad, sebagaimana kaum kafir terdahulu juga melakukan hal yang sama kepada rasul yang Allah utus kepada mereka. Dan sungguh, orang sebelum mereka, yakni kaum kafir yang hidup sebelum kaum kafir Mekah, telah mengadakan tipu daya menentang para rasul, tetapi semua tipu daya yang mereka lakukan itu berada dalam genggaman kekuasaan Allah sehingga sangat mudah bagi-Nya untuk menggagalkannya. Dia mengetahui apa yang diusahakan oleh setiap orang, tidak terkecuali upaya mereka menyusun rencana rahasia, dan pada saat dihadapkan kepada Tuhan, orang yang ingkar kepada Tuhan akan mengetahui untuk siapa tempat kesudahan yang baik di dunia dan di akhirat kelak-tentu bagi para pengikut rasul-rasul itu.",
                        "long": "Allah kembali menjelaskan sisi lain dari kekuasaan-Nya, yaitu dalam menghadapi tipu daya yang dilakukan oleh kaum kafir Mekah terhadap Rasulullah dan kaum Muslimin. Allah menjelaskan bahwa orang-orang kafir sebelum masa Rasulullah juga telah melakukan tipu daya terhadap para rasul-Nya. Tetapi semua tipu daya mereka itu berada di bawah kekuasaan Allah sehingga tidak akan membinasakan agama dan rasul-Nya. Allah senantiasa mengetahui lebih dulu apa saja yang diperbuat oleh setiap makhluk-Nya.\n\nDari sini dapat dipahami bahwa jika tipu daya orang-orang kafir terhadap para rasul Allah sebelumnya berada di bawah kekuasaan Allah, tentulah tipu daya kaum kafir Mekah terhadap Nabi Muhammad dan kaum Muslimin juga berada di bawah kekuasaan Allah. Dengan demikian, tipu daya tersebut tidak akan berhasil membinasakan Rasulullah dan kaum Muslimin, dan tidak akan mampu menghalangi penyebaran agama Islam.\n\nPada akhir ayat ini, Allah menegaskan bahwa orang kafir pasti akan mengetahui kelak bahwa yang berhak untuk memperoleh tempat tinggal terakhir dan abadi yang penuh kenikmatan hanyalah mereka yang beriman dan beramal saleh."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 1750,
                    "inSurah": 43
                },
                "meta": {
                    "juz": 13,
                    "page": 255,
                    "manzil": 3,
                    "ruku": 210,
                    "hizbQuarter": 102,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَيَقُولُ الَّذِينَ كَفَرُوا لَسْتَ مُرْسَلًا ۚ قُلْ كَفَىٰ بِاللَّهِ شَهِيدًا بَيْنِي وَبَيْنَكُمْ وَمَنْ عِندَهُ عِلْمُ الْكِتَابِ",
                    "transliteration": {
                        "en": "Wa yaqoolul lazeena kafaroo lasta mursalaa; qul kafaa billaahi shaheedam bainee wa bainakum wa man 'indahoo 'ilmul Kitaab"
                    }
                },
                "translation": {
                    "en": "And those who have disbelieved say, \"You are not a messenger.\" Say, [O Muhammad], \"Sufficient is Allah as Witness between me and you, and [the witness of] whoever has knowledge of the Scripture.\"",
                    "id": "Dan orang-orang kafir berkata, “Engkau (Muhammad) bukanlah seorang Rasul.” Katakanlah, “Cukuplah Allah dan orang yang menguasai ilmu Al-Kitab menjadi saksi antara aku dan kamu.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1750",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1750.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1750.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kaum kafir menolak kerasulan Nabi Muhammad. Dan orang-orang kafir berkata, \"Engkau, wahai Muhammad, bukanlah seorang rasul, melainkan pesihir.\" Jika mereka berkata demikian, katakanlah kepada mereka, \"Cukuplah Allah Yang Maha Mengetahui dan orang yang menguasai ilmu Al-Kitab-Yahudi dan Nasrani yang mengimani risalahku dan Al-Qur'an yang aku sampaikan-yang bertindak menjadi saksi antara aku sebagai penyampai kebenaran yang termaktub dalam AlQur'an dan kamu yang menolak kebenaran Al-Qur'an itu.",
                        "long": "Ayat ini menunjukkan dialog antara orang-orang kafir Mekah dan Rasulullah, di mana mereka mengingkari kerasulannya dengan mengatakan, \"Engkau bukanlah seorang yang dijadikan rasul.\" Untuk menghadapi pengingkaran mereka ini, Allah memerintahkan kepada Nabi Muhammad untuk menjawabnya dengan mengatakan, \"Cukuplah Allah menjadi saksi dalam pertikaian yang terjadi antara kita seputar kerasulanku. Orang-orang yang mempunyai ilmu tentang Al-Kitab dari kalanganmu yang telah masuk Islam dapat menjadi saksi tentang kebenaran kerasulanku.\"\n\nSesuai dengan penegasan Allah dalam ayat yang lalu bahwa tugas pokok Nabi Muhammad adalah menyampaikan agama Islam kepada manusia. Beliau tidak perlu gelisah menghadapi sikap ingkar dari kaum kafir tersebut, sebab Allahlah yang mengangkat dan mengutusnya menjadi rasul.\n\nPara ulama ahlul kitab memilih menganut agama Islam karena telah mengetahui bahwa dalam kitab Injil dan Taurat yang diwahyukan Allah kepada Nabi Isa dan Nabi Musa telah ada keterangan yang jelas tentang kedatangan nabi dan rasul terakhir, yaitu Muhammad saw. Oleh karena itu, mereka sama sekali tidak mengingkari kerasulan beliau."
                    }
                }
            }
        ]
    }
}
