{
    "code": 200,
    "status": "OK.",
    "message": "Success fetching surah.",
    "data": {
        "number": 38,
        "sequence": 38,
        "numberOfVerses": 88,
        "name": {
            "short": "ص",
            "long": "سورة ص",
            "transliteration": {
                "en": "Saad",
                "id": "Sad"
            },
            "translation": {
                "en": "The letter Saad",
                "id": "Sad"
            }
        },
        "revelation": {
            "arab": "مكة",
            "en": "Meccan",
            "id": "Makkiyyah"
        },
        "tafsir": {
            "id": "Surat Shaad  terdiri atas  88 ayat  termasuk golongan  surat Makkiyyah, diturunkan sesudah surat Al Qamar. Dinamai  dengan  Shaad  karena surat  ini  dimulai  dengan Shaad (selanjutnya lihat no. [10)). Dalam surat  ini Allah  bersumpah dengan  Al Quran,   untuk menunjukkan bahwa Al Quran itu suatu  kitab yang  agung dan bahwa siapa saja yang  mengikutinya  akan mendapat  kebahagiaan  dunia  dan akhirat dan untuk menunjukkan bahwa Al Quran ini adalah mukjizat Nabi Muhammad s.a.w. yang  menyatakan kebenarannya dan ketinggian akhlaknya."
        },
        "preBismillah": {
            "text": {
                "arab": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
                "transliteration": {
                    "en": "Bismillaahir Rahmaanir Raheem"
                }
            },
            "translation": {
                "en": "In the name of Allah, the Entirely Merciful, the Especially Merciful.",
                "id": "Dengan nama Allah Yang Maha Pengasih, Maha Penyayang."
            },
            "audio": {
                "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1",
                "secondary": [
                    "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1.mp3",
                    "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1.mp3"
                ]
            }
        },
        "verses": [
            {
                "number": {
                    "inQuran": 3971,
                    "inSurah": 1
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "ص ۚ وَالْقُرْآنِ ذِي الذِّكْرِ",
                    "transliteration": {
                        "en": "Saaad; wal-Qur-aani ziz zikr"
                    }
                },
                "translation": {
                    "en": "Sad. By the Qur'an containing reminder...",
                    "id": "Shad, demi Al-Qur'an yang mengandung peringatan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3971",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3971.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3971.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Pada ayat terakhir Surah as-Sàffàt Allah menjelaskan perjuangan Rasulullah dan sahabat dalam menegakkan ajaran tauhid. Meski mendapat tantangan besar, tetapi dengan kesabaran dan kegigihan mereka akhirnya memperoleh kemenangan. Tema itu dilanjutkan dengan pembicaraan pada awal surah ini yang menegaskan bahwa upaya orang kafir menghalangi tersebarnya ajaran tauhid pasti berakhir dengan kehancuran. Allah memulai surah ini dengan fawatih as-suwar \"Sad\" untuk menarik perhatian lawan bicara supaya memperhatikan dengan seksama pesan-pesan yang akan disampaikan. Demi Al-Qur'an yang mengandung peringatan, memiliki kedudukan yang mulia, dan mengandung hukum-hukum yang sempurna.",
                        "long": "Allah memulai firman-Nya dengan Fawatih as-Suwar \"shad.\", seperti halnya Dia memulai beberapa surah yang diturunkan di Mekah dan dua buah surah yang diturunkan di Medinah. Mengenai penafsiran Fawatih as-Suwar telah dikemukakan secara luas pada penafsiran ayat yang pertama surah yang kedua (al-Baqarah dalam Al-Qur'an dan Tafsirnya Jilid 1). \n\nKemudian Allah bersumpah dengan Al-Qur'an yang mempunyai keagungan isinya, kemuliaan martabatnya serta kesempurnaan hukumnya yang mengagungkan dan menakjubkan.\n\nAl-Qur'an disifati dengan \"yang mempunyai keagungan\" agar manusia memahami bahwa Al-Qur'an yang diturunkan kepada rasul-Nya itu benar-benar dari Allah, dan mengandung ajaran yang benar yang disampaikan oleh Rasulullah kepada seluruh manusia."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3972,
                    "inSurah": 2
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "بَلِ الَّذِينَ كَفَرُوا فِي عِزَّةٍ وَشِقَاقٍ",
                    "transliteration": {
                        "en": "Balil lazeena kafaroo fee 'izzatilnw wa shiqaaq"
                    }
                },
                "translation": {
                    "en": "But those who disbelieve are in pride and dissension.",
                    "id": "Tetapi orang-orang yang kafir (berada) dalam kesombongan dan permusuhan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3972",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3972.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3972.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sekalipun mengetahui kedudukan Al-Qur’an, tetapi orang-orang yang kafir tetap dalam kesombongan mereka dengan mengingkari wahyu dan menampakkan permusuhan terhadap Rasulullah dan ajaran yang disampaikannya. Mereka berbuat demikian salah satunya karena mereka menialai ajaran Nabi mengancam eksistensi agama nenek moyang mereka dan patung sesembahan mereka.",
                        "long": "Allah mengungkapkan keadaan orang-orang kafir Mekah yang mengingkari kebenaran wahyu, dan tidak dapat melihat nilai-nilai kebenarannya, yang sebenarnya sangat penting bagi kesejahteraan mereka di dunia dan kebahagiaan di akhirat, karena kesombongan dan permusuhan yang bersarang dalam jiwa mereka.\n\nKesombongan mereka tampak pada tindakan mereka terhadap Rasul dan para pengikutnya. Mereka sangat merendahkan kaum Muslimin karena merasa lebih kuat dan lebih banyak hartanya. Sedangkan kaum Muslimin terdiri dari orang-orang miskin dan berjumlah sedikit.\n\nPermusuhan yang sengit itu disebabkan karena ajaran yang dibawa oleh Rasul itu mengancam agama nenek moyang mereka, dan menghinakan patung-patung yang mereka jadikan sembahan-sembahan di samping Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3973,
                    "inSurah": 3
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "كَمْ أَهْلَكْنَا مِن قَبْلِهِم مِّن قَرْنٍ فَنَادَوا وَّلَاتَ حِينَ مَنَاصٍ",
                    "transliteration": {
                        "en": "Kam ahlaknaa min qablihim min qarnin fanaadaw wa laata heena manaas"
                    }
                },
                "translation": {
                    "en": "How many a generation have We destroyed before them, and they [then] called out; but it was not a time for escape.",
                    "id": "Betapa banyak umat sebelum mereka yang telah Kami binasakan, lalu mereka meminta tolong padahal (waktu itu) bukanlah saat untuk lari melepaskan diri."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3973",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3973.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3973.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kami telah mengingatkan melalui Nabi Muhammad betapa banyak umat sebelum mereka yang telah Kami binasakan akibat kesombongan dan keingkaran terhadap utusan Allah, lalu mereka meminta tolong pada saat azab itu datang, padahal waktu itu bukanlah saat yang tepat untuk meminta pertolongan dan mereka tidak bisa lari melepaskan diri dari siksa itu (Lihat pula: Surah Gàfir/40: 84).",
                        "long": "Allah mengecam kesombongan dan permusuhan mereka dengan menjelaskan bahwa betapa banyak umat sebelum mereka, yang menghina dan mengingkari rasul-rasul Allah, dibinasakan-Nya. Ketika azab itu ditimpakan, mereka meminta pertolongan kepada Allah. Namun permintaan itu tidak berguna lagi, dan mereka tidak akan dapat melepaskan diri dari siksa yang membinasakan.\n\nAllah berfirman:\n\nMaka ketika mereka melihat azab Kami, mereka berkata, \"Kami hanya beriman kepada Allah saja dan kami ingkar kepada sembahan-sembahan yang telah kami persekutukan dengan Allah.\" (al-Mu'min/40: 84)\n\nDan firman-Nya:\n\nMaka ketika mereka merasakan azab Kami, tiba-tiba mereka melarikan diri dari (negerinya) itu. Janganlah kamu lari tergesa-gesa; kembalilah kamu kepada kesenangan hidupmu dan tempat-tempat kediamanmu (yang baik), agar kamu dapat ditanya. (al-Anbiya'/21: 12-13)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3974,
                    "inSurah": 4
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَعَجِبُوا أَن جَاءَهُم مُّنذِرٌ مِّنْهُمْ ۖ وَقَالَ الْكَافِرُونَ هَٰذَا سَاحِرٌ كَذَّابٌ",
                    "transliteration": {
                        "en": "Wa 'ajibooo an jaaa'a hum munzirum minhum wa qaalal kaafiroona haazaa saahirun kazzaab"
                    }
                },
                "translation": {
                    "en": "And they wonder that there has come to them a warner from among themselves. And the disbelievers say, \"This is a magician and a liar.",
                    "id": "Dan mereka heran karena mereka kedatangan seorang pemberi peringatan (rasul) dari kalangan mereka; dan orang-orang kafir berkata, “Orang ini adalah pesihir yang banyak berdusta.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3974",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3974.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3974.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kami utus Nabi Muhammad kepada penduduk Mekah dan mereka yang ingkar merasa heran karena mereka kedatangan seorang rasul pemberi peringatan yang tidak lain berasal dari kalangan mereka sendiri; dan karena keingkaran yang begitu dalam kepada Rasulullah, orang-orang kafir berkata, “Orang ini adalah penyihir yang banyak berdusta.” Mereka berkata demikian karena apa yang disampaikan oleh Nabi tidak sesuai dengan apa yang mereka inginkan.",
                        "long": "Ayat ini mengungkapkan keadaan orang-orang kafir Mekah yang sangat heran ketika nabi yang datang kepada mereka ternyata manusia biasa dari kalangan mereka juga. Menurut mereka, Muhammad yang mengaku dirinya diangkat menjadi rasul itu tidak mempunyai keistimewaan, baik keistimewaan jasmani maupun rohani, padahal kedudukan rasul itu tinggi. Dengan demikian, tidak mungkin Muhammad menduduki kedudukan yang tinggi. Itulah sebabnya maka mereka mengatakan bahwa Muhammad hanyalah tukang sihir. Dia penipu dan pendusta. Apa yang disampaikan baik berupa perintah atau pun larangan yang dikatakan dari Allah adalah dusta. Firman Allah:\n\nPantaskah manusia menjadi heran bahwa Kami memberi wahyu kepada seorang laki-laki di antara mereka, \"Berilah peringatan kepada manusia dan gembirakanlah orang-orang beriman bahwa mereka mempunyai kedudukan yang tinggi di sisi Tuhan.\" Orang-orang kafir berkata, \"Orang ini (Muhammad) benar-benar pesihir.\" (Yunus/10: 2)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3975,
                    "inSurah": 5
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَجَعَلَ الْآلِهَةَ إِلَٰهًا وَاحِدًا ۖ إِنَّ هَٰذَا لَشَيْءٌ عُجَابٌ",
                    "transliteration": {
                        "en": "Aja'alal aalihata Ilaahanw Waahidan inna haazaa lashai'un 'ujaab"
                    }
                },
                "translation": {
                    "en": "Has he made the gods [only] one God? Indeed, this is a curious thing.\"",
                    "id": "Apakah dia menjadikan tuhan-tuhan itu Tuhan yang satu saja? Sungguh, ini benar-benar sesuatu yang sangat mengherankan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3975",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3975.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3975.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ketika Nabi mengajak mereka menyembah dan mengesakan Allah, mereka menjawab dengan penuh keingkaran, “Apakah dia menjadikan tuhan-tuhan itu Tuhan yang satu saja? Sungguh, ini benar-benar sesuatu yang sangat mengherankan. Kami, kabilah-kabilah Arab, mempunyai tuhan masing-masing.”",
                        "long": "Sebab nuzul ayat ini sebagaimana diriwayatkan oleh Ibnu Jarir. ath-thabari dari Ibnu 'Abbas yang menyatakan bahwa setelah Abu thalib sakit, masuklah serombongan orang-orang Quraisy, di antara mereka terdapat Abu Jahal. Mereka berkata, \"Sesungguhnya kemenakanmu mencaci-maki tuhan-tuhan kami. Ia betul-betul berbuat dan mengatakannya. Alangkah baiknya kalau engkau mengutus seseorang untuk melarangnya.\" Maka Abu thalib pun mengutus utusan kepadanya. Lalu Nabi pun datang dan masuk ke rumahnya, sedangkan jarak antara orang-orang Quraisy dengan Abu thalib dekat sekali sekadar tempat duduk yang cukup untuk seorang. Ibnu 'Abbas mengatakan bahwa Abu Jahal khawatir kalau-kalau Nabi duduk di samping Abu thalib. Lalu ia menjadi bersikap lunak. Ia lalu melompat dan duduk di tempat yang belum diduduki di sisi Abu thalib. Dengan demikian Rasulullah tidak mendapatkan tempat duduk di dekat pamannya. Beliau duduk di dekat pintu. Lalu Abu thalib berkata kepada beliau, \"Hai kemenakanku, mengapa kaummu mengadukan engkau. Mereka menuduh engkau memaki tuhan-tuhan mereka dan engkau pun mengatakan begini-begitu.\" Ibnu 'Abbas melanjutkan bahwa orang-orang Quraisy banyak sekali berbicara dengan Abu thalib. \n\nKemudian Rasulullah berkata, \"Hai Pamanku. Sesungguhnya saya ingin agar mereka itu menyatakan kalimat yang satu saja, yang dengan kalimat itu orang-orang Arab tunduk kepada mereka, dan orang-orang 'Ajam (selain Arab) membayar jizyah (pajak kepala) kepada mereka.\" Maka mereka pun senang akan kalimat (yang diusulkan itu) dan senang pula akan perkataan Rasul. Lalu kaum Quraisy itu bertanya, \"Apakah kalimat itu? Demi Ayahmu, tentu kami memberi balasan kepadamu sepuluh kali lipat.\" Rasulullah pun bersabda, \"La ilaha ilallah.\" Maka mereka pun bangkit dengan gemetar, sambil menyingsingkan lengan bajunya dan berkata, \"Mengapa ia menjadikan tuhan-tuhan itu Tuhan Yang Satu saja, sesungguhnya ini benar-benar suatu hal yang mengherankan.\" Maka turunlah ayat ini.\n\nAllah menjelaskan keheranan kaum musyrik akan seruan rasul. Mereka heran mengapa Muhammad menjadikan Tuhan hanya satu saja, ini bertentangan dengan kepercayaan nenek moyang mereka. Ketika Rasulullah mengajak mereka agar meninggalkan sembahan-sembahan mereka yang banyak itu dan menggantinya dengan menyembah Allah Yang Maha Esa, maka mereka menganggap bahwa seruan Muhammad itu bukan masalah yang remeh, akan tetapi benar-benar suatu yang mengherankan. Mereka mengingkari seruan itu karena yakin bahwa tidak mungkin nenek moyang mereka menganut keyakinan yang salah, tetapi Muhammad adalah seorang pendusta yang mengaku dirinya benar."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3976,
                    "inSurah": 6
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَانطَلَقَ الْمَلَأُ مِنْهُمْ أَنِ امْشُوا وَاصْبِرُوا عَلَىٰ آلِهَتِكُمْ ۖ إِنَّ هَٰذَا لَشَيْءٌ يُرَادُ",
                    "transliteration": {
                        "en": "Wantalaqal mala-u minhum anim shoo wasbiroo 'alaaa aalihatikum innna haazaa lashai 'uny yuraad"
                    }
                },
                "translation": {
                    "en": "And the eminent among them went forth, [saying], \"Continue, and be patient over [the defense of] your gods. Indeed, this is a thing intended.",
                    "id": "Lalu pergilah pemimpin-pemimpin mereka (seraya berkata), “Pergilah kamu dan tetaplah  (menyembah) tuhan-tuhanmu, sesungguhnya ini benar-benar suatu hal yang dikehendaki."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3976",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3976.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3976.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Mendengar ajakan Nabi untuk beratuhid, lalu pergilah pemimpin-pemimpin mereka menghampiri kaum masing-masing seraya berkata, “Pergilah kamu dan tetaplah menyembah tuhan-tuhanmu sendiri. Sesungguhnya ajakan bertauhid ini benar-benar hanyalah suatu hal yang dikehendaki oleh Muhammad terhadap kita agar dia bisa menjadi pemimpin.",
                        "long": "Pada ayat ini, Allah menjelaskan bahwa pemimpin-pemimpin Quraisy itu pergi dari rumah Abu thalib setelah terbungkam oleh jawaban Rasul, sebagaimana dijelaskan dalam sebab nuzul di atas. Mereka mengetahui Muhammad berkeras hati membela agama. Itulah sebabnya mereka tidak mempunyai harapan lagi untuk melunakkan hati Muhammad dengan perantaraan pamannya. Mereka berunding apa yang seharusnya dilakukan, dan memeras otak untuk mendapatkan penyelesaian. Akhirnya mereka memutuskan untuk memperkokoh keyakinan pengikut-pengikutnya untuk tetap dengan keyakinan mereka dan tetap menyembah tuhan-tuhan mereka.\n\nDi akhir ayat, Allah mengungkapkan perkataan para pemimpin Quraisy itu kepada pengikut-pengikutnya, bahwa menyembah berhala-berhala itulah yang sebenarnya dikehendaki oleh Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3977,
                    "inSurah": 7
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مَا سَمِعْنَا بِهَٰذَا فِي الْمِلَّةِ الْآخِرَةِ إِنْ هَٰذَا إِلَّا اخْتِلَاقٌ",
                    "transliteration": {
                        "en": "Maa sami'naa bihaazaa fil millatil aakhirati in haazaaa illakh tilaaq"
                    }
                },
                "translation": {
                    "en": "We have not heard of this in the latest religion. This is not but a fabrication.",
                    "id": "Kami tidak pernah mendengar hal ini dalam agama yang terakhir; ini (mengesakan Allah), tidak lain hanyalah (dusta) yang diada-adakan,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3977",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3977.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3977.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kami tidak pernah mendengar hal ini dalam agama yang terakhir, yaitu Nasrani, yang meyakini ajaran trinitas. Ajaran tauhid ini tidak lain hanyalah kedustaan yang diada-adakan oleh Muhammad.",
                        "long": "Allah menjelaskan alasan lain yang dikemukakan oleh para pemimpin Quraisy kepada pengikut-pengikutnya, bahwa seruan Muhammad saw itu tidak benar. Mereka mengatakan bahwa mereka tidak pernah mendengar seruan seperti yang diserukan oleh Muhammad itu di dalam agama yang diturunkan terakhir. Agama yang mereka maksudkan adalah agama Nasrani. Seruan Muhammad agar manusia mengesakan Tuhan itu hanyalah dusta yang dibuat-buat oleh Muhammad saw dan bukan datang dari Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3978,
                    "inSurah": 8
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَأُنزِلَ عَلَيْهِ الذِّكْرُ مِن بَيْنِنَا ۚ بَلْ هُمْ فِي شَكٍّ مِّن ذِكْرِي ۖ بَل لَّمَّا يَذُوقُوا عَذَابِ",
                    "transliteration": {
                        "en": "'A-unzila 'alaihiz zikru mim baininaa; bal hum fee shakkim min Zikree bal lammaa yazooqoo 'azaab"
                    }
                },
                "translation": {
                    "en": "Has the message been revealed to him out of [all of] us?\" Rather, they are in doubt about My message. Rather, they have not yet tasted My punishment.",
                    "id": "mengapa Al-Qur'an itu diturunkan kepada dia di antara kita?” Sebenarnya mereka ragu-ragu terhadap Al-Qur'an-Ku, tetapi mereka belum merasakan azab(-Ku)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3978",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3978.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3978.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Mengapa Al-Qur’an itu diturunkan kepada Muhammad padahal dia berasal dari kalangan jelata, bukan kepada orang terpandang di antara kita?” (Lihat pula: Surah az-Zukhruf/43: 31). Allah menegaskan, “Sebenarnya mereka ragu-ragu terhadap Al-Qur’an yang turun dari sisi-Ku karena kedengkian hati mereka, tetapi mereka belum merasakan azab-Ku atas keingkaran mereka. Kelak mereka pasti akan merasakannya.\"",
                        "long": "Kemudian Allah menjelaskan pengingkaran orang-orang kafir Mekah bahwa Muhammad diberi wahyu, padahal dia manusia biasa. Menurut anggapan mereka, yang pantas diangkat menjadi utusan ialah orang yang mempunyai kemuliaan dan kepemimpinan yang melebihi mereka. Muhammad tidak mempunyai sifat-sifat istimewa yang seperti itu, sehingga tidak mungkin Al-Qur'an diturunkan kepadanya. Sedangkan di antara mereka masih ada orang-orang yang lebih mulia, dan lebih pantas memegang kepemimpinan.\n\nAllah berfirman:\n\nDan mereka (juga) berkata, \"Mengapa Al-Qur'an ini tidak diturunkan kepada orang besar (kaya dan berpengaruh) dari salah satu dua negeri ini (Mekah dan Taif)?\" (az-Zukhruf/43: 31)\n\nMereka mengingkari wahyu dan kenabian Muhammad karena menurut jalan pikiran mereka, orang yang diutus menjadi rasul adalah orang yang kaya raya dan berpengaruh. Mereka tidak menyadari bahwa Allah berkuasa menentukan pilihan menurut kehendak-Nya di antaranya mengangkat hamba-Nya menjadi Nabi. \n\nAllah berfirman:\n\nDan mereka berkata, \"Mengapa Rasul (Muhammad) ini memakan makanan dan berjalan di pasar-pasar? Mengapa malaikat tidak diturunkan kepadanya (agar malaikat) itu memberikan peringatan bersama dia, atau (mengapa tidak) diturunkan kepadanya harta kekayaan atau (mengapa tidak ada) kebun baginya, sehingga dia dapat makan dari (hasil)nya?\" Dan orang-orang zalim itu berkata, \"Kamu hanyalah mengikuti seorang laki-laki yang kena sihir.\" (al-Furqan/25: 7-8)\n\nDi bagian akhir, ayat ini menjelaskan bahwa penyebab mereka jauh dari kebenaran adalah karena hati mereka diselubungi keraguan yang tidak bisa ditembus oleh cahaya kebenaran Al-Qur'an, dan mereka belum merasakan siksa Allah yang pedih. Seandainya mereka mau memperhatikan tanda-tanda kebenaran wahyu yang diturunkan kepada rasul-Nya, niscaya mereka mengakui kenabiannya, karena wahyu yang diterima itu telah cukup menjadi tanda kenabiannya. Namun demikian, karena penyakit hasad dan dengki yang telah bersarang dalam dadanya, maka mereka tidak mau menerima wahyu itu. Akhirnya mereka terjerumus dalam lembah keingkaran."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3979,
                    "inSurah": 9
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمْ عِندَهُمْ خَزَائِنُ رَحْمَةِ رَبِّكَ الْعَزِيزِ الْوَهَّابِ",
                    "transliteration": {
                        "en": "Am'indahum khazaaa 'inu rahmati Rabbikal 'Azeezil Wahhab"
                    }
                },
                "translation": {
                    "en": "Or do they have the depositories of the mercy of your Lord, the Exalted in Might, the Bestower?",
                    "id": "Atau apakah mereka itu mempunyai perbendaharaan rahmat Tuhanmu Yang Mahaperkasa, Maha Pemberi?]"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3979",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3979.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3979.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "\"Atau apakah mereka yang kafir itu ingkar karena mempunyai perbendaharaan rahmat Tuhanmu Yang Mahaperkasa lagi Maha Pemberi sehingga merasa punya kekuatan untuk ikut menentukan kehendak Allah?\" (Lihat pula: Surah al-An‘àm/6: 124).",
                        "long": "Pada ayat ini, Allah mengecam orang-orang Quraisy yang menolak kenabian Muhammad karena beliau bukan orang terpandang di kalangan mereka. Allah memerintahkan kepada Rasul-Nya agar menanyakan apakah mereka memiliki kekuasaan ikut menentukan dan membagi-bagi khazanah rahmat Allah.\n\nDi akhir ayat, Allah menyebutkan sifat-Nya Yang Mahaperkasa dan Maha Pemberi. Kemahaperkasaan yang tidak bisa ditandingi oleh siapa pun juga dan sifat Mahapemberi yang tidak bisa dihalang-halangi oleh kekuasaan yang lain.\n\nAllah berfirman:\n\nDan Tuhanmu menciptakan dan memilih apa yang Dia kehendaki. Bagi mereka (manusia) tidak ada pilihan. (al-Qashash/28: 68)\n\nDan firman-Nya:\n\n¦Allah lebih mengetahui di mana Dia menempatkan tugas kerasulan-Nya¦. (al-An'am/6: 124)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3980,
                    "inSurah": 10
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمْ لَهُم مُّلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا ۖ فَلْيَرْتَقُوا فِي الْأَسْبَابِ",
                    "transliteration": {
                        "en": "Am lahum mulkus samaawaati wal ardi wa maa bainahumaa falyartaqoo fil asbaab"
                    }
                },
                "translation": {
                    "en": "Or is theirs the dominion of the heavens and the earth and what is between them? Then let them ascend through [any] ways of access.",
                    "id": "Atau apakah mereka mempunyai kerajaan langit dan bumi dan apa yang ada di antara keduanya? (Jika ada), maka biarlah mereka menaiki tangga-tangga (ke langit)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3980",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3980.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3980.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "\"Atau apakah mereka mendustakan Nabi Muhammad karena merasa mempunyai kerajaan dan kekuasaan di langit dan bumi dan apa yang ada di antara keduanya? Jika tidak, semestinya mereka tidak mencampuri urusan Allah dalam menentukan seseorang menjadi rasul karena Dialah yang memiliki wewenang mutlak untuk itu. Jika tetap ingkar maka biarlah mereka menaiki tangga-tangga menuju langit guna menghalangi turunnya wahyu Kami kepada Rasulullah.\"",
                        "long": "Kemudian Allah memerintahkan kepada Rasul-Nya agar menanyakan kepada orang-orang Quraisy atas sikapnya yang ingkar dan sombong. Pertanyaan ini mengandung cemoohan karena memang mereka tidak mempunyai kekuasaan sedikit pun terhadap langit, bumi, dan isi keduanya. Kalau mereka merasa tidak mempunyai kekuasaan sedikit pun di jagat raya, mestinya mereka juga tidak ikut campur tangan dalam pengangkatan rasul, yang termasuk urusan gaib, yang kekuasaannya berada pada yang Mahaperkasa dan Mahaagung.\n\nDi akhir ayat, Allah memerintah Rasul-Nya agar menantang mereka menaiki tangga-tangga ke langit, dan mencari daya upaya agar menghalang-halangi wahyu yang didatangkan kepada rasul pilihan Allah. Sesungguhnya mereka tidak akan mampu melakukannya. Dengan demikian, jelaslah pengingkaran mereka kepada wahyu hanya karena sikap hasad (dengki)."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3981,
                    "inSurah": 11
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "جُندٌ مَّا هُنَالِكَ مَهْزُومٌ مِّنَ الْأَحْزَابِ",
                    "transliteration": {
                        "en": "Jundum maa hunaalika mahzoomum minal Ahzaab"
                    }
                },
                "translation": {
                    "en": "[They are but] soldiers [who will be] defeated there among the companies [of disbelievers].",
                    "id": "(Mereka itu) kelompok besar bala tentara yang berada di sana yang akan dikalahkan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3981",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3981.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3981.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Mereka yang ingkar itu laksana kelompok besar bala tentara yang berada di suatu tempat sana yang akan dikalahkan oleh kelompok kecil yang memiliki keyakinan kuat dan keteguhan iman. Mereka kalah karena perjuangan mereka tidak didasari keyakinan yang kukuh, melain-kan rasa iri dan kesombongan.",
                        "long": "Pada ayat ini, Allah menjelaskan bahwa keadaan orang-orang musyrik Mekah yang mendustakan kerasulan Muhammad dan mengingkari agama tauhid laksana bala tentara yang besar, yang merupakan gabungan dari kesatuan-kesatuan tentara. Bala tentara yang bersekutu bergerak untuk menghancurkan kaum Muslimin itu pasti dapat dikalahkan, karena landasan perjuangan mereka tidak didasarkan pada keyakinan yang kokoh, akan tetapi hanyalah karena hasad dan sombong.\n\nPeristiwa seperti digambarkan dalam ayat ini bukanlah terjadi pada saat diturunkannya ayat, karena pada saat itu kaum Muslimin belum mempunyai tentara, jumlah pengikutnya pun masih sedikit, dan belum ada tanda-tanda untuk menyusun kekuatan yang dapat mengalahkan bala tentara gabungan seperti digambarkan dalam ayat. Akan tetapi, peristiwa itu baru terjadi pada saat terjadinya perang Badar, dimana kaum musyrikin yang jumlahnya berlipat ganda melebihi kaum Muslimin dapat dikalahkan atas bantuan Allah. Firman Allah:\n\nAtau mereka mengatakan, \"Kami ini golongan yang bersatu yang pasti menang.\" Golongan itu pasti akan dikalahkan dan mereka akan mundur ke belakang. Bahkan hari Kiamat itulah hari yang dijanjikan kepada mereka dan hari Kiamat itu lebih dahsyat dan lebih pahit. (al-Qamar/54: 44-46)\n\nPenjelasan yang diberikan Allah kepada Rasul-Nya yang terdapat dalam ayat ini termasuk salah satu di antara mukjizat Nabi dan sekaligus sebagai tanda kebenaran wahyu yang diterimanya bahwa wahyu itu benar-benar dari Allah bukan buatan Muhammad."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3982,
                    "inSurah": 12
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "كَذَّبَتْ قَبْلَهُمْ قَوْمُ نُوحٍ وَعَادٌ وَفِرْعَوْنُ ذُو الْأَوْتَادِ",
                    "transliteration": {
                        "en": "Kazzabat qablahum qawmu Lootinw-wa 'Aadunw wa Fir'awnu zul awtaad"
                    }
                },
                "translation": {
                    "en": "The people of Noah denied before them, and [the tribe of] 'Aad and Pharaoh, the owner of stakes,",
                    "id": "Sebelum mereka itu, kaum Nuh, ‘Ad dan Fir’aun yang mempunyai bala tentara yang banyak, juga telah mendustakan (rasul-rasul),"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3982",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3982.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3982.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kebenaran pasti akan menang melawan kebatilan, dan hal itu terbukti dengan hancurnya para penentang nabi-nabi terdahulu. Bila kaum musyrik Mekah mendustakan Nabi Muhammad maka sebelum mereka itu kaum Nabi Nuh, ‘Ad, dan Fir’aun yang mempunyai bala tentara yang banyak juga telah mendustakan rasul-rasul Allah. Musuh Nabi Nuh dihancurkan dengan banjir besar, kaum ‘Ad dengan angin kencang, dan Fir’aun ditenggelamkan di laut Merah.",
                        "long": "Pada kedua ayat ini, Allah menjelaskan enam kaum yang mendustakan rasul-rasul Allah, serta akibat yang mereka derita, dengan maksud agar menjadi pelajaran bagi kaum musyrik Mekah, sehingga mereka terlepas dari kesesatan, dan mau menerima tuntunan hidayah. Mereka itu adalah:\n\nPertama, kaum Nuh yang menuduh Nabi Nuh telah memberikan nasihat dan peringatan yang dibuat-buat. Oleh karena itu, mereka memperolok-olok, bahkan mengatakan bahwa Nabi Nuh gila. Meskipun Nabi Nuh telah berulang kali menyeru kepada mereka dengan lemah-lembut agar mereka beragama tauhid tetapi tantangan mereka tidak berkurang juga, bahkan bertambah-tambah, akhirnya Nabi Nuh berdoa kepada Allah.\n\nFirman Allah:\n\nDan Nuh berkata, \"Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi. Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka hanya akan melahirkan anak-anak yang jahat dan tidak tahu bersyukur. (Nuh/71: 26-27)\n\nKaum Nuh tetap mendustakan seruannya, bahkan tenggelam dalam kesesatan. Allah membinasakan mereka dengan perantaraan badai, topan, dan banjir sebagai balasan dari kejahatan yang mereka lakukan. Akan tetapi, Nuh dan pengikut-pengikutnya diselamatkan Allah dari siksaan itu.\n\nAllah berfirman:\n\nLalu Kami bukakan pintu-pintu langit dengan (menurunkan) air yang tercurah, dan Kami jadikan bumi menyemburkan mata-mata air maka bertemulah (air-air) itu sehingga (meluap menimbulkan) keadaan (bencana) yang telah ditetapkan. Dan Kami angkut dia (Nuh) ke atas (kapal) yang terbuat dari papan dan pasak, yang berlayar dengan pemeliharaan (pengawasan) Kami sebagai balasan bagi orang yang telah diingkari (kaumnya). (al-Qamar/54: 11-14)\n\nKedua, kaum 'Ad yang mendustakan seruan Hud yang mengajak mereka menyembah Allah Yang Maha Esa dan meninggalkan sembahan-sembahan yang mereka persekutukan dengan Allah. Akan tetapi, kaum 'Ad menentang seruan itu, bahkan mereka memperolok-olokkan Hud dan mengatakannya gila. Itulah sebabnya mereka dibinasakan dengan angin yang sangat dingin lagi kencang.\n\nAllah berfirman:\n\nSedangkan kaum 'Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin, Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus-menerus; maka kamu melihat kaum 'Ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong (lapuk). Maka adakah kamu melihat seorang pun yang masih tersisa di antara mereka? (al-haqqah/69: 6-8)\n\nKetiga, Fir'aun yang mempunyai tentara yang besar. Di samping itu, ia mempunyai tempat penyiksaan khusus guna menyiksa musuh-musuhnya dan bangunan yang tinggi dan kokoh. Allah telah mengutus Musa kepada Fir'aun dan para pengikutnya agar menghentikan kesesatannya dan menyembah Allah Yang Maha Esa. Kebenaran seruan Musa itu dikuatkan pula dengan mukjizat. Akan tetapi Fir'aun dan para pengikutnya tetap berkeras hati menolak seruan Musa, bahkan bersikap sombong dan menghinanya dengan menyatakan bahwa dialah tuhan yang maha tinggi. Maka Allah memerintahkan Musa untuk mengungsikan kaumnya agar selamat dari kekejaman Fir'aun. Dengan begitu, selamatlah Musa dan kaum Bani Israil dari pengejaran Fir'aun sedang dia dengan bala tentaranya tenggelam ditelan gelombang laut.\n\nAllah berfirman:\n\nDan Kami selamatkan Bani Israil melintasi laut, kemudian Fir'aun dan bala tentaranya mengikuti mereka, untuk menzalimi dan menindas (mereka). Sehingga ketika Fir'aun hampir tenggelam dia berkata, \"Aku percaya bahwa tidak ada tuhan melainkan Tuhan yang dipercayai oleh Bani Israil, dan aku termasuk orang-orang Muslim (berserah diri).\" Mengapa baru sekarang (kamu beriman), padahal sesungguhnya engkau telah durhaka sejak dahulu, dan engkau termasuk orang yang berbuat kerusakan. Maka pada hari ini Kami selamatkan jasadmu agar engkau dapat menjadi pelajaran bagi orang-orang yang datang setelahmu, tetapi kebanyakan manusia tidak mengindahkan tanda-tanda (kekuasaan) Kami. (Yunus/10: 90-92)\n\nMakna autad yang lain adalah pasung-pasung yang digunakan Fir'aun untuk menyiksa. Ada juga yang mengatakan bahwa Fir'aun mempunyai istana yang megah dan kokoh.\n\nKeempat, kaum Samud yang mendustakan seruan Nabi Saleh yang diutus untuk mereka. Mereka telah berbuat kesalahan yang melampaui batas. Mereka telah menyembelih unta yang seharus dipelihara. Sebagai balasan atas kedurhakaan mereka, Allah telah menimpakan suara keras yang mengguntur, hingga mereka musnah seperti rumput-rumput kering.\n\nAllah berfirman:\n\nKaum samud pun telah mendustakan peringatan itu. Maka mereka berkata, \"Bagaimana kita akan mengikuti seorang manusia (biasa) di antara kita? Sungguh, kalau begitu kita benar-benar telah sesat dan gila. Apakah wahyu itu diturunkan kepadanya di antara kita? Pastilah dia (Saleh) seorang yang sangat pendusta (dan) sombong.\" Kelak mereka akan mengetahui siapa yang sebenarnya sangat pendusta (dan) sombong itu. Sesungguhnya Kami akan mengirimkan unta betina sebagai cobaan bagi mereka, maka tunggulah mereka dan bersabarlah (Saleh). Dan beritahukanlah kepada mereka bahwa air itu dibagi di antara mereka (dengan unta betina itu); setiap orang berhak mendapat giliran minum. Maka mereka memanggil kawannya, lalu dia menangkap (unta itu) dan memotongnya. Maka betapa dahsyatnya azab-Ku dan peringatan-Ku! Kami kirimkan atas mereka satu suara yang keras mengguntur, maka jadilah mereka seperti batang-batang kering yang lapuk. (al-Qamar/54: 23-31)\n\nKelima, Nabi Lut juga didustakan kaumnya. Berulang kali dia memperingatkan kaumnya agar bertakwa kepada Allah dan meninggalkan perbuatan keji, melakukan homoseksual, namun mereka tetap tidak menghiraukannya. Allah lalu memerintahkan Lut dan keluarganya meninggalkan Sodom karena mereka akan diazab dengan siksa yang membinasakan.\n\nAllah berfirman:\n\nKaum Lut pun telah mendustakan peringatan itu. Sesungguhnya Kami kirimkan kepada mereka badai yang membawa batu-batu (yang menimpa mereka), kecuali keluarga Lut. Kami selamatkan mereka sebelum fajar menyingsing. (al-Qamar/54: 33-34)\n\nKeenam, A.shhabul Aikah, yang merupakan kaum Nabi Syuaib, juga mendustakan nabinya. Nabi Syuaib mengajak mereka agar menyembah Allah Yang Maha Esa, melarang mempersekutukan-Nya, dan tidak mengurangi timbangan. Akan tetapi, kaumnya bukan saja menolak seruan itu, bahkan mereka bersekutu menentangnya. Itulah sebabnya mereka dibinasakan dengan kilat yang menyambar mereka dalam keadaan gelap gulita.\n\nAllah berfirman:\n\nMaka jatuhkanlah kepada kami gumpalan dari langit, jika engkau termasuk orang-orang yang benar.\" Dia (Syuaib) berkata, \"Tuhanku lebih mengetahui apa yang kamu kerjakan.\" Kemudian mereka mendustakannya (Syuaib), lalu mereka ditimpa azab pada hari yang gelap. Sungguh, itulah azab pada hari yang dahsyat. (asy-Syu'ara'/26: 187-189)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3983,
                    "inSurah": 13
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَثَمُودُ وَقَوْمُ لُوطٍ وَأَصْحَابُ الْأَيْكَةِ ۚ أُولَٰئِكَ الْأَحْزَابُ",
                    "transliteration": {
                        "en": "Wa Samoodu wa qawmu Lootinw wa Ashaabul 'Aykah; ulaaa'ikal Ahzaab"
                    }
                },
                "translation": {
                    "en": "And [the tribe of] Thamud and the people of Lot and the companions of the thicket. Those are the companies.",
                    "id": "dan (begitu juga) Samud, kaum Lut dan penduduk Aikah. Mereka itulah golongan-golongan yang bersekutu (menentang rasul-rasul)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3983",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3983.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3983.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan seperti halnya kaum Nabi Nuh, ‘Ad, dan Fir’aun, kaum Samud, kaum Nabi Lut, dan penduduk Aikah, yakni kaum Nabi Syuaib, pun mendustakan para rasul mereka. Kaum Samud dihancurkan dengan suara menggelegar, kaum Nabi Lut dengan hujan batu, dan penduduk Aikah dengan kilat yang menyambar. Mereka itulah golongan-golongan yang bersekutu dalam menyembah berhala dan berbuat kejahatan.",
                        "long": "Pada kedua ayat ini, Allah menjelaskan enam kaum yang mendustakan rasul-rasul Allah, serta akibat yang mereka derita, dengan maksud agar menjadi pelajaran bagi kaum musyrik Mekah, sehingga mereka terlepas dari kesesatan, dan mau menerima tuntunan hidayah. Mereka itu adalah:\n\nPertama, kaum Nuh yang menuduh Nabi Nuh telah memberikan nasihat dan peringatan yang dibuat-buat. Oleh karena itu, mereka memperolok-olok, bahkan mengatakan bahwa Nabi Nuh gila. Meskipun Nabi Nuh telah berulang kali menyeru kepada mereka dengan lemah-lembut agar mereka beragama tauhid tetapi tantangan mereka tidak berkurang juga, bahkan bertambah-tambah, akhirnya Nabi Nuh berdoa kepada Allah.\n\nFirman Allah:\n\nDan Nuh berkata, \"Ya Tuhanku, janganlah Engkau biarkan seorang pun di antara orang-orang kafir itu tinggal di atas bumi. Sesungguhnya jika Engkau biarkan mereka tinggal, niscaya mereka akan menyesatkan hamba-hamba-Mu, dan mereka hanya akan melahirkan anak-anak yang jahat dan tidak tahu bersyukur. (Nuh/71: 26-27)\n\nKaum Nuh tetap mendustakan seruannya, bahkan tenggelam dalam kesesatan. Allah membinasakan mereka dengan perantaraan badai, topan, dan banjir sebagai balasan dari kejahatan yang mereka lakukan. Akan tetapi, Nuh dan pengikut-pengikutnya diselamatkan Allah dari siksaan itu.\n\nAllah berfirman:\n\nLalu Kami bukakan pintu-pintu langit dengan (menurunkan) air yang tercurah, dan Kami jadikan bumi menyemburkan mata-mata air maka bertemulah (air-air) itu sehingga (meluap menimbulkan) keadaan (bencana) yang telah ditetapkan. Dan Kami angkut dia (Nuh) ke atas (kapal) yang terbuat dari papan dan pasak, yang berlayar dengan pemeliharaan (pengawasan) Kami sebagai balasan bagi orang yang telah diingkari (kaumnya). (al-Qamar/54: 11-14)\n\nKedua, kaum 'Ad yang mendustakan seruan Hud yang mengajak mereka menyembah Allah Yang Maha Esa dan meninggalkan sembahan-sembahan yang mereka persekutukan dengan Allah. Akan tetapi, kaum 'Ad menentang seruan itu, bahkan mereka memperolok-olokkan Hud dan mengatakannya gila. Itulah sebabnya mereka dibinasakan dengan angin yang sangat dingin lagi kencang.\n\nAllah berfirman:\n\nSedangkan kaum 'Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin, Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus-menerus; maka kamu melihat kaum 'Ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong (lapuk). Maka adakah kamu melihat seorang pun yang masih tersisa di antara mereka? (al-haqqah/69: 6-8)\n\nKetiga, Fir'aun yang mempunyai tentara yang besar. Di samping itu, ia mempunyai tempat penyiksaan khusus guna menyiksa musuh-musuhnya dan bangunan yang tinggi dan kokoh. Allah telah mengutus Musa kepada Fir'aun dan para pengikutnya agar menghentikan kesesatannya dan menyembah Allah Yang Maha Esa. Kebenaran seruan Musa itu dikuatkan pula dengan mukjizat. Akan tetapi Fir'aun dan para pengikutnya tetap berkeras hati menolak seruan Musa, bahkan bersikap sombong dan menghinanya dengan menyatakan bahwa dialah tuhan yang maha tinggi. Maka Allah memerintahkan Musa untuk mengungsikan kaumnya agar selamat dari kekejaman Fir'aun. Dengan begitu, selamatlah Musa dan kaum Bani Israil dari pengejaran Fir'aun sedang dia dengan bala tentaranya tenggelam ditelan gelombang laut.\n\nAllah berfirman:\n\nDan Kami selamatkan Bani Israil melintasi laut, kemudian Fir'aun dan bala tentaranya mengikuti mereka, untuk menzalimi dan menindas (mereka). Sehingga ketika Fir'aun hampir tenggelam dia berkata, \"Aku percaya bahwa tidak ada tuhan melainkan Tuhan yang dipercayai oleh Bani Israil, dan aku termasuk orang-orang Muslim (berserah diri).\" Mengapa baru sekarang (kamu beriman), padahal sesungguhnya engkau telah durhaka sejak dahulu, dan engkau termasuk orang yang berbuat kerusakan. Maka pada hari ini Kami selamatkan jasadmu agar engkau dapat menjadi pelajaran bagi orang-orang yang datang setelahmu, tetapi kebanyakan manusia tidak mengindahkan tanda-tanda (kekuasaan) Kami. (Yunus/10: 90-92)\n\nMakna autad yang lain adalah pasung-pasung yang digunakan Fir'aun untuk menyiksa. Ada juga yang mengatakan bahwa Fir'aun mempunyai istana yang megah dan kokoh.\n\nKeempat, kaum Samud yang mendustakan seruan Nabi Saleh yang diutus untuk mereka. Mereka telah berbuat kesalahan yang melampaui batas. Mereka telah menyembelih unta yang seharus dipelihara. Sebagai balasan atas kedurhakaan mereka, Allah telah menimpakan suara keras yang mengguntur, hingga mereka musnah seperti rumput-rumput kering.\n\nAllah berfirman:\n\nKaum samud pun telah mendustakan peringatan itu. Maka mereka berkata, \"Bagaimana kita akan mengikuti seorang manusia (biasa) di antara kita? Sungguh, kalau begitu kita benar-benar telah sesat dan gila. Apakah wahyu itu diturunkan kepadanya di antara kita? Pastilah dia (Saleh) seorang yang sangat pendusta (dan) sombong.\" Kelak mereka akan mengetahui siapa yang sebenarnya sangat pendusta (dan) sombong itu. Sesungguhnya Kami akan mengirimkan unta betina sebagai cobaan bagi mereka, maka tunggulah mereka dan bersabarlah (Saleh). Dan beritahukanlah kepada mereka bahwa air itu dibagi di antara mereka (dengan unta betina itu); setiap orang berhak mendapat giliran minum. Maka mereka memanggil kawannya, lalu dia menangkap (unta itu) dan memotongnya. Maka betapa dahsyatnya azab-Ku dan peringatan-Ku! Kami kirimkan atas mereka satu suara yang keras mengguntur, maka jadilah mereka seperti batang-batang kering yang lapuk. (al-Qamar/54: 23-31)\n\nKelima, Nabi Lut juga didustakan kaumnya. Berulang kali dia memperingatkan kaumnya agar bertakwa kepada Allah dan meninggalkan perbuatan keji, melakukan homoseksual, namun mereka tetap tidak menghiraukannya. Allah lalu memerintahkan Lut dan keluarganya meninggalkan Sodom karena mereka akan diazab dengan siksa yang membinasakan.\n\nAllah berfirman:\n\nKaum Lut pun telah mendustakan peringatan itu. Sesungguhnya Kami kirimkan kepada mereka badai yang membawa batu-batu (yang menimpa mereka), kecuali keluarga Lut. Kami selamatkan mereka sebelum fajar menyingsing. (al-Qamar/54: 33-34)\n\nKeenam, A.shhabul Aikah, yang merupakan kaum Nabi Syuaib, juga mendustakan nabinya. Nabi Syuaib mengajak mereka agar menyembah Allah Yang Maha Esa, melarang mempersekutukan-Nya, dan tidak mengurangi timbangan. Akan tetapi, kaumnya bukan saja menolak seruan itu, bahkan mereka bersekutu menentangnya. Itulah sebabnya mereka dibinasakan dengan kilat yang menyambar mereka dalam keadaan gelap gulita.\n\nAllah berfirman:\n\nMaka jatuhkanlah kepada kami gumpalan dari langit, jika engkau termasuk orang-orang yang benar.\" Dia (Syuaib) berkata, \"Tuhanku lebih mengetahui apa yang kamu kerjakan.\" Kemudian mereka mendustakannya (Syuaib), lalu mereka ditimpa azab pada hari yang gelap. Sungguh, itulah azab pada hari yang dahsyat. (asy-Syu'ara'/26: 187-189)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3984,
                    "inSurah": 14
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 391,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِن كُلٌّ إِلَّا كَذَّبَ الرُّسُلَ فَحَقَّ عِقَابِ",
                    "transliteration": {
                        "en": "In kullun illaa kazzabar Rusula fahaqqa 'iqaab"
                    }
                },
                "translation": {
                    "en": "Each of them denied the messengers, so My penalty was justified.",
                    "id": "Semua mereka itu mendustakan rasul-rasul, maka pantas mereka merasakan azab-Ku."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3984",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3984.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3984.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Semua mereka itu mendustakan seruan rasul-rasul Allah, maka pantas mereka merasakan azab-Ku sehingga mereka pun hancur.",
                        "long": "Allah menjelaskan penyebab mereka mendapat siksa dan mengalami kehancuran, yaitu karena umat-umat terdahulu itu mendustakan seruan para rasul Allah, maka sepantasnyalah mereka mendapat siksa dan mengalami kehancuran. Kisah-kisah umat yang lalu itu dikemukakan kepada kaum musyrik Mekah, sebagai peringatan agar mereka insaf dan mau mengubah sikap yang mendustakan seruan Rasul dan sebaliknya menjadi umat yang taat dan menerima seruannya. Kisah itu juga menjadi hiburan dan dorongan kepada kaum Mukminin agar tabah menghadapi siksaan dan penghinaan musuh-musuh Allah, musuh itu menjadi teladan bagi mereka bahwa perjuangan membela agama tauhid tentu mendapat pertolongan dari Allah dan pasti berakhir dengan kemenangan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3985,
                    "inSurah": 15
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا يَنظُرُ هَٰؤُلَاءِ إِلَّا صَيْحَةً وَاحِدَةً مَّا لَهَا مِن فَوَاقٍ",
                    "transliteration": {
                        "en": "Wa maa yanzuru haaa ulaaa'i illaa saihatanw waahidatam maa lahaa min fawaaq"
                    }
                },
                "translation": {
                    "en": "And these [disbelievers] await not but one blast [of the Horn]; for it there will be no delay.",
                    "id": "Dan sebenarnya yang mereka tunggu adalah satu teriakan saja, yang tidak ada selanya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3985",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3985.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3985.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan apabila kaum musyrik Mekah dan umat-umat durhaka terdahulu itu tetap dalam keingkaran mereka, maka sebenarnya yang mereka tunggu adalah satu teriakan saja yang tidak ada selanya. Itulah teriakan sebagai tanda datangnya hari Kiamat—teriakan yang sangat keras dan cepat.",
                        "long": "Pada ayat ini, Allah mengancam kaum musyrik Mekah yang tidak mau mengubah keingkarannya kepada Rasul, dengan ancaman berupa teriakan yang amat keras dan cepat, sebagai tanda datangnya hari Kiamat yang membinasakan. Pada saat itu, mereka tidak mempunyai kesempatan untuk mengelakkan diri dari kebinasaan yang datang secara tiba-tiba dan tidak berselang sesaat pun."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3986,
                    "inSurah": 16
                },
                "meta": {
                    "juz": 23,
                    "page": 453,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالُوا رَبَّنَا عَجِّل لَّنَا قِطَّنَا قَبْلَ يَوْمِ الْحِسَابِ",
                    "transliteration": {
                        "en": "Wa qaaloo Rabbanaa 'ajjil lanaa qittanaa qabla Yawmil Hisaab"
                    }
                },
                "translation": {
                    "en": "And they say, \"Our Lord, hasten for us our share [of the punishment] before the Day of Account\"",
                    "id": "Dan mereka berkata, “Ya Tuhan kami, segerakanlah azab yang diperuntukkan bagi kami sebelum hari perhitungan.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3986",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3986.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3986.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan mereka dengan nada sinis dan penuh keingkaran berkata, “Ya Tuhan kami, segerakanlah azab yang diperuntukkan bagi kami sebelum hari perhitungan.” Dengan ucapan ini mereka bermaksud memperolok Nabi yang menyampaikan bahwa ancaman yang Allah tujukan kepada mereka adalah azab di hari Kiamat (Lihat pula: Surah al-Anfàl/8: 32)",
                        "long": "Pada ayat ini, Allah mengungkapkan keingkaran orang-orang kafir Mekah terhadap azab yang diancamkan kepada mereka. Mereka memperolok-olokkan Rasulullah setelah mendengar bahwa azab yang diancamkan kepada mereka itu ialah azab di hari Kiamat. Mereka meminta kepada Allah agar azab yang diancamkan kepada mereka itu dipercepat datangnya dan tidak perlu ditunggu hingga hari perhitungan tiba. \n\nAllah berfirman:\n\nDan (ingatlah), ketika mereka (orang-orang musyrik) berkata, \"Ya Allah, jika (Al-Qur'an) ini benar (wahyu) dari Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih.\" (al-Anfal/8: 32)\n\nMenurut riwayat Imam an-Nasa'i dari Ibnu 'Abbas, bahwa orang yang meminta agar siksa Allah disegerakan datangnya itu ialah an-Nadhir bin al-harits bin 'Alaqah bin Kaladah. An-Nadhir mati terbunuh dalam perang Badar.\n\nYang dimaksud dengan hari perhitungan ialah hari diperiksanya setiap amal seseorang, dengan pemeriksaan yang teliti agar mendapat balasan yang sesuai dengan amalnya. Terjadinya hari perhitungan itu didahului oleh teriakan keras yang membinasakan seluruh kehidupan pada hari Kiamat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3987,
                    "inSurah": 17
                },
                "meta": {
                    "juz": 23,
                    "page": 454,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "اصْبِرْ عَلَىٰ مَا يَقُولُونَ وَاذْكُرْ عَبْدَنَا دَاوُودَ ذَا الْأَيْدِ ۖ إِنَّهُ أَوَّابٌ",
                    "transliteration": {
                        "en": "Isbir 'alaa maa yaqooloona wazkur 'abdanaa Daawooda zal aidi aidi innahooo awwaab"
                    }
                },
                "translation": {
                    "en": "Be patient over what they say and remember Our servant, David, the possessor of strength; indeed, he was one who repeatedly turned back [to Allah].",
                    "id": "Bersabarlah atas apa yang mereka katakan; dan ingatlah akan hamba Kami Dawud yang mempunyai kekuatan; sungguh dia sangat taat (kepada Allah)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3987",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3987.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3987.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah meminta Nabi bersabar dalam menghadapi keingkaran orang-orang musyrik, sebagaimana nabi-nabi terdahulu juga menghadapi rintangan yang sama. Bersabarlah wahai Nabi Muhammad atas apa yang mereka katakan dan tuduhkan kepadamu bahwa kamu adalah pendusta dan penyihir. Dan ingatlah akan kisah seorang hamba sebelum kamu yang Kami utus, yaitu Nabi Dawud, yang mempunyai kekuatan dalam memahami dan menjalankan ajaran agama. Sungguh dia sangat taat dan selalu mengembalikan urusannya kepada Allah. Bila merasa bersalah, ia pun segera minta ampun kepada Allah.",
                        "long": "Allah memerintahkan kepada Rasulullah dan pengikut-pengikutnya agar tetap bersabar menghadapi apa saja yang dikatakan oleh kaum musyrikin, meskipun perkataan itu merupakan hinaan dan pendustaan. Hal serupa itu tidak saja menimpa Rasulullah dan para pengikutnya, akan tetapi juga menimpa nabi-nabi yang diutus sebelumnya. Bagi orang-orang yang beriman, pengingkaran dan penganiayaan yang datang dari pihak musuh-musuh Allah, tidaklah mengurangi semangat perjuangan mereka dalam menegakkan agama tauhid, bahkan menjadi pendorong untuk tetap mempertahankan kebenaran tauhid dan tetap berjuang menghancurkan kemusyrikan. \n\nAllah memerintahkan kepada Rasulullah agar mengingatkan kaumnya akan kisah Nabi Daud yang memiliki kekuatan. Dimaksud kekuatan pada ayat ini ialah kekuatan dalam menaati Allah dan kekuatan dalam memahami agama. Ketaatan kepada Allah dan pengetahuannya terhadap agama tergambar pada tindakannya yang selalu berjuang untuk melaksanakan amanat, menyebarluaskan seruan menganut agama tauhid, tanpa menampakkan kelemahan sedikit pun.\n\nNabi Daud terkenal sebagai nabi yang paling kuat beribadah. Ia menggunakan waktunya sepertiga malam untuk salat, dan selang sehari ia berpuasa.\n\nMengenai ketaatan Daud kepada Tuhannya lebih jauh dijelaskan dalam beberapa hadis sebagai berikut: \n\nPuasa yang paling dicintai Allah adalah puasa Daud. Dia berpuasa sehari dan berbuka sehari. Salat yang paling dicintai Allah Ta'ala ialah salat Daud, Dia tidur separuh malam, dan melakukan salat sepertiganya, lalu tidur lagi seperenamnya. (Riwayat A.hmad, al-Bukhari, Muslim, Abu Dawud, dan an-Nasa'i dari Ibnu 'Umar)\n\nDari riwayat ini dapat dipahami bahwa Nabi Daud dalam segala urusan selalu mengembalikannya kepada Allah. Apabila ia merasa bersalah, atau terlintas dalam hatinya ada kesalahan pada dirinya, maka ia selalu meminta ampun kepada Allah.\n\nImam al-hakim meriwayatkan dari Abu ad-Darda' yang menyatakan:\n\nApabila Nabi (Muhammad) saw menyebutkan Nabi Daud atau membicarakannya, maka beliau memberikan sifat bahwa ia adalah manusia yang paling banyak ibadahnya.\n\nImam adh-ailami meriwayatkan dari Ibnu 'Umar yang menyatakan bahwa Rasulullah saw bersabda:\n\nTidak patut bagi seseorang mengatakan bahwa saya lebih banyak beribadah dari Nabi Daud.\n\nRiwayat-riwayat tersebut menunjukkan bahwa Nabi Daud adalah nabi yang amat taat kepada Allah, sebagaimana ditegaskan oleh Allah pada akhir ayat ini."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3988,
                    "inSurah": 18
                },
                "meta": {
                    "juz": 23,
                    "page": 454,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّا سَخَّرْنَا الْجِبَالَ مَعَهُ يُسَبِّحْنَ بِالْعَشِيِّ وَالْإِشْرَاقِ",
                    "transliteration": {
                        "en": "Innaa sakhkharnal jibaala ma'ahoo yusabbihna bil'ashaiyi wal ishraaq"
                    }
                },
                "translation": {
                    "en": "Indeed, We subjected the mountains [to praise] with him, exalting [Allah] in the [late] afternoon and [after] sunrise.",
                    "id": "Sungguh, Kamilah yang menundukkan gunung-gunung untuk bertasbih bersama dia (Dawud) pada waktu petang dan pagi,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3988",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3988.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3988.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Karena ketaatan Nabi Dawud, sungguh Kami telah menganugerahinya beberapa kenikmatan. Kamilah yang menundukkan gunung-gunung yang kukuh untuk senantiasa bertasbih dan beribadah bersama dia pada waktu petang dan pagi.",
                        "long": "Di dalam ayat-ayat ini, Allah menyebutkan beberapa kenikmatan yang telah diberikan kepada Daud.\n\nPertama, bahwa Allah telah menundukkan gunung-gunung untuk bertasbih bersama-sama Daud di waktu petang dan pagi. Ungkapan seperti ini mengandung pengertian bahwa Nabi Daud selalu taat beribadah kepada Allah. Dia selalu bertasbih, memuji kebesaran-Nya pagi dan petang. Allah menyamakan ketaatan Daud ini dengan ketaatan gunung-gunung untuk menunjukkan betapa dalam ketaatan Nabi Daud itu. Adapun tentang ketaatan gunung bertasbih itu adalah dalam kenyataan bahwa gunung-gunung itu mengikuti sunah Allah yang tidak berubah-ubah, yang sudah barang tentu lain dengan taatnya manusia.\n\nAllah berfirman:\n\nDan tidak ada sesuatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. (al-Isra'/17: 44)\n\nApabila seseorang memperhatikan dengan cermat arti dan kegunaan penciptaan gunung untuk manusia, serta memperhatikan pula fungsinya sebaik-baiknya, maka ia akan mengetahui bahwa gunung itu merupakan salah satu penyebab turunnya hujan, yang memberi kehidupan bagi manusia. Ia juga sebagai media penyimpan air di musim penghujan, yang dialirkannya di musim kemarau, serta mineral yang dimuntahkannya menjadi penyubur tanah pertanian. Demikian pula dalam perutnya terdapat segala macam barang tambang yang sangat diperlukan untuk kepentingan perlengkapan hidup manusia. Gunung-gunung itu menunaikan tugas dengan sebaik-baiknya dan tidak pernah keluar dari ketentuan yang berlaku.\n\nAllah selanjutnya menjelaskan bahwa Dia menundukkan pula burung-burung yang selalu bertasbih kepada-Nya bersama Nabi Daud. Ungkapan serupa ini mengandung pengertian betapa indahnya suara Nabi Daud pada saat membaca kitab Zabur, sehingga seolah-olah getaran suaranya dapat menawan burung-burung yang sedang beterbangan di angkasa. Digambarkan seolah-olah burung-burung yang sedang terbang itu terhenti di udara karena mendengar suara Nabi Daud yang sedang bertasbih, dan ikut pula bertasbih bersama-sama dengannya.\n\nTasbih burung-burung tidak sama dengan tasbih manusia. Burung-burung mempunyai cara tersendiri di dalam menyatakan keagungan Allah.\n\nSesudah itu Allah menegaskan bahwa masing-masing makhluk yang disebutkan tadi, yaitu gunung dan burung tunduk, takluk dan jinak patuh pada ketentuan Allah untuk kepentingan umat manusia.\n\nPada ayat ini terdapat sindiran bagi orang-orang musyrik Mekah, pertama bahwa apabila gunung dan burung yang diciptakan tidak berakal itu selalu menaati ketentuan-ketentuan Allah, maka seharusnyalah mereka yang diciptakan sebagai makhluk yang lebih sempurna dan dilengkapi dengan akal lebih taat kepada hukum-hukum Allah. Apabila terjadi sebaliknya, berarti telah terjadi sesuatu yang tidak wajar pada diri mereka.\n\nKedua, Allah telah menguatkan kerajaan Nabi Daud dengan tentara yang banyak, harta kekayaan yang melimpah ruah, pribadi yang sangat disegani, dan kemahiran dalam mengatur siasat perang sehingga selalu meraih kemenangan.\n\nKetiga, Allah telah menganugerahkan kepadanya hikmah. Yang dimaksud hikmah dalam ayat ini adalah kenabian, kesempurnaan ilmu, dan ketelitian dalam melaksanakan amal perbuatan, serta pemahaman yang tepat.\n\nDi antara ilmu pengetahuan yang diberikan Allah kepada Nabi Daud ialah seperti disebutkan dalam firman Allah:\n\n¦ dan Kami telah melunakkan besi untuknya, (yaitu) buatlah baju besi yang besar-besar dan ukurlah anyamannya; dan kerjakanlah kebajikan. Sungguh, Aku Maha Melihat apa yang kamu kerjakan. (Saba'/34: 10-11)\n\nSedang yang dimaksud ketelitiannya dalam melaksanakan amal perbuatan ialah dia tidak mau memulai sesuatu perbuatan, terkecuali ia mengetahui sebab apa dan untuk apa amal perbuatan itu dilakukan.\n\nKeempat, Allah telah menganugerahkan kepadanya kebijakan dalam menyelesaikan perselisihan. Dalam menyelesaikan persengketaan ia selalu memeriksa pihak-pihak berdasarkan bukti-bukti yang meyakinkan jauh dari sifat-sifat berat sebelah, dan bersih dari pengaruh hawa nafsu. Untuk mencari keyakinan yang sebenar-benarnya yang dapat dijadikan landasan yang tepat dalam memutuskan perkara memerlukan ilmu pengetahuan yang luas, sikap yang lemah-lembut, menguasai persoalan yang dipersengketakan, dan kesabaran yang kuat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3989,
                    "inSurah": 19
                },
                "meta": {
                    "juz": 23,
                    "page": 454,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالطَّيْرَ مَحْشُورَةً ۖ كُلٌّ لَّهُ أَوَّابٌ",
                    "transliteration": {
                        "en": "Wattayra mahshoorah; kullul lahooo awwaab"
                    }
                },
                "translation": {
                    "en": "And the birds were assembled, all with him repeating [praises].",
                    "id": "dan (Kami tundukkan pula) burung-burung dalam keadaan terkumpul. Masing-masing sangat taat (kepada Allah)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3989",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3989.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3989.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kami tundukkan pula baginya burung-burung untuk bertasbih bersamanya dalam keadaan terkumpul maupun terbang. Burung-burung itu ikut bertasbih begitu mendengar suara Nabi Dawud yang merdu bertasbih dan melantunkan kitab Zabur. Masing-masing dari gunung-gunung dan burung-burung itu sangat taat kepada Allah.",
                        "long": "Di dalam ayat-ayat ini, Allah menyebutkan beberapa kenikmatan yang telah diberikan kepada Daud.\n\nPertama, bahwa Allah telah menundukkan gunung-gunung untuk bertasbih bersama-sama Daud di waktu petang dan pagi. Ungkapan seperti ini mengandung pengertian bahwa Nabi Daud selalu taat beribadah kepada Allah. Dia selalu bertasbih, memuji kebesaran-Nya pagi dan petang. Allah menyamakan ketaatan Daud ini dengan ketaatan gunung-gunung untuk menunjukkan betapa dalam ketaatan Nabi Daud itu. Adapun tentang ketaatan gunung bertasbih itu adalah dalam kenyataan bahwa gunung-gunung itu mengikuti sunah Allah yang tidak berubah-ubah, yang sudah barang tentu lain dengan taatnya manusia.\n\nAllah berfirman:\n\nDan tidak ada sesuatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. (al-Isra'/17: 44)\n\nApabila seseorang memperhatikan dengan cermat arti dan kegunaan penciptaan gunung untuk manusia, serta memperhatikan pula fungsinya sebaik-baiknya, maka ia akan mengetahui bahwa gunung itu merupakan salah satu penyebab turunnya hujan, yang memberi kehidupan bagi manusia. Ia juga sebagai media penyimpan air di musim penghujan, yang dialirkannya di musim kemarau, serta mineral yang dimuntahkannya menjadi penyubur tanah pertanian. Demikian pula dalam perutnya terdapat segala macam barang tambang yang sangat diperlukan untuk kepentingan perlengkapan hidup manusia. Gunung-gunung itu menunaikan tugas dengan sebaik-baiknya dan tidak pernah keluar dari ketentuan yang berlaku.\n\nAllah selanjutnya menjelaskan bahwa Dia menundukkan pula burung-burung yang selalu bertasbih kepada-Nya bersama Nabi Daud. Ungkapan serupa ini mengandung pengertian betapa indahnya suara Nabi Daud pada saat membaca kitab Zabur, sehingga seolah-olah getaran suaranya dapat menawan burung-burung yang sedang beterbangan di angkasa. Digambarkan seolah-olah burung-burung yang sedang terbang itu terhenti di udara karena mendengar suara Nabi Daud yang sedang bertasbih, dan ikut pula bertasbih bersama-sama dengannya.\n\nTasbih burung-burung tidak sama dengan tasbih manusia. Burung-burung mempunyai cara tersendiri di dalam menyatakan keagungan Allah.\n\nSesudah itu Allah menegaskan bahwa masing-masing makhluk yang disebutkan tadi, yaitu gunung dan burung tunduk, takluk dan jinak patuh pada ketentuan Allah untuk kepentingan umat manusia.\n\nPada ayat ini terdapat sindiran bagi orang-orang musyrik Mekah, pertama bahwa apabila gunung dan burung yang diciptakan tidak berakal itu selalu menaati ketentuan-ketentuan Allah, maka seharusnyalah mereka yang diciptakan sebagai makhluk yang lebih sempurna dan dilengkapi dengan akal lebih taat kepada hukum-hukum Allah. Apabila terjadi sebaliknya, berarti telah terjadi sesuatu yang tidak wajar pada diri mereka.\n\nKedua, Allah telah menguatkan kerajaan Nabi Daud dengan tentara yang banyak, harta kekayaan yang melimpah ruah, pribadi yang sangat disegani, dan kemahiran dalam mengatur siasat perang sehingga selalu meraih kemenangan.\n\nKetiga, Allah telah menganugerahkan kepadanya hikmah. Yang dimaksud hikmah dalam ayat ini adalah kenabian, kesempurnaan ilmu, dan ketelitian dalam melaksanakan amal perbuatan, serta pemahaman yang tepat.\n\nDi antara ilmu pengetahuan yang diberikan Allah kepada Nabi Daud ialah seperti disebutkan dalam firman Allah:\n\n¦ dan Kami telah melunakkan besi untuknya, (yaitu) buatlah baju besi yang besar-besar dan ukurlah anyamannya; dan kerjakanlah kebajikan. Sungguh, Aku Maha Melihat apa yang kamu kerjakan. (Saba'/34: 10-11)\n\nSedang yang dimaksud ketelitiannya dalam melaksanakan amal perbuatan ialah dia tidak mau memulai sesuatu perbuatan, terkecuali ia mengetahui sebab apa dan untuk apa amal perbuatan itu dilakukan.\n\nKeempat, Allah telah menganugerahkan kepadanya kebijakan dalam menyelesaikan perselisihan. Dalam menyelesaikan persengketaan ia selalu memeriksa pihak-pihak berdasarkan bukti-bukti yang meyakinkan jauh dari sifat-sifat berat sebelah, dan bersih dari pengaruh hawa nafsu. Untuk mencari keyakinan yang sebenar-benarnya yang dapat dijadikan landasan yang tepat dalam memutuskan perkara memerlukan ilmu pengetahuan yang luas, sikap yang lemah-lembut, menguasai persoalan yang dipersengketakan, dan kesabaran yang kuat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3990,
                    "inSurah": 20
                },
                "meta": {
                    "juz": 23,
                    "page": 454,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 181,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَشَدَدْنَا مُلْكَهُ وَآتَيْنَاهُ الْحِكْمَةَ وَفَصْلَ الْخِطَابِ",
                    "transliteration": {
                        "en": "Wa shadadnaa mulkahoo wa aatainaahul Hikmata wa faslal khitaab"
                    }
                },
                "translation": {
                    "en": "And We strengthened his kingdom and gave him wisdom and discernment in speech.",
                    "id": "Dan Kami kuatkan kerajaannya dan Kami berikan hikmah kepadanya serta kebijaksanaan dalam memutuskan perkara."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3990",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3990.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3990.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan Kami kuatkan kerajaannya dengan kewibawaan, tentara yang banyak, kekayaan yang berlimpah, dan kepiawaiannya mengatur strategi perang. Dan Kami berikan hikmah kepadanya berupa kenabian, kesempurnaan ilmu, dan ketelitian dalam berbuat serta pemahaman yang tepat (Lihat pula: Surah Saba’/34: 10–11), dan kebijaksanaan dalam memutuskan perkara dengan menunjukkan bukti-bukti yang akurat.",
                        "long": "Di dalam ayat-ayat ini, Allah menyebutkan beberapa kenikmatan yang telah diberikan kepada Daud.\n\nPertama, bahwa Allah telah menundukkan gunung-gunung untuk bertasbih bersama-sama Daud di waktu petang dan pagi. Ungkapan seperti ini mengandung pengertian bahwa Nabi Daud selalu taat beribadah kepada Allah. Dia selalu bertasbih, memuji kebesaran-Nya pagi dan petang. Allah menyamakan ketaatan Daud ini dengan ketaatan gunung-gunung untuk menunjukkan betapa dalam ketaatan Nabi Daud itu. Adapun tentang ketaatan gunung bertasbih itu adalah dalam kenyataan bahwa gunung-gunung itu mengikuti sunah Allah yang tidak berubah-ubah, yang sudah barang tentu lain dengan taatnya manusia.\n\nAllah berfirman:\n\nDan tidak ada sesuatu pun melainkan bertasbih dengan memuji-Nya, tetapi kamu tidak mengerti tasbih mereka. (al-Isra'/17: 44)\n\nApabila seseorang memperhatikan dengan cermat arti dan kegunaan penciptaan gunung untuk manusia, serta memperhatikan pula fungsinya sebaik-baiknya, maka ia akan mengetahui bahwa gunung itu merupakan salah satu penyebab turunnya hujan, yang memberi kehidupan bagi manusia. Ia juga sebagai media penyimpan air di musim penghujan, yang dialirkannya di musim kemarau, serta mineral yang dimuntahkannya menjadi penyubur tanah pertanian. Demikian pula dalam perutnya terdapat segala macam barang tambang yang sangat diperlukan untuk kepentingan perlengkapan hidup manusia. Gunung-gunung itu menunaikan tugas dengan sebaik-baiknya dan tidak pernah keluar dari ketentuan yang berlaku.\n\nAllah selanjutnya menjelaskan bahwa Dia menundukkan pula burung-burung yang selalu bertasbih kepada-Nya bersama Nabi Daud. Ungkapan serupa ini mengandung pengertian betapa indahnya suara Nabi Daud pada saat membaca kitab Zabur, sehingga seolah-olah getaran suaranya dapat menawan burung-burung yang sedang beterbangan di angkasa. Digambarkan seolah-olah burung-burung yang sedang terbang itu terhenti di udara karena mendengar suara Nabi Daud yang sedang bertasbih, dan ikut pula bertasbih bersama-sama dengannya.\n\nTasbih burung-burung tidak sama dengan tasbih manusia. Burung-burung mempunyai cara tersendiri di dalam menyatakan keagungan Allah.\n\nSesudah itu Allah menegaskan bahwa masing-masing makhluk yang disebutkan tadi, yaitu gunung dan burung tunduk, takluk dan jinak patuh pada ketentuan Allah untuk kepentingan umat manusia.\n\nPada ayat ini terdapat sindiran bagi orang-orang musyrik Mekah, pertama bahwa apabila gunung dan burung yang diciptakan tidak berakal itu selalu menaati ketentuan-ketentuan Allah, maka seharusnyalah mereka yang diciptakan sebagai makhluk yang lebih sempurna dan dilengkapi dengan akal lebih taat kepada hukum-hukum Allah. Apabila terjadi sebaliknya, berarti telah terjadi sesuatu yang tidak wajar pada diri mereka.\n\nKedua, Allah telah menguatkan kerajaan Nabi Daud dengan tentara yang banyak, harta kekayaan yang melimpah ruah, pribadi yang sangat disegani, dan kemahiran dalam mengatur siasat perang sehingga selalu meraih kemenangan.\n\nKetiga, Allah telah menganugerahkan kepadanya hikmah. Yang dimaksud hikmah dalam ayat ini adalah kenabian, kesempurnaan ilmu, dan ketelitian dalam melaksanakan amal perbuatan, serta pemahaman yang tepat.\n\nDi antara ilmu pengetahuan yang diberikan Allah kepada Nabi Daud ialah seperti disebutkan dalam firman Allah:\n\n¦ dan Kami telah melunakkan besi untuknya, (yaitu) buatlah baju besi yang besar-besar dan ukurlah anyamannya; dan kerjakanlah kebajikan. Sungguh, Aku Maha Melihat apa yang kamu kerjakan. (Saba'/34: 10-11)\n\nSedang yang dimaksud ketelitiannya dalam melaksanakan amal perbuatan ialah dia tidak mau memulai sesuatu perbuatan, terkecuali ia mengetahui sebab apa dan untuk apa amal perbuatan itu dilakukan.\n\nKeempat, Allah telah menganugerahkan kepadanya kebijakan dalam menyelesaikan perselisihan. Dalam menyelesaikan persengketaan ia selalu memeriksa pihak-pihak berdasarkan bukti-bukti yang meyakinkan jauh dari sifat-sifat berat sebelah, dan bersih dari pengaruh hawa nafsu. Untuk mencari keyakinan yang sebenar-benarnya yang dapat dijadikan landasan yang tepat dalam memutuskan perkara memerlukan ilmu pengetahuan yang luas, sikap yang lemah-lembut, menguasai persoalan yang dipersengketakan, dan kesabaran yang kuat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3991,
                    "inSurah": 21
                },
                "meta": {
                    "juz": 23,
                    "page": 454,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ وَهَلْ أَتَاكَ نَبَأُ الْخَصْمِ إِذْ تَسَوَّرُوا الْمِحْرَابَ",
                    "transliteration": {
                        "en": "Wa hal ataaka naba'ul khasm; iz tasawwarul mihraab"
                    }
                },
                "translation": {
                    "en": "And has there come to you the news of the adversaries, when they climbed over the wall of [his] prayer chamber -",
                    "id": "Dan apakah telah sampai kepadamu berita orang-orang yang berselisih ketika mereka memanjat dinding mihrab?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3991",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3991.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3991.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan apakah telah sampai kepadamu, wahai Nabi Muhammad, suatu berita tentang orang-orang yang berselisih saat Nabi Dawud sedang berada di tempat peribadatan, ketika mereka datang dengan cara memanjat dinding mihrab?",
                        "long": "Allah menyebutkan salah satu peristiwa yang menarik di antara kisah Nabi Daud. Kisah ini dimulai dengan pertanyaan yang ditujukan kepada Rasulullah dan pengikut-pengikutnya, untuk menunjukkan bahwa kisah dimaksud benar-benar menarik perhatian dan patut diteladani. Kisah yang menarik itu ialah kisah orang-orang yang berperkara yang datang kepada Nabi Daud. Daud pada waktu itu berada di tempat peribadatannya. Nabi Daud pun terperanjat karena beliau menyangka mereka itu datang untuk memperdayainya. Nabi Daud menduga demikian, karena mereka datang dengan cara dan dalam waktu yang tak biasa. Pada saat itulah, mereka meminta kepada Daud agar tidak merasa takut. Selanjutnya mereka menjelaskan bahwa mereka mempunyai perkara yang harus diputuskan, dan meminta agar perkaranya diputuskan dengan keputusan yang adil, lagi tidak menyimpang dari kebenaran."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3992,
                    "inSurah": 22
                },
                "meta": {
                    "juz": 23,
                    "page": 454,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِذْ دَخَلُوا عَلَىٰ دَاوُودَ فَفَزِعَ مِنْهُمْ ۖ قَالُوا لَا تَخَفْ ۖ خَصْمَانِ بَغَىٰ بَعْضُنَا عَلَىٰ بَعْضٍ فَاحْكُم بَيْنَنَا بِالْحَقِّ وَلَا تُشْطِطْ وَاهْدِنَا إِلَىٰ سَوَاءِ الصِّرَاطِ",
                    "transliteration": {
                        "en": "Iz dakhaloo 'alaa Daawooda fafazi'a minhum qaaloo la takhaf khasmaani baghaa ba'dunaa 'alaa ba'din fahkum bainanaaa bilhaqqi wa laa tushtit wahdinaaa ilaa Sawaaa'is Siraat"
                    }
                },
                "translation": {
                    "en": "When they entered upon David and he was alarmed by them? They said, \"Fear not. [We are] two adversaries, one of whom has wronged the other, so judge between us with truth and do not exceed [it] and guide us to the sound path.",
                    "id": "ketika mereka masuk menemui Dawud lalu dia terkejut karena (kedatangan) mereka. Mereka berkata, “Janganlah takut! (Kami) berdua sedang berselisih, sebagian dari kami berbuat zalim kepada yang lain; maka berilah keputusan di antara kami secara adil dan janganlah menyimpang dari kebenaran serta tunjukilah kami ke jalan yang lurus."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3992",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3992.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3992.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ketika itu, mereka masuk untuk menemui Nabi Dawud lalu dia terkejut karena kedatangan mereka yang tak terduga itu dan mengira mereka hendak berbuat tidak baik kepadanya. Mereka berkata untuk menenangkan hatinya, “Janganlah takut! Wahai Nabi Dawud, kami berdua sedang berselisih tentang suatu perkara; sebagian dari kami berbuat zalim kepada yang lain, maka berilah keputusan di antara kami secara adil dan janganlah menyimpang dari kebenaran serta tunjukilah kami ke jalan yang lurus dan benar.",
                        "long": "Allah menyebutkan salah satu peristiwa yang menarik di antara kisah Nabi Daud. Kisah ini dimulai dengan pertanyaan yang ditujukan kepada Rasulullah dan pengikut-pengikutnya, untuk menunjukkan bahwa kisah dimaksud benar-benar menarik perhatian dan patut diteladani. Kisah yang menarik itu ialah kisah orang-orang yang berperkara yang datang kepada Nabi Daud. Daud pada waktu itu berada di tempat peribadatannya. Nabi Daud pun terperanjat karena beliau menyangka mereka itu datang untuk memperdayainya. Nabi Daud menduga demikian, karena mereka datang dengan cara dan dalam waktu yang tak biasa. Pada saat itulah, mereka meminta kepada Daud agar tidak merasa takut. Selanjutnya mereka menjelaskan bahwa mereka mempunyai perkara yang harus diputuskan, dan meminta agar perkaranya diputuskan dengan keputusan yang adil, lagi tidak menyimpang dari kebenaran."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3993,
                    "inSurah": 23
                },
                "meta": {
                    "juz": 23,
                    "page": 454,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّ هَٰذَا أَخِي لَهُ تِسْعٌ وَتِسْعُونَ نَعْجَةً وَلِيَ نَعْجَةٌ وَاحِدَةٌ فَقَالَ أَكْفِلْنِيهَا وَعَزَّنِي فِي الْخِطَابِ",
                    "transliteration": {
                        "en": "Inna haazaaa akhee lahoo tis'unw wa tis'oona na'jatanw wa liya na'jatunw waahidah; faqaala akfilneeha wa 'azzanee filkhitaab"
                    }
                },
                "translation": {
                    "en": "Indeed this, my brother, has ninety-nine ewes, and I have one ewe; so he said, 'Entrust her to me,' and he overpowered me in speech.\"",
                    "id": "Sesungguhnya saudaraku ini mempunyai sembilan puluh sembilan ekor kambing betina dan aku mempunyai seekor saja, lalu dia berkata, “Serahkanlah (kambingmu) itu kepadaku! Dan dia mengalahkan aku dalam perdebatan.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3993",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3993.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3993.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Berusaha menjelaskan duduk perkara, salah satu dari kedua orang itu mengatakan, “Sesungguhnya saudaraku ini mempunyai sembilan puluh sembilan ekor kambing betina dan aku mempunyai seekor kambing betina saja, lalu dia berkata kepadaku sambil menuntut, ‘Serahkanlah kambing betinamu itu kepadaku!’ Dan dia mengalahkan aku karena aku tidak mempunyai dalih yang kuat dalam perdebatan itu.”",
                        "long": "Pada ayat ini Allah menjelaskan apa yang mereka jadikan perkara itu. Salah satu pihak dari mereka menerangkan bahwa saudaranya mempunyai sembilan puluh sembilan ekor kambing. Sedang ia sendiri mempunyai seekor kambing saja. Saudaranya menuntut agar menyerahkan kambing yang ia miliki. Karena saudaranya itu pandai memutarbalikkan fakta, sedang ia sendiri tidak mempunyai bukti-bukti yang kuat untuk menangkis, ia merasa dikalahkan dan harus menyerahkan kambing yang seekor itu kepada saudaranya. Itulah perkara yang mereka ajukan kepada Nabi Daud dengan maksud agar mendapat keputusan yang adil."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3994,
                    "inSurah": 24
                },
                "meta": {
                    "juz": 23,
                    "page": 454,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": true,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالَ لَقَدْ ظَلَمَكَ بِسُؤَالِ نَعْجَتِكَ إِلَىٰ نِعَاجِهِ ۖ وَإِنَّ كَثِيرًا مِّنَ الْخُلَطَاءِ لَيَبْغِي بَعْضُهُمْ عَلَىٰ بَعْضٍ إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَقَلِيلٌ مَّا هُمْ ۗ وَظَنَّ دَاوُودُ أَنَّمَا فَتَنَّاهُ فَاسْتَغْفَرَ رَبَّهُ وَخَرَّ رَاكِعًا وَأَنَابَ ۩",
                    "transliteration": {
                        "en": "Qaala laqad zalamaka bisu 'aali na'jatika ilaa ni'aajihee wa inna kaseeram minal khulataaa'i la-yabghee ba'duhum 'alaa ba'din illal lazeena aamanoo wa 'amilus saalihaati wa qaleehum maa hum; wa zanna Daawoodu annamaa fatannaahu fastaghrara Rabbahoo wa kharra raaki'anw wa anaab"
                    }
                },
                "translation": {
                    "en": "[David] said, \"He has certainly wronged you in demanding your ewe [in addition] to his ewes. And indeed, many associates oppress one another, except for those who believe and do righteous deeds - and few are they.\" And David became certain that We had tried him, and he asked forgiveness of his Lord and fell down bowing [in prostration] and turned in repentance [to Allah].",
                    "id": "Dia (Dawud) berkata, “Sungguh, dia telah berbuat zalim kepadamu dengan meminta kambingmu itu untuk (ditambahkan) kepada kambingnya. Memang banyak di antara orang-orang yang bersekutu itu berbuat zalim kepada yang lain, kecuali orang-orang yang beriman dan mengerjakan kebajikan; dan hanya sedikitlah mereka yang begitu.” Dan Dawud menduga bahwa Kami mengujinya; maka dia memohon ampunan kepada Tuhannya lalu menyungkur sujud dan bertobat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3994",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3994.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3994.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Nabi Dawud menyimak aduan pria itu, lalu dia memberi keputusan seraya berkata, “Sungguh, dia telah berbuat zalim kepadamu dengan meminta kambingmu itu untuk ditambahkan kepada kambingnya sehingga kambingnya bertambah banyak. Memang banyak di antara orang-orang yang bersekutu itu berbuat zalim kepada yang lain karena pihak yang lemah tidak memiliki bukti yang menguatkan perkaranya. Banyak yang berbuat zalim, kecuali orang-orang yang beriman dan mengerjakan kebajikan yang menjunjung tinggi keadilan, dan hanya sedikitlah mereka yang begitu.” Dan setelah memberi putusan berdasarkan aduan sepihak itu, Nabi Dawud sadar dan menduga bahwa Kami mengujinya; maka dia segera memohon ampunan kepada Tuhannya atas kekeliruannya, lalu dia menyungkur sujud dan bertobat.",
                        "long": "Pada ayat ini dijelaskan bahwa Nabi Daud memutuskan perkara tersebut dengan mengatakan bahwa tergugat telah berbuat aniaya kepada penggugat, karena yang digugat itu telah mengambil kambing penggugat untuk dimiliki, sehingga kambingnya menjadi bertambah banyak.\n\nPada ayat ini tidak dijelaskan lebih lanjut apakah Nabi Daud sesudah mendapat keterangan dari penggugat, meminta keterangan juga kepada tergugat. Juga tidak diterangkan apakah jawaban Nabi Daud itu didasarkan atas bukti-bukti yang memberi keyakinan. Menurut pengertian yang tampak dalam ayat, Nabi Daud hanyalah memberi jawaban sesudah mendapat keterangan dari pihak penggugat saja. Padahal mungkin saja pihak penggugat mengemukakan keterangan yang berlawanan dengan kenyataan, atau karena cara mengemukakan kata diatur demikian rupa, hingga timbullah kesan seolah-olah si penggugat itu orang jujur. Seharusnya Nabi Daud tidak memberi jawaban secara tergesa-gesa, atau ditunda saja jawabannya hingga mendapat keyakinan yang sebenar-benarnya. \n\nDitinjau dari cara mereka masuk menemui Daud dengan memanjat pagar, dan waktunya yang tidak tepat, dan persoalan yang diajukan, sebenarnya mereka tidak bermaksud untuk meminta keputusan kepada Daud, tetapi mereka mempunyai maksud yang lain. Hanya karena kewaspadaan Nabi Daud, maka rencana mereka itu tidak dapat mereka laksanakan. Di dalam sejarah dapat diketahui bahwa orang-orang Bani Israil sering kali berusaha untuk membunuh nabinya, misalnya mereka telah membunuh Ilyasa' dan Zakaria. Patut diduga kedua orang itu (penggugat dan tergugat) sebenarnya ingin menganiaya Nabi Daud, hanya saja mereka tidak sampai melaksanakan niat jahatnya karena niat mereka diketahui terlebih dahulu.\n\nKemudian Allah menjelaskan jawaban Daud lebih terperinci. Daud mengatakan kepada orang yang berperkara itu bahwa sebagian besar orang yang mengadakan perserikatan, menganiaya anggotanya yang lain hal ini terjadi karena sifat hasad, dengki, dan memperturutkan hawa nafsu sehingga hak anggota yang satu terambil oleh anggota yang lain. Terkecuali orang-orang yang dalam hatinya penuh dengan iman dan mencintai amal saleh yang terhindar dari perbuatan yang jahat itu.\n\nDi akhir ayat, Allah menjelaskan bahwa Nabi Daud sadar bahwa ia sedang mendapat cobaan dari Allah. Lalu ia meminta ampun kepada Allah atas kesalahan, seraya sujud bertobat kepada-Nya karena merasakan kekurangan dan kesalahan yang ada pada dirinya.\n\nKesalahan dan kekurangan yang menimpa dirinya ialah ketergesa-gesaannya memberikan jawaban kepada orang yang berperkara, padahal ia belum memperoleh keyakinan dan bukti-bukti yang seharusnya ia peroleh. Ia memutuskan hanya berdasar prasangkanya bahwa kedatangan orang yang ingin memperdayainya itu adalah cobaan dari Allah, padahal apa yang ia duga tidak terjadi."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3995,
                    "inSurah": 25
                },
                "meta": {
                    "juz": 23,
                    "page": 454,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَغَفَرْنَا لَهُ ذَٰلِكَ ۖ وَإِنَّ لَهُ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَآبٍ",
                    "transliteration": {
                        "en": "Faghafarnaa lahoo zaalik; wa inna lahoo 'indanaa lazulfaa wa husna ma aab"
                    }
                },
                "translation": {
                    "en": "So We forgave him that; and indeed, for him is nearness to Us and a good place of return.",
                    "id": "Lalu Kami mengampuni (kesalahannya) itu. Dan sungguh, dia mempunyai kedudukan yang benar-benar dekat di sisi Kami dan tempat kembali yang baik."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3995",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3995.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3995.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Setelah Nabi Dawud meminta ampun dan bertobat kepada Allah, lalu Kami mengampuni kesalahan yang ia sadari itu. Dan lantaran ke-sadaran dan ketajaman nuraninya sungguh, dia mempunyai kedudukan yang benar-benar dekat di sisi Kami dan berhak mendapatkan tempat kembali yang baik, surga yang penuh kenikmatan.",
                        "long": "Kemudian Allah menjelaskan bahwa Dia telah memberikan ampun kepada Daud atas kesalahan yang ia sadari. Allah menilai bahwa kesadaran yang tinggi terhadap peristiwa yang ia hayati, dan ketajaman nuraninya terhadap apa yang tergerak dalam hatinya serta taatnya kepada Allah, sebagai tanda bahwa ia mempunyai kedudukan yang dekat pada sisi Allah. Hamba Allah seperti dialah yang berhak mendapat tempat kembali yang baik, yaitu surga Na'im yang penuh dengan kenikmatan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3996,
                    "inSurah": 26
                },
                "meta": {
                    "juz": 23,
                    "page": 454,
                    "manzil": 6,
                    "ruku": 392,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "يَا دَاوُودُ إِنَّا جَعَلْنَاكَ خَلِيفَةً فِي الْأَرْضِ فَاحْكُم بَيْنَ النَّاسِ بِالْحَقِّ وَلَا تَتَّبِعِ الْهَوَىٰ فَيُضِلَّكَ عَن سَبِيلِ اللَّهِ ۚ إِنَّ الَّذِينَ يَضِلُّونَ عَن سَبِيلِ اللَّهِ لَهُمْ عَذَابٌ شَدِيدٌ بِمَا نَسُوا يَوْمَ الْحِسَابِ",
                    "transliteration": {
                        "en": "Yaa Daawoodu innaa ja'alnaaka khaleefatan fil ardi fahkum bainan naasi bilhaqqi wa laa tattabi'il hawaa fayudillaka 'an sabeelil laah; innal lazeena yadilloona 'an sabeelil laah; lahum 'azaabun shadeedum bimaa nasoo Yawmal Hisaab"
                    }
                },
                "translation": {
                    "en": "[We said], \"O David, indeed We have made you a successor upon the earth, so judge between the people in truth and do not follow [your own] desire, as it will lead you astray from the way of Allah.\" Indeed, those who go astray from the way of Allah will have a severe punishment for having forgotten the Day of Account.",
                    "id": "(Allah berfirman), “Wahai Dawud! Sesungguhnya engkau Kami jadikan khalifah (penguasa) di bumi, maka berilah keputusan (perkara) di antara manusia dengan adil dan janganlah engkau mengikuti hawa nafsu, karena akan menyesatkan engkau dari jalan Allah. Sungguh, orang-orang yang sesat dari jalan Allah akan mendapat azab yang berat, karena mereka melupakan hari perhitungan.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3996",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3996.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3996.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Karena ketaatan, kebijaksanaan, dan ilmunya yang luas, Allah memilih Nabi Dawud sebagai khalifah, “Wahai Nabi Dawud! Sesungguhnya engkau telah Kami jadikan khalifah dan penguasa di bumi. Karena itu, hiasilah kekuasaanmu dengan kesopanan dan tunduk pada aturan Kami. Maka berilah keputusan tentang suatu perkara yang terjadi di antara manusia dengan adil dan mengacu pada wahyu Kami, dan janganlah engkau mengikuti hawa nafsu dalam menjalankan amanah Kami karena hawa nafsu akan menyesatkan engkau dari jalan Allah dan menggiringmu jauh dari kebenaran.” Sungguh, orang-orang yang sesat dari jalan Allah akibat mengikuti hawa nafsu akan mendapat azab yang berat dan pedih di akhirat. Yang demikian itu karena mereka melupakan hari perhitungan, hari ketika perbuatan manusia dihisab. Ayat ini menunjukkan bahwa seorang pemimpin harus bersikap adil, amanah, dan mendahulukan kepentingan umum daripada kepentingan pribadi.",
                        "long": "Pada ayat ini, Allah menjelaskan pengangkatan Nabi Daud sebagai penguasa dan penegak hukum di kalangan rakyatnya. Allah menyatakan bahwa dia mengangkat Daud sebagai penguasa yang memerintah kaumnya. Pengertian penguasa diungkapkan dengan khalifah, yang artinya pengganti, adalah sebagai isyarat agar Daud dalam menjalankan kekuasaannya selalu dihiasi dengan sopan-santun yang baik, yang diridai Allah, dan dalam melaksanakan peraturan hendaknya berpedoman kepada hidayah Allah. Dengan demikian, sifat-sifat khalifah Allah tercermin pada diri pribadinya. Rakyatnya pun tentu akan menaati segala peraturannya dan tingkah lakunya yang patut diteladani.\n\nSelanjutnya Allah menjelaskan bahwa Dia menyuruh Nabi Daud agar memberi keputusan terhadap perkara yang terjadi antara manusia dengan keputusan yang adil dengan berpedoman pada wahyu yang diturunkan kepadanya. Dalam wahyu itu terdapat hukum yang mengatur kesejahteraan manusia di dunia dan kebahagiaan mereka di akhirat. Oleh sebab itu Allah melarang Nabi Daud memperturutkan hawa nafsunya dalam melaksanakan segala macam urusan yang berhubungan dengan kesejahteraan dan kebahagiaan manusia di dunia dan akhirat.\n\nPada ayat ini terdapat isyarat yang menunjukkan pengangkatan Daud sebagai rasul dan tugas-tugas apa yang seharusnya dilakukan oleh seorang rasul yang mengandung pelajaran bagi para pemimpin sesudahnya dalam melaksanakan kepemimpinannya.\n\nPada akhir ayat Allah menjelaskan akibat dari orang yang memperturutkan hawa nafsu dan hukuman apa yang pantas dijatuhkan kepadanya.\n\nMemperturutkan hawa nafsu menyebabkan seseorang kehilangan kesadaran. Dengan demikian, ia akan kehilangan kontrol pribadi sehingga ia tersesat dari jalan yang diridai Allah. Kemudian apabila kesesatan itu telah menyelubungi hati seseorang, ia lupa akan keyakinan yang melekat dalam hatinya bahwa di atas kekuasaannya masih ada yang lebih berkuasa. Itulah sebabnya orang yang memperturutkan hawa nafsu itu diancam dengan ancaman yang keras, yang akan mereka rasakan deritanya di hari pembalasan, hari diperhitungkannya seluruh amal manusia guna diberi balasan yang setimpal."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3997,
                    "inSurah": 27
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا خَلَقْنَا السَّمَاءَ وَالْأَرْضَ وَمَا بَيْنَهُمَا بَاطِلًا ۚ ذَٰلِكَ ظَنُّ الَّذِينَ كَفَرُوا ۚ فَوَيْلٌ لِّلَّذِينَ كَفَرُوا مِنَ النَّارِ",
                    "transliteration": {
                        "en": "Wa ma khalaqnas samaaa'a wal arda wa maa bainahumaa baatilaa; zaalika zannul lazeena kafaroo; fawi lul lillazeena kafaroo minan Naar"
                    }
                },
                "translation": {
                    "en": "And We did not create the heaven and the earth and that between them aimlessly. That is the assumption of those who disbelieve, so woe to those who disbelieve from the Fire.",
                    "id": "Dan Kami tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya dengan sia-sia. Itu anggapan orang-orang kafir, maka celakalah orang-orang yang kafir itu karena mereka akan masuk neraka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3997",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3997.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3997.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Usai menegaskan adanya hari perhitungan, Allah beralih menjelas-kan bukti-bukti kekuasaan-Nya di jagat raya. Dan sungguh, Kami tidak serta-merta menciptakan langit dan bumi dan apa yang ada di antara keduanya, seperti bintang, matahari, dan bulan, dengan sia-sia dan tanpa manfaat tertentu (Lihat pula: Surah ad-Dukhàn/44: 38–39). Itu semua adalah anggapan orang-orang kafir yang tidak memercayai kekuasaan Allah, maka celakalah orang-orang yang kafir itu karena mereka akan masuk ke neraka yang telah Allah persiapkan untuk mereka.",
                        "long": "Allah menjelaskan bahwa Dia menjadikan langit, bumi, dan makhluk apa saja yang berada di antaranya, tidak sia-sia. Langit dengan segala bintang yang menghiasi, matahari yang memancarkan sinarnya di waktu siang, dan bulan yang menampakkan bentuknya yang berubah-ubah dari malam ke malam, sangat bermanfaat bagi manusia. Begitu juga bumi dengan segala isinya, baik yang tampak di permukaan ataupun yang tersimpan dalam perutnya, sangat besar artinya bagi kehidupan manusia. Semua itu diciptakan Allah atas kekuasaan dan kehendak-Nya sebagai rahmat yang tak ternilai harganya. \n\nApabila orang mau memperhatikan dengan seksama terhadap makhluk-makhluk yang ada di jagat raya ini, pasti ia mengetahui bahwa semua makhluk yang ada itu tunduk dan taat pada ketentuan-ketentuan yang berlaku, yang tak bisa dihindari. Begitu juga dalam hal penciptaan manusia. Mereka ini tidak dapat melepaskan diri dari ketentuan-ketentuan Allah, begitu lahir sudah tunduk pada gaya tarik bumi, ia bernafas dengan zat asam dan sebagainya. Tidak pernah ada manusia yang menyimpang dari ketentuan ini. Apabila ia dewasa, ia memerlukan kawan hidup untuk mengisi kekosongan jiwanya, dan untuk melaksanakan tujuan hidupnya ia mengembangkan keturunan. Kemudian kalau ajal telah datang, ia kembali ke asalnya. Ia akan dihidupkan kembali di akhirat, guna mempertanggungjawabkan segala amalnya ketika hidup di dunia.\n\nAllah berfirman:\n\nDan takutlah pada hari (ketika) kamu semua dikembalikan kepada Allah. Kemudian setiap orang diberi balasan yang sempurna sesuai dengan apa yang telah dilakukannya, dan mereka tidak dizalimi (dirugikan). (al-Baqarah/2: 281)\n\nJika manusia berpikir dengan jernih dan sungguh-sungguh, tentu akan mengakui keesaan dan kekuasaan Allah terhadap semua yang ada di langit, bumi, serta segala makhluk yang ada di antara keduanya. Apabila manusia mengakui kemahakuasaan Allah, tentulah akan mengakui pula kekuasaan-Nya menurunkan wahyu kepada hamba pilihan-Nya.\n\nLalu Allah menjelaskan sikap orang-orang kafir Mekah. Mereka tidak mau memperhatikan tanda-tanda kekuasaan Allah yang ada di langit dan bumi, dan juga tidak mau meneliti tanda kebesaran Allah yang ada pada diri mereka sendiri. Itulah sebabnya mereka mendustakan keesaan Allah dan hari kebangkitan.\n\nAllah berfirman:\n\nDan tidaklah Kami bermain-main menciptakan langit dan bumi dan apa yang ada di antara keduanya. Tidaklah Kami ciptakan keduanya melainkan dengan haq (benar), tetapi kebanyakan mereka tidak mengetahui. (ad-Dukhan/44: 38-39)\n\nDan firman-Nya:\n\nMaka apakah kamu mengira, bahwa Kami menciptakan kamu main-main (tanpa ada maksud) dan bahwa kamu tidak akan dikembalikan kepada Kami? (al-Mu'minun/23: 115)\n\nPada penghujung ayat, Allah menegaskan bahwa mereka akan mendapatkan kenyataan yang berbeda dengan apa yang mereka duga selama hidup di dunia. Mereka akan merasakan neraka wail yang memang disediakan sebagai azab bagi mereka, sebagai balasan yang setimpal atas keingkaran mereka terhadap keesaan Allah, kebenaran wahyu, dan terjadinya hari kebangkitan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3998,
                    "inSurah": 28
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمْ نَجْعَلُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ كَالْمُفْسِدِينَ فِي الْأَرْضِ أَمْ نَجْعَلُ الْمُتَّقِينَ كَالْفُجَّارِ",
                    "transliteration": {
                        "en": "Am naj'alul lazeena aamanoo wa 'amilus saalihaati kalmufisdeena fil ardi am naj'alul muttaqeena kalfujjaar"
                    }
                },
                "translation": {
                    "en": "Or should we treat those who believe and do righteous deeds like corrupters in the land? Or should We treat those who fear Allah like the wicked?",
                    "id": "Pantaskah Kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan sama dengan orang-orang yang berbuat kerusakan di bumi? Atau pantaskah Kami menganggap orang-orang yang bertakwa sama dengan orang-orang yang jahat?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3998",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3998.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3998.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah menegaskan perbedaan perlakuan-Nya kepada orang beriman dan orang kafir. Pantaskah Kami memperlakukan orang-orang yang beriman dan mengerjakan kebajikan serta percaya akan keesaan Kami sama dengan orang-orang yang berbuat kerusakan di bumi dan tidak mau mengikuti petunjuk Kami? Atau pantaskah Kami menganggap orang-orang yang bertakwa dan patuh pada perintah Kami sama dengan orang-orang yang jahat, ingkar, dan sombong?",
                        "long": "Pada ayat ini, Allah menjelaskan bahwa di antara kebijaksanaan-Nya ialah tidak menganggap sama para hamba-Nya yang melakukan kebaikan, dengan orang-orang yang terjerumus ke dalam lembah kemaksiatan. Tidak patut bagi zat Allah dengan segala keagungan-Nya, apabila menganggap sama antara hamba-hamba-Nya yang beriman dan melakukan kebaikan dengan orang-orang yang mengingkari keesaan-Nya lagi memperturutkan hawa nafsunya.\n\nOrang-orang yang beriman yang dimaksud dalam ayat ini ialah orang-orang yang meyakini bahwa Allah Maha Esa, tidak memerlukan sekutu dalam melaksanakan kekuasaan dan kehendak-Nya. Atas keyakinan itulah mereka menyadari dan melaksanakan apa yang seharusnya diperbuat terhadap sesamanya dan kepada Penciptanya. Dengan keyakinan itu pula, mereka menaati perintah Khaliknya yang disampaikan melalui rasul-Nya dan menjauhi segala larangan-Nya. Mereka selalu berusaha keras memelihara kebersihan jiwanya dari noda-noda yang mengotorinya.\n\nAllah berfirman:\n\nDan akan dijauhkan darinya (neraka) orang yang paling bertakwa, yang menginfakkan hartanya (di jalan Allah) untuk membersihkan (dirinya), dan tidak ada seorang pun memberikan suatu nikmat padanya yang harus dibalasnya. (al-Lail/92: 17-19)\n\nSedang yang dimaksud dengan orang yang berbuat kerusakan di muka bumi ialah orang yang tidak mau mengikuti kebenaran dan selalu memperturutkan hawa nafsunya. Mereka ini tidak mau mengakui keesaan Allah, kebenaran wahyu, dan terjadinya hari kebangkitan dan pembalasan. Oleh karena itu, mereka yang jauh dari rahmat Allah, berani melanggar larangan-larangan-Nya. Mereka tidak meyakini bahwa mereka akan dibangkitkan kembali dari kuburnya, mereka tetap akan dihimpun di Padang Mahsyar untuk mempertanggungjawabkan amal perbuatannya.\n\nAllah berfirman:\n\nDan setiap manusia telah Kami kalungkan (catatan) amal perbuatannya di lehernya. Dan pada hari Kiamat Kami keluarkan baginya sebuah kitab dalam keadaan terbuka. \"Bacalah kitabmu, cukuplah dirimu sendiri pada hari ini sebagai penghitung atas dirimu.\" (al-Isra'/17: 13-14)\n\nApabila ada di antara hamba Allah yang diberi pahala karena amal baiknya di dunia, dan disiksa akibat amal buruknya, hal itu sesuai dengan hikmat dan kebijaksanaan Allah. Dia telah memberikan akal agar mereka dapat mengetahui betapa luasnya nikmat Allah yang telah diberikan kepada mereka. Akan tetapi, mereka tidak mau mempergunakan akal itu sebaik-baiknya, sehingga mereka tidak mensyukuri nikmat itu, bahkan mereka mengingkarinya. Allah juga telah mengutus rasul-Nya untuk membimbing mereka kepada jalan yang benar. Petunjuk dan bimbingan rasul itu bukan saja tidak mereka hiraukan, tetapi malah mereka dustakan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 3999,
                    "inSurah": 29
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "كِتَابٌ أَنزَلْنَاهُ إِلَيْكَ مُبَارَكٌ لِّيَدَّبَّرُوا آيَاتِهِ وَلِيَتَذَكَّرَ أُولُو الْأَلْبَابِ",
                    "transliteration": {
                        "en": "Kitaabun anzalnaahu ilaika mubaarakul liyaddabbarooo Aayaatihee wa liyatazakkara ulul albaab"
                    }
                },
                "translation": {
                    "en": "[This is] a blessed Book which We have revealed to you, [O Muhammad], that they might reflect upon its verses and that those of understanding would be reminded.",
                    "id": "Kitab (Al-Qur'an) yang Kami turunkan kepadamu penuh berkah agar mereka menghayati ayat-ayatnya dan agar orang-orang yang berakal sehat mendapat pelajaran."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/3999",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/3999.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/3999.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Wahai Nabi Muhammad, sesungguhnya kitab Al-Qur’an yang telah Kami turunkan kepadamu adalah kitab yang penuh berkah. Kami menurunkannya agar mereka menghayati dan memahami ayat-ayatnya dan agar orang-orang yang berakal sehat menggunakan akal budinya untuk mendapat pelajaran darinya dan mengamalkan kandungannya.",
                        "long": "Allah menjelaskan bahwa Dia telah menurunkan Al-Qur'an kepada Rasulullah saw dan para pengikutnya. Al-Qur'an itu adalah kitab yang sempurna mengandung bimbingan yang sangat bermanfaat kepada umat manusia. Bimbingan itu menuntun manusia agar hidup sejahtera di dunia dan berbahagia di akhirat. Dengan merenungkan isinya, manusia akan menemukan cara-cara mengatur kemaslahatan hidup di dunia. Tamsil ibarat dan kisah dari umat terdahulu menjadi pelajaran dalam menempuh tujuan hidup mereka dan menjauhi rintangan dan hambatan yang menghalangi pencapaian tujuan hidup. Al-Qur'an itu diturunkan dengan maksud agar direnungkan kandungan isinya, kemudian dipahami dengan pengertian yang benar, lalu diamalkan sebagaimana mestinya. Pengertian yang benar diperoleh dengan jalan mengikuti petunjuk-petunjuk rasul, dengan dibantu ilmu pengetahuan yang dimiliki, baik yang berhubungan dengan bahasa ataupun perkembangan masyarakat. Begitu pula dalam mendalami petunjuk-petunjuk yang terdapat dalam kitab itu, hendaknya dilandasi tuntunan rasul serta berusaha untuk menyemarakkan pengalamannya dengan ilmu pengetahuan hasil pengalaman dan pemikiran mereka.\n\nAl-hasan al-Bashri menjelaskan pengertian ayat ini dengan mengatakan, \"Banyak hamba Allah dan anak-anak yang tidak mengerti makna Al-Qur'an, walaupun telah membacanya di luar kepala. Mereka ini hafal betul hingga tak satu pun huruf yang ketinggalan. Namun mereka mengabaikan ketentuan-ketentuan Al-Qur'an itu hingga salah seorang di antara mereka mengatakan, \"Demi Allah saya telah membaca Al-Qur'an, hingga tak satu huruf pun yang kulewatkan.\" Sebenarnya orang yang seperti itu telah melewatkan Al-Qur'an seluruhnya, karena pengaruh Al-Qur'an tidak tampak pada dirinya, baik pada budi pekerti maupun pada perbuatannya. Demi Allah, apa gunanya ia menghafal setiap hurufnya, selama mereka mengabaikan ketentuan-ketentuan Allah. Mereka itu bukan ahli hikmat dan ahli pemberi pengajaran. Semoga Allah tidak memperbanyak jumlah orang yang seperti itu.\"\n\nIbnu Mas'ud mengatakan:Orang-orang di antara kami apabila belajar sepuluh ayat Al-Qur'an, mereka tidak pindah ke ayat lain, sampai memahami kandungan sepuluh ayat tersebut dan mengamalkan isinya.(Riwayat A.hmad)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4000,
                    "inSurah": 30
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَوَهَبْنَا لِدَاوُودَ سُلَيْمَانَ ۚ نِعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ",
                    "transliteration": {
                        "en": "Wa wahabnaa li Daawooda Sulaimaan; ni'mal 'abd; innahoo awwaab"
                    }
                },
                "translation": {
                    "en": "And to David We gave Solomon. An excellent servant, indeed he was one repeatedly turning back [to Allah].",
                    "id": "Dan kepada Dawud Kami karuniakan (anak bernama) Sulaiman; dia adalah sebaik-baik hamba. Sungguh, dia sangat taat (kepada Allah)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4000",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4000.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4000.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan tidak hanya anugerah ilmu pengetahuan dan kenabian, kepada Nabi Dawud Kami karuniakan pula seorang putra yang mengikuti jejak dan perjuangannya, yaitu Nabi Sulaiman. Dia adalah sebaik-baik hamba yang selalu beribadah dan bersyukur. Sungguh, dia sangat taat pada perintah Allah.",
                        "long": "Allah menjelaskan bahwa di samping Daud yang dianugerahi kemuliaan dan kekuasaan, dia juga dianugerahi putra yang saleh, yang mempunyai kemampuan melanjutkan perjuangannya, yaitu Sulaiman. Ia mewarisi sifat-sifat ayahnya. Ia terkenal sebagai hamba yang taat beribadah dan dalam segala urusan ia selalu bersyukur kepada Allah. Ia yakin bahwa segala macam kenikmatan dan keindahan itu terwujud hanyalah semata-mata karena limpahan rahmat Allah dan karunia-Nya. Itulah sebabnya ia disebut sebagai hamba Allah yang paling baik, dan sebagai pujian yang pantas diberikan kepadanya. Allah menyifatinya sebagai hamba-Nya yang amat taat kepada-Nya. Dengan demikian Allah mengangkat Nabi Sulaiman menjadi nabi penerus kenabian dan kerajaan Nabi Daud, serta mewarisi ilmu pengetahuannya yang tertuang dalam Kitab Zabur.\n\nAllah berfirman:\n\nDan Sulaiman telah mewarisi Daud. (an-Naml/27: 16)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4001,
                    "inSurah": 31
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِذْ عُرِضَ عَلَيْهِ بِالْعَشِيِّ الصَّافِنَاتُ الْجِيَادُ",
                    "transliteration": {
                        "en": "Iz 'urida 'alaihi bil'ashiy yis saafinaatul jiyaad"
                    }
                },
                "translation": {
                    "en": "[Mention] when there were exhibited before him in the afternoon the poised [standing] racehorses.",
                    "id": "(Ingatlah) ketika pada suatu sore dipertunjukkan kepadanya (kuda-kuda) yang jinak, (tetapi) sangat cepat larinya,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4001",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4001.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4001.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ingatlah karunia kami kepada Nabi Sulaiman, yaitu ketika pada suatu sore, antara asar dan magrib, dipertunjukkan kepadanya kekayaan dan kuda-kuda yang jinak dan tangkas serta memiliki kaki yang kuat sehingga sangat cepat larinya,",
                        "long": "Allah menyebutkan salah satu di antara peristiwa yang dihadapi Sulaiman, yang menyebabkan dia pantas mendapat pujian. Peristiwa itu terjadi pada saat beliau memeriksa pasukan berkuda yang biasanya dilakukan pada sore hari. Kuda-kuda itu dilatih agar dapat diketahui ketangkasan dan kemampuan geraknya sehingga memungkinkan untuk dibawa dalam medan pertempuran. Juga dilatih kemampuannya untuk mengurangi kecepatannya atau berhenti seketika dan ditingkatkan daya tahannya menghadapi serangan-serangan mendadak. Kuda-kuda itu dilatih sedemikian rupa agar dapat dikendalikan sesuai dengan taktik yang dikehendaki oleh pasukan yang mengendarainya. Ketangkasan kuda ikut menentukan berhasil tidaknya pasukan dalam menguasai medan perang dan mematahkan serangan musuh"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4002,
                    "inSurah": 32
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَقَالَ إِنِّي أَحْبَبْتُ حُبَّ الْخَيْرِ عَن ذِكْرِ رَبِّي حَتَّىٰ تَوَارَتْ بِالْحِجَابِ",
                    "transliteration": {
                        "en": "Faqaala inneee ahbabtu hubbal khairi 'an zikri Rabbee hattaa tawaarat bilhijaab"
                    }
                },
                "translation": {
                    "en": "And he said, \"Indeed, I gave preference to the love of good [things] over the remembrance of my Lord until the sun disappeared into the curtain [of darkness].\"",
                    "id": "maka dia berkata, “Sesungguhnya aku menyukai segala yang baik (kuda), yang membuat aku ingat akan (kebesaran) Tuhanku, sampai matahari terbenam.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4002",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4002.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4002.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "maka ketika itu dia berkata, “Sesungguhnya aku menyukai segala sesuatu yang baik, yaitu kuda dan harta kekayaan, yang membuat aku selalu ingat akan kebesaran Tuhanku.” Nabi Sulaiman menyaksikan dan mengawasi pertunjukan itu sampai matahari terbenam.",
                        "long": "Kemudian Allah menjelaskan keadaan Sulaiman pada saat menyaksikan latihan kuda itu. Ia mengatakan bahwa ia menyukai kuda karena sangat berguna untuk digunakan sebagai alat menegakkan kebenaran dan membela agama Allah. Kesenangannya melatih kuda itu sedemikian dalamnya, sehingga tiap sore hari ia mengunjungi tempat latihan kuda hingga matahari terbenam di ufuk langit bagian barat yaitu hingga cahaya matahari mulai sirna, dan gelapnya malam menghalangi pemandangannya untuk menyaksikan latihan itu. Pada saat-saat itulah terjadi pergolakan dalam dirinya, kepentingan manakah yang harus didahulukan di antara kedua kepentingan. Kepentingan pertama ialah kesadaran jiwanya untuk beribadah kepada Allah. Sedangkan kepentingan kedua ialah melatih kuda untuk kepentingan menegakkan kebenaran dan membela kalimat tauhid. Dalam keadaan seperti itu, ia menyadari bahwa apabila ia menyaksikan latihan berkuda itu hingga larut malam, berarti ia mengabaikan ibadah yang harus ia lakukan.\n\nPada ayat ini tidak dijelaskan secara terperinci apakah kesenangan Sulaiman memeriksa latihan kuda itu menyebabkan ia kehilangan waktu untuk melakukan ibadah atau tidak. Begitu pula tidak diterangkan mana yang didahulukan oleh Sulaiman, memeriksa latihan kuda atau melaksanakan ibadah. Namun yang dapat dipahami dari ayat tersebut ialah pada saat dia asyik menyaksikan latihan kuda, terbetiklah dalam hatinya kesadaran beribadah kepada Allah, apabila keasyikannya itu dituruti, niscaya berlarut-larut hingga kehilangan kesempatan untuk bermunajat dengan Allah. Maka pengertian yang patut diambil dari ayat ini ialah, pergolakan yang terjadi pada diri Sulaiman itu ialah penyesalan karena tidak melakukan ibadah kepada Allah pada awal waktunya, karena sibuk menyaksikan latihan kuda. Kemudian ia sadar dan melaksanakannya di akhir waktu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4003,
                    "inSurah": 33
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "رُدُّوهَا عَلَيَّ ۖ فَطَفِقَ مَسْحًا بِالسُّوقِ وَالْأَعْنَاقِ",
                    "transliteration": {
                        "en": "Ruddoohaa 'alaiya fatafiqa masham bissooqi wal a'naaq"
                    }
                },
                "translation": {
                    "en": "[He said], \"Return them to me,\" and set about striking [their] legs and necks.",
                    "id": "”Bawalah semua kuda itu kembali kepadaku.” Lalu dia mengusap-usap kaki dan leher kuda itu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4003",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4003.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4003.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Lalu Nabi Sulaiman berkata kepada pelatih kuda, “Bawalah semua kuda itu kembali kepadaku.” Lalu dia pun mengusap-usap kaki dan leher kuda itu sebagai wujud syukurnya kepada Allah.",
                        "long": "Pada ayat ini, Allah menjelaskan apa yang diperintahkan Sulaiman kepada para pelatih kudanya. Ia menyuruh pelatihnya agar kuda-kuda itu dibawa kembali kepadanya. Setelah pelatih itu membawa kuda kepadanya, ia pun mendekati. Lalu ia mengusap kaki dan leher kuda sebagai tanda kepuasan Sulaiman terhadap hasil gemilang yang dicapai kuda-kuda itu. Dengan demikian kuda itu dapat dipergunakan dalam peperangan untuk menggempur musuh atau untuk mengelakkan serangan-serangan musuh yang datang secara mendadak.\n\nDari uraian tersebut dapat dikatakan bahwa Sulaiman hamba Allah yang saleh, taat beribadah, teliti, dan cermat merencanakan perjuangan untuk menegakkan kalimat tauhid serta mempunyai kesadaran yang tinggi dalam saat-saat menentukan mana yang lebih penting dari yang penting."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4004,
                    "inSurah": 34
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَقَدْ فَتَنَّا سُلَيْمَانَ وَأَلْقَيْنَا عَلَىٰ كُرْسِيِّهِ جَسَدًا ثُمَّ أَنَابَ",
                    "transliteration": {
                        "en": "Wa laqad fatannaa Sulaimaana wa alqainaa 'alaa kursiyyihee jasadan summa anaab"
                    }
                },
                "translation": {
                    "en": "And We certainly tried Solomon and placed on his throne a body; then he returned.",
                    "id": "Dan sungguh, Kami telah menguji Sulaiman dan Kami jadikan (dia) tergeletak di atas kursinya sebagai tubuh (yang lemah karena sakit), kemudian dia bertobat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4004",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4004.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4004.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan Kami tidak hanya mencurahkan karunia kepada Nabi Sulaiman. Sungguh, Kami pun telah menguji Nabi Sulaiman dengan penyakit yang menyebabkan hilangnya kekuatan yang dimilikinya, dan karena itu Kami jadikan dia hanya mampu tergeletak di atas kursinya sebagai tubuh yang lemah tak berdaya, kemudian dia pun menyadari kelalaiannya dan bertobat kepada Allah.",
                        "long": "Kemudian Allah menjelaskan keadaan Sulaiman pada saat mendapat cobaan dan keadaannya setelah selesai menghadapi cobaan itu. Allah mencobanya dengan menimpakan sakit keras. Demikian hebatnya serangan penyakitnya itu hingga kehilangan kekuatan sama sekali. Badannya lemah lunglai tergeletak di atas kursinya seolah-olah tak bernyawa lagi.\n\nAbu Hurairah meriwayatkan bahwa Nabi saw bersabda: \n\nNabi Sulaiman berkata, \"Saya akan berkeliling malam ini untuk mengumpuli sembilan puluh istri, semuanya nanti akan melahirkan anak yang mahir menunggang kuda dan berjihad fi sabilillah\". Maka seorang sahabatnya berkata kepadanya. \"Katakan insya Allah\", tetapi Nabi Sulaiman tidak mengatakan insya Allah. Nabi Sulaiman kemudian mengumpuli istri-istrinya itu semua, tetapi tidak ada yang hamil dari mereka kecuali seorang istri, yang kemudian melahirkan anak yang tidak sempurna. Demi Zat yang menguasai diri Muhammad, \"Seandainya Nabi Sulaiman mengatakan insya Allah, niscaya semua istrinya melahirkan anak-anak yang mahir menunggang kuda dan berjihad fi sabilillah\".(Riwayat al-Bukhari dan Muslim dari Abu Hurairah) \n\nKeterangan lain menjelaskan bahwa yang dimaksud dengan cobaan itu ialah berkenaan dengan keinginan Nabi Sulaiman mendatangi sembilan puluh istrinya dalam satu malam dan setiap istrinya melahirkan seorang penunggang kuda. Namun, ia tidak mengucapkan insya Allah, sehingga Allah mengujinya dengan cobaan tidak ada yang melahirkan kecuali hanya satu orang dan melahirkan bayi lumpuh setengah badan dan diletakkan di atas kursi Nabi Sulaiman.\n\nDi saat-saat menerima cobaan seperti itu, ia selalu memanjatkan harapannya kepada Allah serta penyerahan dirinya menerima cobaan itu dengan ikhlas. Pada penghujung ayat, Allah menegaskan bahwa Sulaiman lalu bertobat meminta ampun atas kelemahan-kelemahan yang ada pada dirinya serta berserah diri kepada Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4005,
                    "inSurah": 35
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالَ رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ",
                    "transliteration": {
                        "en": "Qaala Rabbigh fir lee wa hab lee mulkal laa yambaghee li ahadim mim ba'de inaka Antal Wahhab"
                    }
                },
                "translation": {
                    "en": "He said, \"My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me. Indeed, You are the Bestower.\"",
                    "id": "Dia berkata, “Ya Tuhanku, ampunilah aku dan anugerahkanlah kepadaku kerajaan yang tidak dimiliki oleh siapa pun setelahku. Sungguh, Engkaulah Yang Maha Pemberi.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4005",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4005.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4005.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dalam tobatnya dia berkata, “Ya Tuhanku, ampunilah aku dari dosa-dosaku yang menyebabkan Engkau menimpakan cobaan ini kepadaku, dan anugerahkanlah kepadaku kerajaan agung yang tidak akan dimiliki oleh siapa pun setelahku. Sungguh, Engkaulah Yang Maha Pemberi lagi Maha Pemurah.”",
                        "long": "Allah lalu menjelaskan bahwa setelah Sulaiman sembuh dari sakitnya, ia menyadari kelemahan yang ada pada dirinya. Ia telah memilih hal yang kurang penting. Dia telah kehilangan waktu yang utama untuk melakukan ibadah karena menyaksikan latihan kuda.\n\nLalu Nabi Sulaiman berdoa kepada Allah agar dianugerahi kerajaan yang tidak ada tandingannya, yang tak akan dimiliki oleh seorang jua pun sesudahnya. Dalam hadis Nabi saw diriwayatkan:\n\nBahwa Nabi saw berkata: Bahwa Ifrit dari golongan jin meludahi aku tadi malam agar aku membatalkan salatku namun Allah memberikan kekuatan kepadaku sehingga aku dapat menangkap jin itu. Aku bermaksud untuk mengikatnya di satu tiang dari tiang-tiang masjid sehingga kamu dapat melihatnya. Tapi aku teringat doa saudaraku Sulaiman, \"Ya Allah ampunilah aku, dan berilah aku kekuatan yang tidak layak untuk diberikan kepada orang sesudahku\". Maka aku usir dia untuk menjauh.(Riwayat al-Bukhari dan Muslim) \n\nNabi Sulaiman dibesarkan dalam lingkungan kerajaan dan kenabian. Sejak kecil ia terlatih sebagai seorang anak dari seorang raja dan nabi. Sulaiman pun mewarisi kemampuan keduanya dan Allah juga menganugerahkan kepadanya kemampuan itu. Itulah sebabnya maka Allah menganugerahkan kepadanya kerajaan yang sangat kuat dan kekayaan yang berlimpah ruah, yang tiada tandingannya.\n\nDi akhir ayat Allah menyebutkan alasan yang dikemukakan Sulaiman dalam doanya yaitu karena Allah benar-benar akan mengabulkan doa setiap orang yang disertai usaha dan syarat kemampuan yang dimiliki sesuai dengan kehendak-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4006,
                    "inSurah": 36
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَسَخَّرْنَا لَهُ الرِّيحَ تَجْرِي بِأَمْرِهِ رُخَاءً حَيْثُ أَصَابَ",
                    "transliteration": {
                        "en": "Fasakhkharnaa lahur reeha tajree bi amrihee rukhaaa'an haisu asaab"
                    }
                },
                "translation": {
                    "en": "So We subjected to him the wind blowing by his command, gently, wherever he directed,",
                    "id": "Kemudian Kami tundukkan kepadanya angin yang berhembus dengan baik menurut perintahnya ke mana saja yang dikehendakinya,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4006",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4006.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4006.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah menerima tobat dan doa Nabi Sulaiman, kemudian Kami tundukkan kepadanya angin yang berembus dengan baik maupun dengan kencang menurut perintahnya, berembus ke mana saja yang dikehendakinya sehingga dia dapat menempuh perjalanan jauh hanya dalam sekejap.",
                        "long": "Pada ayat ini, Allah menjelaskan beberapa nikmat yang diberikan kepada Nabi Sulaiman, sebagai jawaban dari pada doanya. Pertama: Allah menganugerahkan kepada Sulaiman kekuasaan menundukkan angin. Atas izin Allah, angin berhembus dengan kencang atau gemulai menurut kehendaknya pula.\n\nAllah berfirman:\n\nDan (Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang Kami beri berkah padanya. Dan Kami Maha Mengetahui segala sesuatu. (al-Anbiya'/21: 81)\n\nKedua: Allah menganugerahkan kepadanya kemampuan menundukkan setan-setan yang ahli bangunan dan ahli menyelam, yang melakukan tugas sesuai dengan perintah Sulaiman. Apabila ia memerintahkan kepada mereka membangun suatu bangunan seperti gedung-gedung pertemuan istana, benteng pertahanan, atau gedung-gedung tempat menyimpan harta kekayaan Sulaiman dan lain-lain, maka tugas itu dapat mereka selesaikan dalam waktu yang sangat singkat. Apabila Sulaiman memerintahkan mereka untuk mengumpulkan mutiara dan marjan serta kekayaan laut lainnya, tugas itu dapat diselesaikan dengan cepat pula.\n\nKetiga: Allah menganugerahkan kepadanya kekuasaan menundukkan setan yang menentang perintahnya. Tangan dan kaki mereka terikat dalam belenggu, agar tidak berbahaya kepada yang lain, dan sebagai hukuman atas pembangkangannya.\n\nKekuasaan yang diberikan Allah kepada Sulaiman untuk menundukkan setan maksudnya adalah kekuasaan untuk menggerakkan mereka melakukan tugas-tugas berat, yaitu tugas membangun gedung-gedung, dan menyelam mengeluarkan kekayaan laut. Namun tidak ada keterangan secara pasti mengenai bagaimana Sulaiman membelenggu setan itu. Sikap yang paling utama ialah kita menerima keterangan yang terdapat dalam Al-Qur'an dan untuk mengungkapkan pengertiannya, kita serahkan kepada ilmu pengetahuan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4007,
                    "inSurah": 37
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالشَّيَاطِينَ كُلَّ بَنَّاءٍ وَغَوَّاصٍ",
                    "transliteration": {
                        "en": "Wash Shayaateena kulla bannaaa'inw wa ghawwaas"
                    }
                },
                "translation": {
                    "en": "And [also] the devils [of jinn] - every builder and diver",
                    "id": "dan (Kami tundukkan pula kepadanya) setan-setan, semuanya ahli bangunan dan penyelam,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4007",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4007.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4007.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan Kami tundukkan pula untuknya setan-setan dan jin-jin, semuanya ahli bangunan dan penyelam. Mereka ahli membangun istana, gedung megah, tempat peribadatan, bahkan hiasan dari keramik seperti patung, cawan, teko, dan sebagainya; serta ahli mengambil berbagai perhiasan dari dasar laut, seperti mutiara dan marjan. Mereka tekun bekerja (Lihat pula: Surah al-Anbiyà’/21: 81–82; Saba’/34: 12–13),",
                        "long": "Pada ayat ini, Allah menjelaskan beberapa nikmat yang diberikan kepada Nabi Sulaiman, sebagai jawaban dari pada doanya. Pertama: Allah menganugerahkan kepada Sulaiman kekuasaan menundukkan angin. Atas izin Allah, angin berhembus dengan kencang atau gemulai menurut kehendaknya pula.\n\nAllah berfirman:\n\nDan (Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang Kami beri berkah padanya. Dan Kami Maha Mengetahui segala sesuatu. (al-Anbiya'/21: 81)\n\nKedua: Allah menganugerahkan kepadanya kemampuan menundukkan setan-setan yang ahli bangunan dan ahli menyelam, yang melakukan tugas sesuai dengan perintah Sulaiman. Apabila ia memerintahkan kepada mereka membangun suatu bangunan seperti gedung-gedung pertemuan istana, benteng pertahanan, atau gedung-gedung tempat menyimpan harta kekayaan Sulaiman dan lain-lain, maka tugas itu dapat mereka selesaikan dalam waktu yang sangat singkat. Apabila Sulaiman memerintahkan mereka untuk mengumpulkan mutiara dan marjan serta kekayaan laut lainnya, tugas itu dapat diselesaikan dengan cepat pula.\n\nKetiga: Allah menganugerahkan kepadanya kekuasaan menundukkan setan yang menentang perintahnya. Tangan dan kaki mereka terikat dalam belenggu, agar tidak berbahaya kepada yang lain, dan sebagai hukuman atas pembangkangannya.\n\nKekuasaan yang diberikan Allah kepada Sulaiman untuk menundukkan setan maksudnya adalah kekuasaan untuk menggerakkan mereka melakukan tugas-tugas berat, yaitu tugas membangun gedung-gedung, dan menyelam mengeluarkan kekayaan laut. Namun tidak ada keterangan secara pasti mengenai bagaimana Sulaiman membelenggu setan itu. Sikap yang paling utama ialah kita menerima keterangan yang terdapat dalam Al-Qur'an dan untuk mengungkapkan pengertiannya, kita serahkan kepada ilmu pengetahuan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4008,
                    "inSurah": 38
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَآخَرِينَ مُقَرَّنِينَ فِي الْأَصْفَادِ",
                    "transliteration": {
                        "en": "Wa aakhareena muqarraneena fil asfaad"
                    }
                },
                "translation": {
                    "en": "And others bound together in shackles.",
                    "id": "dan (setan) yang lain yang terikat dalam belenggu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4008",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4008.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4008.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "dan adapun setan yang lain yang tidak mematuhi perintahnya, mereka terikat dalam belenggu sehingga tidak mengganggu mereka yang bekerja.",
                        "long": "Pada ayat ini, Allah menjelaskan beberapa nikmat yang diberikan kepada Nabi Sulaiman, sebagai jawaban dari pada doanya. Pertama: Allah menganugerahkan kepada Sulaiman kekuasaan menundukkan angin. Atas izin Allah, angin berhembus dengan kencang atau gemulai menurut kehendaknya pula.\n\nAllah berfirman:\n\nDan (Kami tundukkan) untuk Sulaiman angin yang sangat kencang tiupannya yang berhembus dengan perintahnya ke negeri yang Kami beri berkah padanya. Dan Kami Maha Mengetahui segala sesuatu. (al-Anbiya'/21: 81)\n\nKedua: Allah menganugerahkan kepadanya kemampuan menundukkan setan-setan yang ahli bangunan dan ahli menyelam, yang melakukan tugas sesuai dengan perintah Sulaiman. Apabila ia memerintahkan kepada mereka membangun suatu bangunan seperti gedung-gedung pertemuan istana, benteng pertahanan, atau gedung-gedung tempat menyimpan harta kekayaan Sulaiman dan lain-lain, maka tugas itu dapat mereka selesaikan dalam waktu yang sangat singkat. Apabila Sulaiman memerintahkan mereka untuk mengumpulkan mutiara dan marjan serta kekayaan laut lainnya, tugas itu dapat diselesaikan dengan cepat pula.\n\nKetiga: Allah menganugerahkan kepadanya kekuasaan menundukkan setan yang menentang perintahnya. Tangan dan kaki mereka terikat dalam belenggu, agar tidak berbahaya kepada yang lain, dan sebagai hukuman atas pembangkangannya.\n\nKekuasaan yang diberikan Allah kepada Sulaiman untuk menundukkan setan maksudnya adalah kekuasaan untuk menggerakkan mereka melakukan tugas-tugas berat, yaitu tugas membangun gedung-gedung, dan menyelam mengeluarkan kekayaan laut. Namun tidak ada keterangan secara pasti mengenai bagaimana Sulaiman membelenggu setan itu. Sikap yang paling utama ialah kita menerima keterangan yang terdapat dalam Al-Qur'an dan untuk mengungkapkan pengertiannya, kita serahkan kepada ilmu pengetahuan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4009,
                    "inSurah": 39
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هَٰذَا عَطَاؤُنَا فَامْنُنْ أَوْ أَمْسِكْ بِغَيْرِ حِسَابٍ",
                    "transliteration": {
                        "en": "Haazaa 'ataaa'unaa famnun aw amsik bighairi hisaab"
                    }
                },
                "translation": {
                    "en": "[We said], \"This is Our gift, so grant or withhold without account.\"",
                    "id": "Inilah anugerah Kami; maka berikanlah (kepada orang lain) atau tahanlah (untuk dirimu sendiri) tanpa perhitungan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4009",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4009.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4009.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kami berikan kepada Nabi Sulaiman kerajaan, kekayaan, dan kekuasaan yang tidak Kami berikan kepada siapa pun sesudahnya. Inilah anugerah Kami yang agung kepadamu, wahai Nabi Sulaiman; maka berikanlah sebagian dari karunia itu kepada orang lain atau tahanlah untuk dirimu sendiri, tanpa perhitungan dan tuntutan atasmu sebagai aturan yang Kami khususkan untukmu.",
                        "long": "Allah selanjutnya menjelaskan bahwa segala macam nikmat itu adalah anugerah yang diberikan-Nya kepada Sulaiman secara khusus. Nikmat itu meliputi kerajaan yang besar, kekayaan yang berlimpah dan kekuasaan yang tak pernah diberikan kepada yang lain. Nikmat-nikmat itu dianugerahkan kepadanya agar digunakan sebagaimana mestinya.\n\nAllah menandaskan bahwa nikmat-nikmat itu diberikan kepada Sulaiman tanpa pertanggungjawaban, karena Sulaiman telah diberi kemampuan untuk mengendalikan segala macam nikmat itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4010,
                    "inSurah": 40
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 393,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِنَّ لَهُ عِندَنَا لَزُلْفَىٰ وَحُسْنَ مَآبٍ",
                    "transliteration": {
                        "en": "Wa inna lahoo 'indanaa lazulfaa wa husna ma-aab"
                    }
                },
                "translation": {
                    "en": "And indeed, for him is nearness to Us and a good place of return.",
                    "id": "Dan sungguh, dia mempunyai kedudukan yang dekat pada sisi Kami dan tempat kembali yang baik."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4010",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4010.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4010.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sungguh, Allah telah mengabulkan doanya dan memberi dia kemuliaan di dunia dengan mempunyai kedudukan yang dekat pada sisi Kami dan tempat kembali yang baik, yaitu surga.",
                        "long": "Kemudian Allah menjelaskan bahwa di samping kemuliaan yang telah dicapainya di dunia, yang sangat menakjubkan itu, ia akan dilimpahi karunia yang lebih nikmat lagi dan kedudukannya yang lebih mulia. Allah menjanjikan kepadanya bahwa ia akan dimasukkan dalam deretan hamba-hamba-Nya yang mempunyai kedudukan yang sangat dekat kepada Allah, yaitu kedudukan yang diperoleh para rasul dan nabi, tempat kembali yang baik yaitu surga Na'im yang penuh dengan segala macam kenikmatan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4011,
                    "inSurah": 41
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَاذْكُرْ عَبْدَنَا أَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَابٍ",
                    "transliteration": {
                        "en": "Wazkur 'abdanaaa Ayyoob; iz naada Rabbahooo annee massaniyash Shaitaanu binus binw wa 'azaab"
                    }
                },
                "translation": {
                    "en": "And remember Our servant Job, when he called to his Lord, \"Indeed, Satan has touched me with hardship and torment.\"",
                    "id": "Dan ingatlah akan hamba Kami Ayyub ketika dia menyeru Tuhannya, “Sesungguhnya aku diganggu setan dengan penderitaan dan bencana.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4011",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4011.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4011.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Cerita tentang Nabi Dawud dan Sulaiman yang diberi berbagai kenikmatan oleh Allah diikuti oleh kisah tentang Nabi Ayyub yang hidupnya penuh ujian dan cobaan. Dan ingatlah, wahai Nabi Muhammad, akan kisah salah seorang hamba Kami, yaitu Nabi Ayyub, yang sangat sabar dan taat kepada Allah. Dan ingatlah ketika dia mendapat ujian dan cobaan dari Allah, dia menyeru dan berdoa kepada Tuhannya, “Sesungguhnya aku diganggu setan dengan penderitaan, sakit menahun, dan bencana yang besar dengan hilangnya harta kekayaan dan anak keturunanku. Aku mengadu kepada-Mu karena Engkau Maha Penyayang.\" (Lihat pula: Surah al-Anbiyà’/21: 83).",
                        "long": "Allah memerintahkan kepada Rasulullah saw agar menceritakan kepada kaumnya kisah Ayub yang sangat sabar menghadapi cobaan hidup dan taat kepada Allah. Pada saat menghadapi cobaan yang sangat berat itu, ia berdoa kepada Allah dan mengadukan agar penderitaannya itu dihilangkan.\n\nBeberapa ahli tafsir menyebutkan bahwa Ayub adalah seorang nabi yang sangat kaya. Ia adalah seorang petani dan pemelihara ternak. Di samping itu, juga sebagai pemimpin kaumnya di sebuah negeri yang terletak di sebelah tenggara Laut Mati. Negerinya terletak di antara kota Adum dan padang pasir Arab, sangat subur, dialiri oleh mata air yang sangat banyak. Ia hidup di antara zaman Nabi Ibrahim dan Nabi Musa. Semula beliau hidup makmur dan bahagia, amat taat beragama, dan banyak sanak keluarganya. Ia sangat senang atas hasil usaha yang dicapainya, juga atas kekayaan, keluarga, dan kesehatannya. Allah lalu ingin menguji ketabahannya dengan menimpakan penyakit kulit yang sangat parah. Begitu berat penyakitnya dan begitu lama dideritanya hingga harta bendanya habis, dan keluarganya bertebaran ke negeri-negeri sekitarnya untuk mencari penghidupan. Di tengah-tengah penderitaannya itu, ia merasa sangat lelah dan menderita. Ia merasa ada setan yang mengusik jiwanya ketika beribadah kepada Allah. Lalu ia mengadukan kepada Allah agar diberi petunjuk untuk melepaskan dirinya dari penderitaan dan siksaan yang dialaminya.\n\nAllah berfirman:\n\nDan (ingatlah kisah) Ayub, ketika dia berdoa kepada Tuhannya, \"(Ya Tuhanku), sungguh, aku telah ditimpa penyakit, padahal Engkau Tuhan Yang Maha Penyayang dari semua yang penyayang.\" (al-Anbiya'/21: 83)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4012,
                    "inSurah": 42
                },
                "meta": {
                    "juz": 23,
                    "page": 455,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "ارْكُضْ بِرِجْلِكَ ۖ هَٰذَا مُغْتَسَلٌ بَارِدٌ وَشَرَابٌ",
                    "transliteration": {
                        "en": "Urkud birijlika haaza mughtasalum baaridunw wa sharaab"
                    }
                },
                "translation": {
                    "en": "[So he was told], \"Strike [the ground] with your foot; this is a [spring for] a cool bath and drink.\"",
                    "id": "Allah berfirman), “Hentakkanlah kakimu; inilah air yang sejuk untuk mandi dan untuk minum.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4012",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4012.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4012.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Menjawab doa Nabi Ayyub, Allah berfirman, “Hentakkanlah kakimu!” Dia pun menuruti perintah Tuhannya, lalu dari bawah telapak kakinya muncul sebuah mata air. Dikatakan kepadanya, “Inilah air yang sejuk untuk mandi dan untuk minum. Minum dan mandilah dengan airnya, niscaya Allah akan menghilangkan penderitaan dan bencana darimu.”",
                        "long": "Ayat ini menjelaskan bahwa karena ketaatan dan kesabaran Ayub menghadapi cobaan, Allah mengabulkan doanya dengan memerintahkan kepadanya agar menghentakkan kakinya ke bumi. Kemudian dari bumi itu memancar mata air yang sejuk. Lalu Ayub diperintahkan agar mandi dan minum dengan air itu. Seketika itu, Allah menyembuhkan penyakitnya seakan-akan tidak pernah sakit sebelumnya.\n\nKemudian ia menghimpun kembali keluarganya yang telah terpencar, dan mereka akhirnya dapat menyebarkan keturunan yang banyak, sebagai rahmat Allah kepadanya dan kepada keturunannya.\n\nPada akhir ayat, Allah menegaskan bahwa ketaatan dan kesabaran Ayub itu merupakan pelajaran bagi orang-orang yang berakal dan menjadi petunjuk bagi seluruh manusia bahwa rahmat Allah itu dekat sekali pada orang-orang yang senantiasa melakukan perbuatan yang baik. Hal ini juga menjadi contoh bahwa setiap perjuangan itu meskipun pada mulanya terasa sangat melelahkan, tetapi bila dilakukan dengan penuh ketabahan, niscaya segala kesulitan pasti dapat diatasi, dan kemenangan pasti dapat diraih. Pengalaman berharga yang dapat dipetik dari kisah Ayub ini ialah bahwa orang tidak boleh berputus asa untuk mencari jalan ke luar dalam menghadapi rintangan, hingga ia mendapatkan jalan untuk mengatasi rintangan itu, dengan memohon petunjuk kepada Allah agar diberi limpahan hidayah-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4013,
                    "inSurah": 43
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَوَهَبْنَا لَهُ أَهْلَهُ وَمِثْلَهُم مَّعَهُمْ رَحْمَةً مِّنَّا وَذِكْرَىٰ لِأُولِي الْأَلْبَابِ",
                    "transliteration": {
                        "en": "Wa wahabnaa lahoo ahlahoo wa mislahum ma'ahum rahmatam minna wa zikraa li ulil albaab"
                    }
                },
                "translation": {
                    "en": "And We granted him his family and a like [number] with them as mercy from Us and a reminder for those of understanding.",
                    "id": "Dan Kami anugerahi dia (dengan mengumpulkan kembali) keluarganya dan Kami lipatgandakan jumlah mereka, sebagai rahmat dari Kami dan pelajaran bagi orang-orang yang berpikiran sehat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4013",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4013.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4013.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kami sembuhkan penyakit Nabi Ayyub dan setelah itu Kami anugerahi dia kebahagiaan berkumpul kembali bersama keluarganya yang lama terpisah dan Kami lipatgandakan jumlah mereka sehingga keluarga serta pengikutnya bertambah banyak. Kami anugerahkan hal itu sebagai rahmat dari Kami bagi orang yang berbuat baik dan sabar dalam menerima cobaan, dan sebagai pelajaran bagi orang-orang yang berpikiran sehat serta meyakini kemurahan dan rahmat Allah.",
                        "long": "Ayat ini menjelaskan bahwa karena ketaatan dan kesabaran Ayub menghadapi cobaan, Allah mengabulkan doanya dengan memerintahkan kepadanya agar menghentakkan kakinya ke bumi. Kemudian dari bumi itu memancar mata air yang sejuk. Lalu Ayub diperintahkan agar mandi dan minum dengan air itu. Seketika itu, Allah menyembuhkan penyakitnya seakan-akan tidak pernah sakit sebelumnya.\n\nKemudian ia menghimpun kembali keluarganya yang telah terpencar, dan mereka akhirnya dapat menyebarkan keturunan yang banyak, sebagai rahmat Allah kepadanya dan kepada keturunannya.\n\nPada akhir ayat, Allah menegaskan bahwa ketaatan dan kesabaran Ayub itu merupakan pelajaran bagi orang-orang yang berakal dan menjadi petunjuk bagi seluruh manusia bahwa rahmat Allah itu dekat sekali pada orang-orang yang senantiasa melakukan perbuatan yang baik. Hal ini juga menjadi contoh bahwa setiap perjuangan itu meskipun pada mulanya terasa sangat melelahkan, tetapi bila dilakukan dengan penuh ketabahan, niscaya segala kesulitan pasti dapat diatasi, dan kemenangan pasti dapat diraih. Pengalaman berharga yang dapat dipetik dari kisah Ayub ini ialah bahwa orang tidak boleh berputus asa untuk mencari jalan ke luar dalam menghadapi rintangan, hingga ia mendapatkan jalan untuk mengatasi rintangan itu, dengan memohon petunjuk kepada Allah agar diberi limpahan hidayah-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4014,
                    "inSurah": 44
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَخُذْ بِيَدِكَ ضِغْثًا فَاضْرِب بِّهِ وَلَا تَحْنَثْ ۗ إِنَّا وَجَدْنَاهُ صَابِرًا ۚ نِّعْمَ الْعَبْدُ ۖ إِنَّهُ أَوَّابٌ",
                    "transliteration": {
                        "en": "Wa khuz biyadika dighsan fadrib bihee wa laa tahnas, innaa wajadnaahu saabiraa; ni'mal 'abd; innahooo awwaab"
                    }
                },
                "translation": {
                    "en": "[We said], \"And take in your hand a bunch [of grass] and strike with it and do not break your oath.\" Indeed, We found him patient, an excellent servant. Indeed, he was one repeatedly turning back [to Allah].",
                    "id": "Dan ambillah seikat (rumput) dengan tanganmu, lalu pukullah dengan itu dan janganlah engkau melanggar sumpah. Sesungguhnya Kami dapati dia (Ayyub) seorang yang sabar. Dialah sebaik-baik hamba. Sungguh, dia sangat taat (kepada Allah)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4014",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4014.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4014.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Nabi Ayyub pernah bersumpah akan memukul istrinya akibat kelalaiannya dalam merawat beliau. Allah mengizinkan beliau untuk melaksanakan sumpah itu tanpa mendatangkan rasa sakit berlebih kepada istrinya. Untuk itu Allah berfirman, “Dan ambillah seikat rumput dengan tanganmu, lalu pukullah istrimu sekali saja dengan itu dan janganlah engkau melanggar sumpah yang pernah kauucapkan.” Sesungguhnya Kami dapati dia sebagai seorang yang sabar dan ikhlas dalam menghadapi cobaan. Dialah sebaik-baik hamba yang tidak pernah putus asa. Sungguh, dia sangat taat dalam melaksanakan perintah Kami. Ujian dan cobaan bisa menimpa siapa saja. Jika hal itu dihadapi dengan sabar, tawakal, dan berusaha secara maksimal, niscaya Allah akan mengganti dengan imbalan lebih banyak, bahkan terkadang tidak terduga.",
                        "long": "Kemudian Allah mengisahkan keringanan hukuman bagi istrinya yang diberikan kepada Ayub. Allah memerintahkan agar Ayub mengambil seberkas rumput untuk dipukulkan kepada istrinya. Pukulan rumput ini cukup sebagai pengganti dari sumpah yang pernah ia ucapkan. Dalam ayat-ayat Al-Qur'an tidak disebutkan apa sebab ia bersumpah dan apa sumpahnya. Hanya hadis sajalah yang menyebutkan bahwa ia bersumpah karena istrinya, yang bernama Rahmah putri Ifraim, pergi untuk sesuatu keperluan dan terlambat datang. Ayub bersumpah akan memukulnya 100 kali apabila ia sembuh. Dengan pukulan seikat rumput itu, ia dianggap telah melaksanakan sumpahnya, sebagai kemurahan bagi Ayub sendiri dan bagi istrinya yang telah melayaninya dengan baik pada saat sakit. Dengan adanya kemurahan Allah itu, Ayub pun terhindar dari melanggar sumpah.\n\nDi akhir ayat, Allah memuji bahwa Ayub adalah hamba-Nya yang sabar, baik, dan taat. Sabar menghadapi cobaan yang diberikan kepadanya, baik cobaan yang menimpa dirinya, hartanya, serta keluarganya. Dia dimasukkan dalam golongan hamba-Nya yang baik perangainya karena tidak mudah berputus asa, dan menumpahkan harapannya kepada Allah. Dia juga sebagai hamba-Nya yang taat, karena kegigihannya memperjuangkan perintah-perintah agama serta memelihara diri, keluarga, dan kaumnya dari kehancuran.\n\nMengenai ketaatan Ayub dapat diketahui dari sebuah riwayat bahwa apabila ia menemui cobaan mengatakan:\n\n\"Ya Allah, Engkaulah yang mengambil dan Engkau pula yang memberi.\"\n\nPada waktu bermujanat ia pun berkata:\n\n\"Ya Tuhanku, \"Engkau telah mengetahui betul bahwa lisanku tidak akan berbeda dengan hatiku, hatiku tidak mengikuti penglihatan, hamba sahaya yang kumiliki tidak akan mempermainkan aku, aku tidak makan terkecuali bersama-sama anak yatim dan aku tidak berada dalam keadaan kenyang dan berpakaian sedang di sampingku ada orang yang lapar atau telanjang.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4015,
                    "inSurah": 45
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَاذْكُرْ عِبَادَنَا إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ أُولِي الْأَيْدِي وَالْأَبْصَارِ",
                    "transliteration": {
                        "en": "Wazkur 'ibaadanaaa Ibraaheema wa Is-haaqa wa Ya'qooba ulil-aydee walabsaar"
                    }
                },
                "translation": {
                    "en": "And remember Our servants, Abraham, Isaac and Jacob - those of strength and [religious] vision.",
                    "id": "Dan ingatlah hamba-hamba Kami: Ibrahim, Ishak dan Yakub yang mempunyai kekuatan-kekuatan yang besar dan ilmu-ilmu (yang tinggi)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4015",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4015.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4015.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Demikianlah kisah Nabi Ayyub, salah satu nabi dari garis keturunan Nabi Ishak bin Ibrahim. Seperti halnya Nabi Ayyub, ketabahan dan kesabaran juga ditunjukkan oleh leluhurnya. Dan ingatlah hamba-hamba Kami yang taat melaksanakan perintah Allah, tabah menerima cobaan dan ujian, dan sabar menghadapi umatnya, yaitu Nabi Ibrahim, Ishak, dan Yakub. Mereka mempunyai kekuatan-kekuatan yang besar dan ilmu-ilmu agama. Dengan kekuatan mereka memimpin umat dan melaksanakan perintah-perintah Allah, dan dengan ilmu agama yang luas mereka membimbing orang lain.",
                        "long": "Allah memerintahkan kepada Rasul-Nya agar mengisahkan kepada kaumnya perjuangan Nabi Ibrahim, dan putra beliau Ishak yang juga diangkat menjadi nabi, serta cucunya Yakub yang mencapai derajat kenabian juga.\n\nMereka itu hamba-hamba Allah yang terkenal ketabahannya dan mencapai kemuliaan karena ketaatannya kepada Allah. Karena perjuangannya yang gigih dalam menegakkan kebenaran dan menghancurkan kebatilan, mereka ini dilimpahi kekuatan oleh Allah untuk memiliki ilmu pengetahuan agama yang luas dan kekuatan untuk memimpin kaumnya ke jalan yang terang, jauh dari kesesatan. Mereka juga diberi kemampuan untuk melaksanakan amal perbuatan yang diridai Allah, yang bermanfaat bagi kepentingan hidup kaumnya di dunia dan kebahagiaan mereka di akhirat.\n\nPada ayat ini terdapat sindiran bagi kaum musyrikin bahwa apabila mereka tidak mau mengambil pelajaran dari kisah tersebut tentulah mereka akan tetap berada dalam kesesatan dan di akhirat nanti mereka akan mengalami penderitaan yang sangat mengerikan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4016,
                    "inSurah": 46
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّا أَخْلَصْنَاهُم بِخَالِصَةٍ ذِكْرَى الدَّارِ",
                    "transliteration": {
                        "en": "Innaaa akhlasnaahum bi khaalisatin zikrad daar"
                    }
                },
                "translation": {
                    "en": "Indeed, We chose them for an exclusive quality: remembrance of the home [of the Hereafter].",
                    "id": "Sungguh, Kami telah menyucikan mereka dengan (menganugerahkan) akhlak yang tinggi kepadanya yaitu selalu mengingatkan (manusia) kepada negeri akhirat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4016",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4016.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4016.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sungguh, Kami anugerahi mereka karunia yang besar itu karena Kami telah menyucikan jiwa mereka dengan sifat-sifat terpuji dan akhlak yang tinggi kepadanya, yaitu selalu mengingatkan umatnya kepada negeri akhirat yang kekal dan penuh kenikmatan bagi hamba-hamba yang saleh.",
                        "long": "Pada ayat ini, Allah menjelaskan sebab-sebab para nabi tersebut mencapai kemuliaan baik dunia maupun akhirat adalah karena memelihara kebersihan jiwa dan menjauhkan diri dari dosa yang tercela. Karena jiwa mereka bersih dari noda-noda kemusyrikan, maka mereka ikhlas menaati perintah-perintah Allah. Juga karena mereka selalu menjauhi perbuatan-perbuatan tercela, maka mereka gigih dalam memperjuangkan kebenaran dan melenyapkan kebatilan. Dengan demikian, tergambarlah dalam jiwa mereka akhlak yang tinggi, dan sifat yang mulia yang menyebabkan mereka patut diteladani. \n\nSeluruh kegiatan mereka baik berupa tenaga, harta, maupun pikiran, semata-mata dipergunakan untuk peribadatan secara murni, dengan tujuan ingin mendapat rida Allah dan menjunjung tinggi kalimat tauhid. Dengan landasan itu, mereka selalu memperingatkan kaumnya pada kehidupan akhirat yang kekal. Kenikmatan di dunia yang hanya sementara itu hendaknya dijadikan sarana untuk berbakti pada Allah, sehingga dengan demikian mereka di akhirat memperoleh kenikmatan yang tiada putus-putusnya, yang disediakan bagi hamba-hamba yang mendapatkan keridaan-Nya. Sedang hamba-hamba yang ingkar dan selalu bergelimang dalam kesesatan hidup, akan merasakan azab yang sangat pedih."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4017,
                    "inSurah": 47
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِنَّهُمْ عِندَنَا لَمِنَ الْمُصْطَفَيْنَ الْأَخْيَارِ",
                    "transliteration": {
                        "en": "Wa innahum 'indanaa laminal mustafainal akhyaar"
                    }
                },
                "translation": {
                    "en": "And indeed they are, to Us, among the chosen and outstanding.",
                    "id": "Dan sungguh, di sisi Kami mereka termasuk orang-orang pilihan yang paling baik."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4017",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4017.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4017.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sungguh, di sisi Kami mereka termasuk orang-orang pilihan yang paling baik dan mulia di antara manusia lain, sehingga Kami pilih mereka sebagai nabi dan rasul.",
                        "long": "Pada ayat ini, Allah menegaskan bahwa para hamba pilihan-Nya, yaitu Ibrahim, Ishak, dan Yakub, benar-benar mempunyai jiwa yang bersih. Tidak tersirat sedikit pun dalam jiwa mereka sifat-sifat yang tercela, seperti sifat dengki dan takabur, melainkan terpancar dari dalam diri mereka sifat-sifat yang terpuji yang menjadi teladan dan contoh yang baik bagi kaumnya.\n\nPelajaran yang dapat diambil dari ayat ini ialah, jiwa yang bersih dan akal yang sehat merupakan syarat yang harus dipenuhi oleh orang yang menginginkan kemuliaan baik dunia maupun akhirat. Orang yang jiwanya bersih dan akalnya sehat tentu melihat tanda-tanda kebesaran Allah yang ada pada dirinya dan ada di langit dan bumi seisinya. Sedang orang yang jiwanya kotor dan pikirannya terbelenggu oleh kebendaan, tentu tidak akan melihat tanda-tanda kebesaran Allah dan tidak akan melihat kebenaran wahyu yang dibawa oleh rasul."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4018,
                    "inSurah": 48
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَاذْكُرْ إِسْمَاعِيلَ وَالْيَسَعَ وَذَا الْكِفْلِ ۖ وَكُلٌّ مِّنَ الْأَخْيَارِ",
                    "transliteration": {
                        "en": "Wazkur Ismaa'eela wal Yasa'a wa Zal-Kifli wa kullum minal akhyaar"
                    }
                },
                "translation": {
                    "en": "And remember Ishmael, Elisha and Dhul-Kifl, and all are among the outstanding.",
                    "id": "Dan ingatlah Ismail, Ilyasa‘ dan Zulkifli. Semuanya termasuk orang-orang yang paling baik."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4018",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4018.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4018.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ingatlah, wahai Nabi Muhammad, kisah moyang bangsa Arab, yaitu Nabi Ismail bin Ibrahim; Nabi Ilyasa‘ bin Akhtub dan Nabi Zulkifli putra paman Nabi Ilyasa’—nabi-nabi dari Bani Israil. Semuanya termasuk orang-orang yang paling baik yang dipilih Allah untuk membimbing kaumnya menuju ketaatan kepada Allah dan menjauhi kemusyrikan.",
                        "long": "Pada ayat ini, Allah memerintahkan kepada Rasulullah saw agar mengisahkan nabi-nabi yang lain, yaitu Ismail, Ilyasa', dan Zulkifli kepada kaumnya. Mereka ini adalah nabi-nabi yang gigih memperjuangkan tegaknya agama Allah di tengah-tengah kaumnya.\n\nAyat ini memisahkan penyebutan Ismail dengan ayahnya Ibrahim. Hal ini mengisyaratkan adanya perpisahan antara keduanya. Memang Nabi Ismail berpisah dengan ayahnya, setelah beliau ditinggal bersama ibunya, Hajar, di Mekah. thahir bin 'Asyur, seperti yang dikutip Quraish Shihab, memahami bahwa pemisahan itu karena Nabi Ismail kelak akan menjadi kakek moyang dari umat yang besar, yaitu bangsa Arab. Sedang Ishak dan Yakub disatukan dengan Ibrahim karena mereka memang menjadi kakek moyang Bani Israil.\n\nPenggabungan Ilyasa' dan Ismail karena adanya persamaan antara keduanya, antara lain mereka sama-sama sebagai manusia pilihan, kedudukan Ilyasa' di kalangan Bani Israil serupa dengan kedudukan Ismail di kalangan keturunan Ibrahim. Kesamaan itu adalah Ilyasa' membantu Nabi Ilyas, sebagaimana Ismail membantu Ibrahim.\n\nMenurut asy-Syaukani dalam Tafsir Fath al-Qadir disebutkan bahwa penggabungan penyebutan Zulkifli, Ilyasa', dan Ismail karena mereka mempunyai kesamaan, yaitu orang-orang penyabar.\n\nPada penghujung ayat, Allah menegaskan bahwa mereka ini adalah hamba-hamba Allah yang paling baik, berakhlak tinggi, berbudi luhur, dan membimbing kaumnya agar taat kepada Allah dan menjauhi kemusyrikan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4019,
                    "inSurah": 49
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هَٰذَا ذِكْرٌ ۚ وَإِنَّ لِلْمُتَّقِينَ لَحُسْنَ مَآبٍ",
                    "transliteration": {
                        "en": "Haazaa zikr; wa inna lilmuttaqeena lahusna ma aab"
                    }
                },
                "translation": {
                    "en": "This is a reminder. And indeed, for the righteous is a good place of return",
                    "id": "Ini adalah kehormatan (bagi mereka). Dan sungguh, bagi orang-orang yang bertakwa (disediakan) tempat kembali yang terbaik,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4019",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4019.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4019.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Setelah menjelaskan kisah para nabi penyampai risalah, Allah beralih menguraikan imbalan bagi orang-orang yang mengikuti risalah mereka. Al-Qur’an ini adalah kehormatan bagi mereka yang berharap petunjuk-Nya. Dan sungguh, Allah meyediakan bagi orang-orang yang bertakwa kepada-Nya tempat kembali yang terbaik di akhirat.",
                        "long": "Allah menjelaskan bahwa ayat-ayat yang menceritakan kemuliaan para nabi dan kebahagiaan mereka di akhirat adalah kehormatan bagi mereka untuk selalu diingat oleh manusia. Di samping memperoleh kemuliaan di dunia, mereka pun disediakan tempat kembali yang baik di akhirat. Pada ayat ini, para nabi dimasukkan ke dalam kelompok orang-orang yang takwa, agar orang-orang yang memperhatikan seruan Rasulullah pada saat mendengar firman Allah ini menjadi sadar bahwa apabila mereka mau mencontoh dan meneladani perjuangan para rasul itu, tentu mereka juga akan memperoleh kehormatan di dunia dan kebaikan di akhirat. Demikian pula orang-orang yang mau melaksanakan perintah Allah serta menjauhi larangan-Nya, tentu akan memperoleh nasib yang sama."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4020,
                    "inSurah": 50
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "جَنَّاتِ عَدْنٍ مُّفَتَّحَةً لَّهُمُ الْأَبْوَابُ",
                    "transliteration": {
                        "en": "Jannaati 'adnim mufat tahatal lahumul abwaab"
                    }
                },
                "translation": {
                    "en": "Gardens of perpetual residence, whose doors will be opened to them.",
                    "id": "(yaitu) surga ’Adn yang pintu-pintunya terbuka bagi mereka,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4020",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4020.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4020.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Itulah surga ‘Adn, tempat tinggal yang kekal yang pintu-pintunya terbuka lebar bagi mereka, menyambut kedatangan mereka.",
                        "long": "Pada ayat-ayat ini Allah menjelaskan betapa nikmatnya tempat kembali yang disediakan kepada para rasul dan orang-orang yang bertakwa itu. Pintu surga 'Adn selalu terbuka, dan keadaannya selalu menyenangkan, sebagai tanda bahwa segalanya telah dipersiapkan untuk menghormati hamba-hamba pilihan Allah yang akan menghuninya. Kamar-kamarnya luas yang mengagumkan, pelayan-pelayannya yang indah dipandang mata, dan suasana lingkungannya yang mencengangkan. Semuanya dalam tata ciptaan yang memesonakan, yang belum pernah terlihat sebelumnya, belum pernah terngiang di telinga dan belum pernah terlintas dalam hati.\n\nDi dalam surga itu keinginan mereka terpenuhi, dipan-dipan tempat mereka membaringkan diri, tersedia serba memuaskan, buah-buahan yang beraneka ragam, jenis rasa dan aromanya, serta minuman dengan segala macamnya, siap disuguhkan.\n\nSebenarnya kenikmatan yang terdapat dalam surga itu adalah puncak dari segala kenikmatan. Kenikmatan yang ada di surga itu diungkapkan dengan buah-buahan dan minuman sebagai kenikmatan yang sesuai dengan keadaan masyarakat Mekah pada waktu itu.\n\nKalau disebutkan buah-buahan yang beraneka ragam dan minuman yang bermacam jenisnya, sudah barang tentu selera mereka terangsang, dan timbullah keinginan mereka untuk menikmati. Di samping itu, mereka didampingi oleh bidadari-bidadari yang sangat sopan. Masing-masing penghuni surga dilayani oleh perempuan-perempuan surga yang khusus untuknya, dan tidak memberikan pelayanannya kepada penghuni surga yang lain. Semua perempuan surga sama-sama cantiknya dan semuanya remaja."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4021,
                    "inSurah": 51
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 182,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مُتَّكِئِينَ فِيهَا يَدْعُونَ فِيهَا بِفَاكِهَةٍ كَثِيرَةٍ وَشَرَابٍ",
                    "transliteration": {
                        "en": "Muttaki'eena feehaa yad'oona feehaa bifaakihatin kaseeratinw wa sharaab"
                    }
                },
                "translation": {
                    "en": "Reclining within them, they will call therein for abundant fruit and drink.",
                    "id": "di dalamnya mereka bersandar (di atas dipan-dipan) sambil meminta buah-buahan yang banyak dan minuman (di surga itu)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4021",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4021.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4021.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Di dalamnya mereka bersandar di atas dipan-dipan sambil meminta suguhan berupa buah-buahan yang banyak dan minuman dengan berbagai jenis dan rasa.",
                        "long": "Pada ayat-ayat ini Allah menjelaskan betapa nikmatnya tempat kembali yang disediakan kepada para rasul dan orang-orang yang bertakwa itu. Pintu surga 'Adn selalu terbuka, dan keadaannya selalu menyenangkan, sebagai tanda bahwa segalanya telah dipersiapkan untuk menghormati hamba-hamba pilihan Allah yang akan menghuninya. Kamar-kamarnya luas yang mengagumkan, pelayan-pelayannya yang indah dipandang mata, dan suasana lingkungannya yang mencengangkan. Semuanya dalam tata ciptaan yang memesonakan, yang belum pernah terlihat sebelumnya, belum pernah terngiang di telinga dan belum pernah terlintas dalam hati.\n\nDi dalam surga itu keinginan mereka terpenuhi, dipan-dipan tempat mereka membaringkan diri, tersedia serba memuaskan, buah-buahan yang beraneka ragam, jenis rasa dan aromanya, serta minuman dengan segala macamnya, siap disuguhkan.\n\nSebenarnya kenikmatan yang terdapat dalam surga itu adalah puncak dari segala kenikmatan. Kenikmatan yang ada di surga itu diungkapkan dengan buah-buahan dan minuman sebagai kenikmatan yang sesuai dengan keadaan masyarakat Mekah pada waktu itu.\n\nKalau disebutkan buah-buahan yang beraneka ragam dan minuman yang bermacam jenisnya, sudah barang tentu selera mereka terangsang, dan timbullah keinginan mereka untuk menikmati. Di samping itu, mereka didampingi oleh bidadari-bidadari yang sangat sopan. Masing-masing penghuni surga dilayani oleh perempuan-perempuan surga yang khusus untuknya, dan tidak memberikan pelayanannya kepada penghuni surga yang lain. Semua perempuan surga sama-sama cantiknya dan semuanya remaja."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4022,
                    "inSurah": 52
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ وَعِندَهُمْ قَاصِرَاتُ الطَّرْفِ أَتْرَابٌ",
                    "transliteration": {
                        "en": "Wa 'indahum qaasiraatut tarfi atraab"
                    }
                },
                "translation": {
                    "en": "And with them will be women limiting [their] glances and of equal age.",
                    "id": "dan di samping mereka (ada bidadari-bidadari) yang redup pandangannya dan sebaya umurnya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4022",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4022.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4022.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan di samping mereka ada bidadari-bidadari cantik dan sopan yang redup pandangannya, setia pada pasangannya, dan mereka semua sebaya umurnya.",
                        "long": "Pada ayat-ayat ini Allah menjelaskan betapa nikmatnya tempat kembali yang disediakan kepada para rasul dan orang-orang yang bertakwa itu. Pintu surga 'Adn selalu terbuka, dan keadaannya selalu menyenangkan, sebagai tanda bahwa segalanya telah dipersiapkan untuk menghormati hamba-hamba pilihan Allah yang akan menghuninya. Kamar-kamarnya luas yang mengagumkan, pelayan-pelayannya yang indah dipandang mata, dan suasana lingkungannya yang mencengangkan. Semuanya dalam tata ciptaan yang memesonakan, yang belum pernah terlihat sebelumnya, belum pernah terngiang di telinga dan belum pernah terlintas dalam hati.\n\nDi dalam surga itu keinginan mereka terpenuhi, dipan-dipan tempat mereka membaringkan diri, tersedia serba memuaskan, buah-buahan yang beraneka ragam, jenis rasa dan aromanya, serta minuman dengan segala macamnya, siap disuguhkan.\n\nSebenarnya kenikmatan yang terdapat dalam surga itu adalah puncak dari segala kenikmatan. Kenikmatan yang ada di surga itu diungkapkan dengan buah-buahan dan minuman sebagai kenikmatan yang sesuai dengan keadaan masyarakat Mekah pada waktu itu.\n\nKalau disebutkan buah-buahan yang beraneka ragam dan minuman yang bermacam jenisnya, sudah barang tentu selera mereka terangsang, dan timbullah keinginan mereka untuk menikmati. Di samping itu, mereka didampingi oleh bidadari-bidadari yang sangat sopan. Masing-masing penghuni surga dilayani oleh perempuan-perempuan surga yang khusus untuknya, dan tidak memberikan pelayanannya kepada penghuni surga yang lain. Semua perempuan surga sama-sama cantiknya dan semuanya remaja."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4023,
                    "inSurah": 53
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هَٰذَا مَا تُوعَدُونَ لِيَوْمِ الْحِسَابِ",
                    "transliteration": {
                        "en": "Haaza maa too'odoona li Yawmil Hisaab"
                    }
                },
                "translation": {
                    "en": "This is what you, [the righteous], are promised for the Day of Account.",
                    "id": "Inilah apa yang dijanjikan kepadamu pada hari perhitungan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4023",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4023.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4023.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Inilah apa yang dijanjikan Allah kepadamu pada hari perhitungan, hari ketika manusia dibangkitkan dari kubur lalu diarak ke padang mahsyar dan diadili di hadapan Allah.",
                        "long": "Allah menegaskan bahwa segala macam kenikmatan yang terdapat di surga itulah yang dijanjikan kepada hamba Allah yang bertakwa, yang pasti datang setelah manusia seluruhnya dibangkitkan kembali dari kubur, dan diadili di Padang Mahsyar. Allah menegaskan bahwa nikmat yang ada di surga itu bukan sembarang kenikmatan, tetapi nikmat yang abadi."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4024,
                    "inSurah": 54
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّ هَٰذَا لَرِزْقُنَا مَا لَهُ مِن نَّفَادٍ",
                    "transliteration": {
                        "en": "Inna haazaa larizqunaa maa lahoo min nafaad"
                    }
                },
                "translation": {
                    "en": "Indeed, this is Our provision; for it there is no depletion.",
                    "id": "Sungguh, inilah rezeki dari Kami yang tidak ada habis-habisnya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4024",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4024.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4024.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sungguh, karunia besar dan mulia inilah rezeki dari Kami yang tidak ada habis-habisnya dan tidak pula berkurang. Kami berikan karunia itu kepada hamba-hamba yang taat dan berbakti.",
                        "long": "Allah menegaskan bahwa segala macam kenikmatan yang terdapat di surga itulah yang dijanjikan kepada hamba Allah yang bertakwa, yang pasti datang setelah manusia seluruhnya dibangkitkan kembali dari kubur, dan diadili di Padang Mahsyar. Allah menegaskan bahwa nikmat yang ada di surga itu bukan sembarang kenikmatan, tetapi nikmat yang abadi."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4025,
                    "inSurah": 55
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هَٰذَا ۚ وَإِنَّ لِلطَّاغِينَ لَشَرَّ مَآبٍ",
                    "transliteration": {
                        "en": "Haazaa; wa inna littaagheena lasharra ma-aab"
                    }
                },
                "translation": {
                    "en": "This [is so]. But indeed, for the transgressors is an evil place of return -",
                    "id": "Beginilah (keadaan mereka). Dan sungguh, bagi orang-orang yang durhaka pasti (disediakan) tempat kembali yang buruk,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4025",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4025.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4025.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Bila Allah menyediakan surga beserta segala kenikmatan di dalamnya bagi orang yang taat, maka Allah menyediakan jahanam bagi orang yang durhaka terhadap risalah Allah. Beginilah karunia Allah kepada orang-orang yang bertakwa. Dan sungguh, bagi orang-orang yang durhaka terhadap perintah Allah dan rasul-Nya di dunia pasti di akhirat nanti disediakan tempat kembali yang buruk.",
                        "long": "Pada ayat ini diterangkan keadaan orang-orang kafir di dalam neraka. Mereka memperoleh tempat kembali yang buruk, mengalami kesengsaraan yang tiada taranya di dalam neraka. Segala tempat yang mereka tempati baik tempat duduk, tempat tidur, tempat istirahat, dan sebagainya, merupakan tempat yang tidak mereka senangi, karena di tempat itu mereka selalu mengalami siksaan yang berat.\n\nDalam ayat yang lain diterangkan keadaan orang kafir di dalam neraka, Allah berfirman:\n\nBagi mereka tikar tidur dari api neraka dan di atas mereka ada selimut (api neraka). Demikianlah Kami memberi balasan kepada orang-orang yang zalim. (al-A.'raf/7: 41)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4026,
                    "inSurah": 56
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "جَهَنَّمَ يَصْلَوْنَهَا فَبِئْسَ الْمِهَادُ",
                    "transliteration": {
                        "en": "Jahannama yaslawnahaa fai'sal mihaad"
                    }
                },
                "translation": {
                    "en": "Hell, which they will [enter to] burn, and wretched is the resting place.",
                    "id": "(yaitu) neraka Jahanam yang mereka masuki; maka itulah seburuk-buruk tempat tinggal."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4026",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4026.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4026.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Itulah neraka Jahanam, tempat tinggal yang kelak akan mereka masuki; maka Jahanam itulah seburuk-buruk tempat tinggal.",
                        "long": "Pada ayat ini diterangkan keadaan orang-orang kafir di dalam neraka. Mereka memperoleh tempat kembali yang buruk, mengalami kesengsaraan yang tiada taranya di dalam neraka. Segala tempat yang mereka tempati baik tempat duduk, tempat tidur, tempat istirahat, dan sebagainya, merupakan tempat yang tidak mereka senangi, karena di tempat itu mereka selalu mengalami siksaan yang berat.\n\nDalam ayat yang lain diterangkan keadaan orang kafir di dalam neraka, Allah berfirman:\n\nBagi mereka tikar tidur dari api neraka dan di atas mereka ada selimut (api neraka). Demikianlah Kami memberi balasan kepada orang-orang yang zalim. (al-A.'raf/7: 41)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4027,
                    "inSurah": 57
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هَٰذَا فَلْيَذُوقُوهُ حَمِيمٌ وَغَسَّاقٌ",
                    "transliteration": {
                        "en": "Haazaa falyazooqoohu hameemunw wa ghassaaq"
                    }
                },
                "translation": {
                    "en": "This - so let them taste it - is scalding water and [foul] purulence.",
                    "id": "Inilah (azab neraka), maka biarlah mereka merasakannya, (minuman mereka) air yang sangat panas dan air yang sangat dingin,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4027",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4027.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4027.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Inilah azab yang Allah janjikan kepada para pendurhaka, maka biarlah mereka merasakannya dan mengetahui betapa pedih azab itu. Inilah air mendidih yang sangat panas dan membakar mulut, kerongkongan, serta usus mereka, dan air yang sangat dingin, yaitu nanah busuk dingin yang mengalir dari tubuh-tubuh penghuni neraka,",
                        "long": "Allah menyatakan kepada orang-orang kafir di dalam neraka, \"Hai orang kafir, inilah azab yang pernah Aku janjikan dahulu, maka rasakanlah olehmu bagaimana berat dan pedihnya azab itu, minumlah di dalam neraka itu air panas yang sedang mendidih yang membakar mulut dan usus-ususmu atau nanah busuk yang mengalir dari tubuh-tubuh penghuni neraka yang sangat dingin. Selain dari itu kamu sekalian akan merasakan azab-azab yang lain yang kamu sendiri tidak mengetahui bentuk azab itu, selain kamu hanya merasakan kesengsaraan yang luar biasa.\"\n\nRasulullah saw bersabda:\n\nDari Abu Sa'id al-Khudri, dari Nabi saw, beliau bersabda, \"Seandainya satu timba dari minuman penghuni neraka ditumpahkan di dunia, maka semua penghuni dunia akan berbau busuk.(Riwayat al-hakim)\n\nJika diperhatikan ayat-ayat ini dan dihubungkan dengan ayat-ayat yang sebelumnya seakan-akan ayat ini merupakan imbangan perkataan Allah kepada ahli surga. Pada ayat yang lalu disebutkan bahwa penduduk surga diberikan buah-buahan yang baik dan minuman yang lezat rasanya, sedang pada ayat ini diterangkan bahwa penduduk neraka disuruh merasakan air panas yang mendidih dan nanah yang mengalir. Hal ini berarti bahwa penduduk surga memperoleh semua yang diminta dan diingini, sedang penduduk neraka disuruh bahkan dipaksa melakukan sesuatu yang tidak diingininya.\n\nKalau orang-orang yang beriman di dalam surga memperoleh bidadari yang tidak liar pandangannya dan sebaya umurnya, maka penduduk neraka memperoleh azab yang bermacam-macam yang sangat berat dan pedih."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4028,
                    "inSurah": 58
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَآخَرُ مِن شَكْلِهِ أَزْوَاجٌ",
                    "transliteration": {
                        "en": "Wa aakharu min shak liheee azwaaj"
                    }
                },
                "translation": {
                    "en": "And other [punishments] of its type [in various] kinds.",
                    "id": "dan berbagai macam (azab) yang lain yang serupa itu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4028",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4028.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4028.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "dan di samping itu ada berbagai macam azab yang lain yang serupa pedihnya dengan azab itu.",
                        "long": "Allah menyatakan kepada orang-orang kafir di dalam neraka, \"Hai orang kafir, inilah azab yang pernah Aku janjikan dahulu, maka rasakanlah olehmu bagaimana berat dan pedihnya azab itu, minumlah di dalam neraka itu air panas yang sedang mendidih yang membakar mulut dan usus-ususmu atau nanah busuk yang mengalir dari tubuh-tubuh penghuni neraka yang sangat dingin. Selain dari itu kamu sekalian akan merasakan azab-azab yang lain yang kamu sendiri tidak mengetahui bentuk azab itu, selain kamu hanya merasakan kesengsaraan yang luar biasa.\"\n\nRasulullah saw bersabda:\n\nDari Abu Sa'id al-Khudri, dari Nabi saw, beliau bersabda, \"Seandainya satu timba dari minuman penghuni neraka ditumpahkan di dunia, maka semua penghuni dunia akan berbau busuk.(Riwayat al-hakim)\n\nJika diperhatikan ayat-ayat ini dan dihubungkan dengan ayat-ayat yang sebelumnya seakan-akan ayat ini merupakan imbangan perkataan Allah kepada ahli surga. Pada ayat yang lalu disebutkan bahwa penduduk surga diberikan buah-buahan yang baik dan minuman yang lezat rasanya, sedang pada ayat ini diterangkan bahwa penduduk neraka disuruh merasakan air panas yang mendidih dan nanah yang mengalir. Hal ini berarti bahwa penduduk surga memperoleh semua yang diminta dan diingini, sedang penduduk neraka disuruh bahkan dipaksa melakukan sesuatu yang tidak diingininya.\n\nKalau orang-orang yang beriman di dalam surga memperoleh bidadari yang tidak liar pandangannya dan sebaya umurnya, maka penduduk neraka memperoleh azab yang bermacam-macam yang sangat berat dan pedih."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4029,
                    "inSurah": 59
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هَٰذَا فَوْجٌ مُّقْتَحِمٌ مَّعَكُمْ ۖ لَا مَرْحَبًا بِهِمْ ۚ إِنَّهُمْ صَالُو النَّارِ",
                    "transliteration": {
                        "en": "Haazaa fawjum muqtahimum ma'akum laa marhabam bihim; innahum saalun Naar"
                    }
                },
                "translation": {
                    "en": "[Its inhabitants will say], \"This is a company bursting in with you. No welcome for them. Indeed, they will burn in the Fire.\"",
                    "id": "(Dikatakan kepada mereka), “Ini rombongan besar (pengikut-pengikutmu) yang masuk berdesak-desak bersama kamu (ke neraka).” Tidak ada ucapan selamat datang bagi mereka karena sesungguhnya mereka akan masuk neraka (kata pemimpin-pemimpin mereka)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4029",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4029.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4029.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Saat segolongan penghuni neraka memasukinya, dikatakan kepada mereka yang telah masuk neraka lebih dulu, “Ini rombongan besar pengikut-pengikutmu yang dahulu mau mengikuti ajakanmu menuju kedurhakaan. Mereka akan masuk dan berdesak-desak bersama kamu di neraka.” Mereka yang masuk neraka lebih dulu berkata, “Tidak ada ucapan selamat datang apalagi penghormatan bagi mereka di neraka ini, karena sesungguhnya mereka akan masuk neraka dan disiksa bersama kami akibat perbuatan buruk yang mereka lakukan.” (Lihat pula: Surah az-Zumar/38: 71–72).",
                        "long": "Para malaikat berkata kepada orang-orang kafir yang telah masuk ke dalam neraka lebih dahulu di waktu mereka menghalau rombongan kafir yang lain yang banyak jumlahnya, \"Inilah rombongan yang lain yang dihalau ke dalam neraka agar mereka tinggal di dalamnya bersama-sama dengan kamu.\" Rombongan yang telah masuk dahulu ke dalam neraka, melihat rombongan yang baru yang sedang digiring itu, berkata, \"Itu adalah rombongan yang banyak jumlahnya yang akan menghuni neraka bersama-sama kita, maka kecelakaan akan menimpa mereka pula seperti kecelakaan yang telah menimpa kita dan mereka akan dibakar hangus seperti kita.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4030,
                    "inSurah": 60
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالُوا بَلْ أَنتُمْ لَا مَرْحَبًا بِكُمْ ۖ أَنتُمْ قَدَّمْتُمُوهُ لَنَا ۖ فَبِئْسَ الْقَرَارُ",
                    "transliteration": {
                        "en": "Qaaloo bal antum laa marhabam bikum; antum qaddamtumoohu lanaa fabi'sal qaraar"
                    }
                },
                "translation": {
                    "en": "They will say, \"Nor you! No welcome for you. You, [our leaders], brought this upon us, and wretched is the settlement.\"",
                    "id": "(Para pengikut mereka menjawab), “Sebenarnya kamulah yang (lebih pan-tas) tidak menerima ucapan selamat datang, karena kamulah yang menjerumuskan kami ke dalam azab, maka itulah seburuk-buruk tempat menetap.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4030",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4030.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4030.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kelompok pengikut yang hendak masuk neraka itu menjawab “Sebenarnya kamulah yang lebih pantas untuk tidak menerima ucapan selamat datang dan penghormatan, karena kamulah yang menjerumuskan kami ke dalam azab neraka dengan mengajak kami berbuat dosa dan menghindari petunjuk Allah.” Maka neraka itulah seburuk-buruk tempat menetap dan tempat kembali mereka.",
                        "long": "Mendengar ucapan itu, maka rombongan yang sedang digiring malaikat itu menjawab, \"Sebenarnya kamulah yang lebih pantas mendapat celaka, karena kamulah yang menyesatkan kami dahulu, dan kamulah yang selalu mengajak serta mendorong kami untuk mengerjakan pekerjaan-pekerjaan yang mengakibatkan kami masuk neraka ini.\"\n\nDalam ayat lain, Allah berfirman:\n\nAllah berfirman, \"Masuklah kamu ke dalam api neraka bersama golongan jin dan manusia yang telah lebih dahulu dari kamu. Setiap kali suatu umat masuk, dia melaknat saudaranya¦ (al-A.'raf/7: 38)\n\nLain halnya penduduk surga, setiap ada rombongan yang masuk ke dalamnya, mereka selalu disambut dengan senang dan gembira, dalam suasana persaudaraan dan kasih sayang, dan kepada mereka diucapkan \"salam\". Sungguh besar perbedaan antara penerimaan orang-orang beriman ketika mereka masuk surga dengan penerimaan orang-orang kafir ketika mereka masuk neraka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4031,
                    "inSurah": 61
                },
                "meta": {
                    "juz": 23,
                    "page": 456,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالُوا رَبَّنَا مَن قَدَّمَ لَنَا هَٰذَا فَزِدْهُ عَذَابًا ضِعْفًا فِي النَّارِ",
                    "transliteration": {
                        "en": "Qaaloo Rabbanaa man qaddama lanaa haaza fazidhu 'azaaban di'fan fin Naar"
                    }
                },
                "translation": {
                    "en": "They will say, \"Our Lord, whoever brought this upon us - increase for him double punishment in the Fire.\"",
                    "id": "Mereka berkata (lagi), “Ya Tuhan kami, barangsiapa menjerumuskan kami ke dalam (azab) ini, maka tambahkanlah azab kepadanya dua kali lipat di dalam neraka.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4031",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4031.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4031.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Demikianlah sergahan kelompok pengikut. Mereka berkata lagi seraya memohon kepada Allah, “Ya Tuhan kami, barang siapa mengajak kami memilih jalan kesesatan dan menjerumuskan kami ke dalam azab yang pedih dan berat ini, maka tambahkanlah azab kepadanya dua kali lipat di dalam neraka dan timpakanlah laknat yang besar atas mereka.\" (Lihat pula: Surah al-A‘ràf/7: 38; al-Ahzàb/33: 67–68).",
                        "long": "Bahkan penduduk neraka yang baru datang itu berdoa kepada Tuhan agar menambah azab yang berat kepada orang-orang yang telah menyesatkan mereka dengan mengatakan, \"Wahai Tuhan kami, timpakanlah azab yang berlipat-ganda kepada pemimpin-pemimpin dan pemuka-pemuka agama kami yang telah menyebabkan kami menderita karena azab yang berat ini.\n\nAyat lain yang searti dengan ayat ini firman Allah:\n\n¦Ya Tuhan kami, mereka telah menyesatkan kami. Datangkanlah siksaan api neraka yang berlipat ganda kepada mereka\" Allah berfirman, \"Masing-masing mendapatkan (siksaan) yang berlipat ganda, tapi kamu tidak mengetahui. (al-A.'raf/7: 38)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4032,
                    "inSurah": 62
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالُوا مَا لَنَا لَا نَرَىٰ رِجَالًا كُنَّا نَعُدُّهُم مِّنَ الْأَشْرَارِ",
                    "transliteration": {
                        "en": "Wa qaaloo ma lanaa laa naraa rijaalan kunnaa na'udduhum minal ashraar"
                    }
                },
                "translation": {
                    "en": "And they will say, \"Why do we not see men whom we used to count among the worst?",
                    "id": "Dan (orang-orang durhaka) berkata, “Mengapa kami tidak melihat orang-orang yang dahulu (di dunia) kami anggap sebagai orang-orang yang jahat (hina)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4032",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4032.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4032.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Para pendurhaka itu lalu berbicara dan saling bertanya-tanya seraya berkata, “Me-ngapa kami tidak melihat orang-orang yang di dunia dahulu kami anggap sebagai orang-orang yang jahat, hina, buruk, dan bodoh, seperti Bilal, Suhaib, dan Ammar?”",
                        "long": "Orang-orang kafir itu saling bertanya sesamanya, setelah mereka tidak melihat seorang pun orang-orang yang beriman yang mereka anggap hina sewaktu di dunia, \"Mengapa kita tidak melihat seorang pun dari orang-orang yang sewaktu di dunia kita pandang sebagai orang bodoh, orang jahat, dan orang hina yang tidak ada kebaikan pada dirinya.\"\n\nIbnu 'Abbas berkata, \"Yang mereka maksud dengan orang bodoh dan jahat adalah sahabat Rasul. Abu Jahal berkata, 'Di mana Bilal, di mana shuhaib, di mana Ammar, mereka semuanya di dalam surga. Kasihan Abu Jahal, anaknya 'Ikrimah dan Juwairiyah masuk Islam, demikian pula ibunya, saudaranya, sedang ia sendiri kafir.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4033,
                    "inSurah": 63
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَتَّخَذْنَاهُمْ سِخْرِيًّا أَمْ زَاغَتْ عَنْهُمُ الْأَبْصَارُ",
                    "transliteration": {
                        "en": "Attakhaznaahum sikh riyyan am zaaghat 'anhumul absaar"
                    }
                },
                "translation": {
                    "en": "Is it [because] we took them in ridicule, or has [our] vision turned away from them?\"",
                    "id": "Dahulu kami menjadikan mereka olok-olokan, ataukah karena penglihatan kami yang tidak melihat mereka?”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4033",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4033.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4033.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dahulu kami menjadikan mereka olok-olokan; apakah karena mereka tidak pantas menerima hinaan itu sehingga tidak masuk neraka bersama kami, ataukah karena penglihatan kami yang tidak melihat mereka di tempat ini lantaran mereka telah masuk lebih dulu?”",
                        "long": "Selanjutnya mereka saling bertanya sesama mereka, \"Apakah karena telah kita ejek dan perolok-olokkan sewaktu di dunia, sehingga mereka tidak masuk neraka ini, sedang mereka adalah orang-orang yang tidak pantas diejek dan diperolok-olokkan. Atau mereka sebenarnya telah masuk bersama-sama kita ke dalam neraka, tetapi kita tidak melihat mereka.\" Demikianlah keadaan orang-orang kafir di dalam neraka, mereka saling salah menyalahkan, saling tuduh-menuduh, bahkan mereka saling bertengkar antara yang satu dengan yang lain."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4034,
                    "inSurah": 64
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 394,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّ ذَٰلِكَ لَحَقٌّ تَخَاصُمُ أَهْلِ النَّارِ",
                    "transliteration": {
                        "en": "Inna zaalika lahaqqun takhaasumu Ahlin Naar"
                    }
                },
                "translation": {
                    "en": "Indeed, that is truth - the quarreling of the people of the Fire.",
                    "id": "Sungguh, yang demikian benar-benar terjadi, (yaitu) pertengkaran di antara penghuni neraka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4034",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4034.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4034.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sungguh, yang demikian itu benar-benar terjadi; itulah pertengkaran, saling mencaci, menyalahkan, dan menuduh di antara para penghuni neraka.",
                        "long": "Pada ayat ini Allah menegaskan bahwa semua yang diceritakan itu benar-benar akan terjadi, tidak diragukan sedikit pun. Orang-orang kafir itu akan selalu bertengkar sesama mereka di dalam neraka nanti."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4035,
                    "inSurah": 65
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قُلْ إِنَّمَا أَنَا مُنذِرٌ ۖ وَمَا مِنْ إِلَٰهٍ إِلَّا اللَّهُ الْوَاحِدُ الْقَهَّارُ",
                    "transliteration": {
                        "en": "Qul innamaaa ana munzirunw wa maa min ilaahim illal laahul Waahidul Qahhaar"
                    }
                },
                "translation": {
                    "en": "Say, [O Muhammad], \"I am only a warner, and there is not any deity except Allah, the One, the Prevailing.",
                    "id": "Katakanlah (Muhammad), “Sesungguhnya aku hanya seorang pemberi peringatan, tidak ada tuhan selain Allah Yang Maha Esa, Mahaperkasa,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4035",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4035.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4035.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sebetulnya para penghuni neraka itu di dunia dahulu telah menerima peringatan para rasul untuk mengesakan Allah dan menaati aturan-Nya. Katakanlah, wahai Nabi Muhammad kepada kaum musyrik, “Sesungguhnya aku hanya seorang pemberi peringatan. Adalah tugasku untuk menyampaikan kepadamu ancaman-Nya yang pedih bagi orang-orang yang mengingkari-Nya. Karena itu, yakinilah bahwa tidak ada Tuhan yang berhak disembah selain Allah. Dialah Yang Maha Esa dan tidak ada sekutu bagi-Nya, Mahaperkasa sehingga dapat mengalahkan siapa pun yang menentang-Nya.",
                        "long": "Allah memerintahkan kepada Rasul-Nya agar menyampaikan kepada orang-orang musyrik Mekah bahwa dirinya adalah rasul Allah yang menyampaikan janji dan ancaman-Nya kepada manusia. Ancaman-Nya ialah azab pedih yang akan ditimpakan kepada orang-orang yang menyalahi perintah-Nya sebagaimana yang telah ditimpakan kepada orang-orang sebelumnya, seperti kaum 'Ad, Samud, dan sebagainya. Selanjutnya Rasulullah saw menyatakan bahwa dia hanya pemberi berita dan bukanlah tukang sihir sebagaimana yang mereka tuduhkan dan bukan pula orang pendusta. Ia bukanlah seorang yang berkuasa atas manusia, sebagaimana diterangkan dalam firman Allah:\n\nMaka berilah peringatan, karena sesungguhnya engkau (Muhammad) hanyalah pemberi peringatan. Engkau bukanlah orang yang berkuasa atas mereka. (al-Gasyiyah/88: 21-22)\n\nAllah menerangkan tugas seorang rasul dan batas-batas kemampuannya. Dia menerangkan ajaran yang harus disampaikan kepada orang-orang kafir yaitu: Tidak ada satu pun Tuhan yang berhak disembah kecuali Allah, Tuhan Yang Maha Esa, tiada sekutu bagi-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4036,
                    "inSurah": 66
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "رَبُّ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا الْعَزِيزُ الْغَفَّارُ",
                    "transliteration": {
                        "en": "Rabbus samaawaati wal ardi wa maa bainahumal 'Azeezul Ghaffaar"
                    }
                },
                "translation": {
                    "en": "Lord of the heavens and the earth and whatever is between them, the Exalted in Might, the Perpetual Forgiver.\"",
                    "id": "(yaitu) Tuhan langit dan bumi dan apa yang ada di antara keduanya, Yang Mahaperkasa, Maha Pengampun.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4036",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4036.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4036.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dialah Tuhan Pencipta langit dan bumi dan apa yang ada di antara keduanya. Dia menciptakan, menguasai, mengatur, mengawasi, dan memelihara kelangsungan ciptaan-Nya. Dialah Yang Mahaperkasa dalam mengatur kerajaan-Nya, Maha Pengampun atas dosa-dosa hamba yang memohon ampunan-Nya.”",
                        "long": "Dialah Tuhan yang tidak dapat ditandingi oleh siapa pun. Tuhan Yang Maha Esa Mahaperkasa, Mahakuasa, menguasai, mengatur, mengawasi, dan memelihara kelangsungan hidup segala sesuatu yang ada di langit dan bumi. Dialah Tuhan Yang Maha Mengampuni segala dosa-dosa hamba yang dikehendaki-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4037,
                    "inSurah": 67
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قُلْ هُوَ نَبَأٌ عَظِيمٌ",
                    "transliteration": {
                        "en": "Qul huwa naba'un 'azeem"
                    }
                },
                "translation": {
                    "en": "Say, \"It is great news",
                    "id": "Katakanlah, “Itu (Al-Qur'an) adalah berita besar,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4037",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4037.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4037.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Wahai Nabi Muhammad, katakanlah kepada orang-orang kafir, “Ajakanku mengesakan Allah dan peringatanku tentang siksa akhirat itu adalah berita besar",
                        "long": "Nabi Muhammad diperintahkan untuk mengatakan kepada orang-orang musyrik bahwa berita tentang rasul atau utusan Allah yang memberi peringatan kepada manusia dan berita keesaan dan kekuasaan-Nya, adalah berita yang sangat besar faedahnya bagi seluruh manusia. Berita itu dapat menyelamatkan manusia dari kesesatan, dapat menunjukkan kepada manusia jalan yang lurus, jalan kebahagiaan hidup di dunia dan akhirat. Akan tetapi, kebanyakan manusia tidak mau mengerti bahkan mereka berpaling dari agama Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4038,
                    "inSurah": 68
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَنتُمْ عَنْهُ مُعْرِضُونَ",
                    "transliteration": {
                        "en": "Antum 'anhu mu'ridoon"
                    }
                },
                "translation": {
                    "en": "From which you turn away.",
                    "id": "yang kamu berpaling darinya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4038",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4038.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4038.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "yang selama ini kamu berpaling darinya, wahai orang-orang kafir. Berita dalam Al-Qur’an itu benar adanya, tetapi banyak manusia mengingkari.”",
                        "long": "Nabi Muhammad diperintahkan untuk mengatakan kepada orang-orang musyrik bahwa berita tentang rasul atau utusan Allah yang memberi peringatan kepada manusia dan berita keesaan dan kekuasaan-Nya, adalah berita yang sangat besar faedahnya bagi seluruh manusia. Berita itu dapat menyelamatkan manusia dari kesesatan, dapat menunjukkan kepada manusia jalan yang lurus, jalan kebahagiaan hidup di dunia dan akhirat. Akan tetapi, kebanyakan manusia tidak mau mengerti bahkan mereka berpaling dari agama Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4039,
                    "inSurah": 69
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مَا كَانَ لِيَ مِنْ عِلْمٍ بِالْمَلَإِ الْأَعْلَىٰ إِذْ يَخْتَصِمُونَ",
                    "transliteration": {
                        "en": "Maa kaana liya min 'ilmim bilmala il a'laaa iz yakhtasimoon"
                    }
                },
                "translation": {
                    "en": "I had no knowledge of the exalted assembly [of angels] when they were disputing [the creation of Adam].",
                    "id": "Aku tidak mempunyai pengetahuan sedikit pun tentang al-mala’ul a’la (malaikat) itu ketika mereka berbantah-bantahan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4039",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4039.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4039.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Katakanlah pula kepada mereka, “Aku tidak mempunyai pengetahuan sedikit pun tentang al-mala’ul a‘là itu, yaitu malaikat, ketika mereka berbantah-bantahan terhadap keputusan Allah terkait penciptaan Nabi Adam sebagai khalifah di bumi.",
                        "long": "Selanjutnya Rasulullah diperintahkan Allah menyatakan kepada orang-orang musyrik Mekah bahwa seandainya Allah tidak menurunkan wahyu kepadanya, tentu ia tidak akan mengetahui para malaikat yang selalu tunduk dan patuh kepada Allah. Ia juga tidak akan mengetahui pembicaraan yang dilakukan para malaikat, Iblis, dan Adam di hadapan Allah. Malaikat dan Adam tunduk dan patuh kepada Allah, sedang Iblis ingkar dan durhaka kepada-Nya.\n\nPada akhir ayat ini Rasulullah menegaskan lagi tugas yang diberikan Allah, \"Aku ini hanyalah seorang rasul yang memberi petunjuk dan peringatan, bukanlah seorang yang dapat memaksa manusia masuk agama Islam.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4040,
                    "inSurah": 70
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِن يُوحَىٰ إِلَيَّ إِلَّا أَنَّمَا أَنَا نَذِيرٌ مُّبِينٌ",
                    "transliteration": {
                        "en": "Iny-yoohaaa ilaiya illaaa annnamaaa ana nazeerum mubeen"
                    }
                },
                "translation": {
                    "en": "It has not been revealed to me except that I am a clear warner.\"",
                    "id": "Yang diwahyukan kepadaku, bahwa aku hanyalah seorang pemberi peringatan yang nyata.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4040",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4040.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4040.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Yang diwahyukan kepadaku hanyalah kepastian bahwa aku hanyalah seorang rasul pemberi peringatan dan petunjuk yang nyata tentang adanya siksa di akhirat bagi orang-orang yang mengingkari para utusan Allah.”",
                        "long": "Selanjutnya Rasulullah diperintahkan Allah menyatakan kepada orang-orang musyrik Mekah bahwa seandainya Allah tidak menurunkan wahyu kepadanya, tentu ia tidak akan mengetahui para malaikat yang selalu tunduk dan patuh kepada Allah. Ia juga tidak akan mengetahui pembicaraan yang dilakukan para malaikat, Iblis, dan Adam di hadapan Allah. Malaikat dan Adam tunduk dan patuh kepada Allah, sedang Iblis ingkar dan durhaka kepada-Nya.\n\nPada akhir ayat ini Rasulullah menegaskan lagi tugas yang diberikan Allah, \"Aku ini hanyalah seorang rasul yang memberi petunjuk dan peringatan, bukanlah seorang yang dapat memaksa manusia masuk agama Islam.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4041,
                    "inSurah": 71
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِذْ قَالَ رَبُّكَ لِلْمَلَائِكَةِ إِنِّي خَالِقٌ بَشَرًا مِّن طِينٍ",
                    "transliteration": {
                        "en": "Iz qaala Rabbuka lilmalaaa'ikati innee khaaliqum basharam min teen"
                    }
                },
                "translation": {
                    "en": "[So mention] when your Lord said to the angels, \"Indeed, I am going to create a human being from clay.",
                    "id": "(Ingatlah) ketika Tuhanmu berfirman kepada malaikat, “Sesungguhnya Aku akan menciptakan manusia dari tanah."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4041",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4041.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4041.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Usai menafikan pengetahuan Rasulullah menyangkut al-Mala’ul-A‘la kecuali apa yang sudah diwahyukan oleh Allah, pada ayat berikut Allah lalu menguraikan sekelumit tentang al-Mala’ul-A‘la dan penciptaan Nabi Adam. Ingatlah ketika Tuhanmu berfirman kepada malaikat, “Sesungguhnya Aku akan menciptakan manusia Adam sebagai khalifah di bumi. Aku menciptakannya dari tanah bercampur air.",
                        "long": "Pada ayat ini dijelaskan bahwa para malaikat dan iblis mengajukan pertanyaan kepada Allah setelah Dia menyampaikan kepada malaikat bahwa akan menciptakan seorang manusia dari tanah. Pernyataan mereka mengenai faedah adanya manusia yang akan diciptakan Allah itu. Pertanyaan ini diterangkan dalam firman Allah:\n\nDan (ingatlah) ketika Tuhanmu berfirman kepada para malaikat, \"Aku hendak menjadikan khalifah di bumi.\" Mereka berkata, \"Apakah Engkau hendak menjadikan orang yang merusak dan menumpahkan darah di sana, sedangkan kami bertasbih memuji-Mu dan menyucikan nama-Mu?\" Dia berfirman, \"Sungguh, Aku mengetahui apa yang tidak kamu ketahui.\" (al-Baqarah/2: 30)\n\nMengenai penciptaan manusia dari tanah, dijelaskan disini bahwa berdasarkan kajian ilmiah bahan penciptaan manusia adalah tanah, disebut lebih persis pada ayat ini yaitu tanah liat. Istilah liat biasa dipakai untuk menamai butiran tanah dengan ukuran paling kecil, diameter di bawah 0,5 mikron (= 1/2000 mm). Istilah liat juga biasa dipakai untuk menamai jenis mineral pembentuk butiran tanah paling kecil ini. Karena ukurannya yang kecil, liat bila dimasukkan ke dalam air akan bersifat koloidal: tidak melarut tetapi tersebar merata dan sulit dipisahkan dari air. Sebagai mineral, liat adalah sekelompok alumino-silikat hidrat yang strukturnya berlembar. Karena strukturnya, partikel liat mempunyai muatan elektrik. Sifat-sifat mineral liat lainnya adalah plastis, tetapi plastisitas ini menghilang apabila dipanaskan sampai temperatur tertentu karena struktur mineral berubah. Pemanfaatan liat secara tradisional didasarkan pada sifat-sifat fisiknya, antara lain karena mudah dibentuk dan mengeras jika dipanaskan dipanaskan, sehingga umum dipakai sebagai bahan pembuat barang gerabah atau tembikar dan keramik. Pemanfaatan liat secara modern lebih didasarkan pada sifat kimia-fisiknya, umumnya dipakai sebagai bahan katalis pada reaksi-reaksi kimia. Karena sifat-sifat kimia-fisik yang dimilikinya, liat merupakan bagian tanah yang paling mungkin memiliki peran besar pada proses terbentuknya awal kehidupan di muka bumi termasuk penciptaan manusia (lihat juga al-An'am/6: 2, Fathir/35: 11; al-hijr/15: 26-28-33; al-Mu'minun/23: 12, 14; ash-shaffat/37: 11)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4042,
                    "inSurah": 72
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَإِذَا سَوَّيْتُهُ وَنَفَخْتُ فِيهِ مِن رُّوحِي فَقَعُوا لَهُ سَاجِدِينَ",
                    "transliteration": {
                        "en": "Fa-iza sawwaituhoo wa nafakhtu feehi mir roohee faqa'oo lahoo saajideen"
                    }
                },
                "translation": {
                    "en": "So when I have proportioned him and breathed into him of My [created] soul, then fall down to him in prostration.\"",
                    "id": "Kemudian apabila telah Aku sempurnakan kejadiannya dan Aku tiupkan roh (ciptaan)-Ku kepadanya; maka tunduklah kamu dengan bersujud kepadanya.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4042",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4042.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4042.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kemudian, apabila telah Aku sempurnakan kejadian fisik-nya dengan anggota tubuh dan bentuk yang sempurna dan Aku tiupkan roh ciptaan-Ku kepadanya, maka tunduklah kamu semua dengan bersujud penuh hormat kepadanya, bukan sujud penghambaan dan pengagungan.",
                        "long": "Allah menyampaikan kepada malaikat bahwa apabila Ia telah menyempurnakan kejadian manusia dan meniupkan roh ke dalam tubuhnya, mereka diperintahkan untuk sujud kepada Adam, sebagai tanda penghormatan kepadanya.\n\nPada ayat ini diterangkan salah satu proses penciptaan Adam, yaitu dari tanah. Para malaikat bersujud menghormatinya, karena taat kepada Allah, kecuali Iblis. Ia enggan menghormati Adam, sehingga ia termasuk makhluk yang tidak taat kepada Allah. Pembangkangan Iblis terhadap perintah sujud kepada Adam telah disebutkan dalam firmannya:\n\nDan (ingatlah) ketika Kami berfirman kepada para malaikat, \"Sujudlah kamu kepada Adam!\" Maka mereka pun sujud kecuali Iblis. Ia menolak dan menyombongkan diri, dan ia termasuk golongan yang kafir. (al-Baqarah/2: 34)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4043,
                    "inSurah": 73
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَسَجَدَ الْمَلَائِكَةُ كُلُّهُمْ أَجْمَعُونَ",
                    "transliteration": {
                        "en": "Fasajadal malaaa'ikatu kulluhum ajma'oon"
                    }
                },
                "translation": {
                    "en": "So the angels prostrated - all of them entirely.",
                    "id": "Lalu para malaikat itu bersujud semuanya,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4043",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4043.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4043.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sempurnalah kejadian Adam, lalu dengan serta-merta para malaikat itu bersujud semuanya sebagai bentuk penghormatan kepadanya dan bukti ketaatan kepada perintah Allah.",
                        "long": "Allah menyampaikan kepada malaikat bahwa apabila Ia telah menyempurnakan kejadian manusia dan meniupkan roh ke dalam tubuhnya, mereka diperintahkan untuk sujud kepada Adam, sebagai tanda penghormatan kepadanya.\n\nPada ayat ini diterangkan salah satu proses penciptaan Adam, yaitu dari tanah. Para malaikat bersujud menghormatinya, karena taat kepada Allah, kecuali Iblis. Ia enggan menghormati Adam, sehingga ia termasuk makhluk yang tidak taat kepada Allah. Pembangkangan Iblis terhadap perintah sujud kepada Adam telah disebutkan dalam firmannya:\n\nDan (ingatlah) ketika Kami berfirman kepada para malaikat, \"Sujudlah kamu kepada Adam!\" Maka mereka pun sujud kecuali Iblis. Ia menolak dan menyombongkan diri, dan ia termasuk golongan yang kafir. (al-Baqarah/2: 34)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4044,
                    "inSurah": 74
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِلَّا إِبْلِيسَ اسْتَكْبَرَ وَكَانَ مِنَ الْكَافِرِينَ",
                    "transliteration": {
                        "en": "Illaaa Iblees; istakbara wa kaana minal kaafireen"
                    }
                },
                "translation": {
                    "en": "Except Iblees; he was arrogant and became among the disbelievers.",
                    "id": "kecuali Iblis; ia menyombongkan diri dan ia termasuk golongan yang kafir."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4044",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4044.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4044.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Mereka semua bersujud, kecuali Iblis; ia enggan bersujud di hadapan Adam karena menyombongkan diri dan enggan menaati kepada Allah, dan ia termasuk golongan yang kafir.",
                        "long": "Allah menyampaikan kepada malaikat bahwa apabila Ia telah menyempurnakan kejadian manusia dan meniupkan roh ke dalam tubuhnya, mereka diperintahkan untuk sujud kepada Adam, sebagai tanda penghormatan kepadanya.\n\nPada ayat ini diterangkan salah satu proses penciptaan Adam, yaitu dari tanah. Para malaikat bersujud menghormatinya, karena taat kepada Allah, kecuali Iblis. Ia enggan menghormati Adam, sehingga ia termasuk makhluk yang tidak taat kepada Allah. Pembangkangan Iblis terhadap perintah sujud kepada Adam telah disebutkan dalam firmannya:\n\nDan (ingatlah) ketika Kami berfirman kepada para malaikat, \"Sujudlah kamu kepada Adam!\" Maka mereka pun sujud kecuali Iblis. Ia menolak dan menyombongkan diri, dan ia termasuk golongan yang kafir. (al-Baqarah/2: 34)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4045,
                    "inSurah": 75
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالَ يَا إِبْلِيسُ مَا مَنَعَكَ أَن تَسْجُدَ لِمَا خَلَقْتُ بِيَدَيَّ ۖ أَسْتَكْبَرْتَ أَمْ كُنتَ مِنَ الْعَالِينَ",
                    "transliteration": {
                        "en": "Qaala yaaa Ibleesu maa man'aka an tasjuda limaa khalaqtu biyadai; astakbarta am kunta min 'aaleen"
                    }
                },
                "translation": {
                    "en": "[Allah] said, \"O Iblees, what prevented you from prostrating to that which I created with My hands? Were you arrogant [then], or were you [already] among the haughty?\"",
                    "id": "(Allah) berfirman, “Wahai Iblis, apakah yang menghalangi kamu sujud kepada yang telah Aku ciptakan dengan kekuasaan-Ku. Apakah kamu menyombongkan diri atau kamu (merasa) termasuk golongan yang (lebih) tinggi?”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4045",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4045.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4045.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Mengetahui hal tersebut Allah bertanya, “Wahai Iblis, apakah yang menghalangi kamu sujud dengan hormat kepada Adam yang telah Aku ciptakan dengan kekuasaan-Ku dan Aku muliakan? Apakah kamu menyombongkan diri dengan mengabaikan perintah-Ku atau kamu merasa termasuk golongan yang lebih tinggi dan terhormat daripada Adam?”",
                        "long": "Allah berkata kepada Iblis, \"Hai Iblis, apa yang menyebabkanmu enggan sujud menghormati Adam, makhluk yang telah Aku ciptakan sendiri dengan kekuasaan-Ku? Aku sendirilah yang menciptakan Adam itu, bukan makhluk-Ku yang menciptakannya. Kenapa kamu berlaku angkuh dan sombong. Apakah kamu telah merasa dirimu lebih tinggi dan lebih terhormat di antara makhluk-makhluk yang telah Aku ciptakan, sehingga kamu berpendapat bahwa kamu berhak dan berwenang berbuat apa yang kamu inginkan?\"\n\nIblis menjawab dan memberikan alasan pembangkangannya. Ia mengatakan bahwa ia lebih baik daripada Adam karena Allah menjadikannya dari api, sedang Adam dari tanah. Menurut Iblis, api lebih baik daripada tanah karena sifat api selalu meninggi dan tanah selalu di bawah. Padahal, materi asal itu tidak bisa dijadikan indikator kemuliaan makhluk. Kemuliaan itu tergantung pada ketaatan dan kepatuhan kepada Allah. Percakapan di atas disebutkan dalam firman Allah:\n\n(Allah) berfirman, \"Apakah yang menghalangimu (sehingga) kamu tidak bersujud (kepada Adam) ketika Aku menyuruhmu?\" (Iblis) menjawab, \"Aku lebih baik daripada dia. Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.\"(al-A.'raf/7: 12)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4046,
                    "inSurah": 76
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالَ أَنَا خَيْرٌ مِّنْهُ ۖ خَلَقْتَنِي مِن نَّارٍ وَخَلَقْتَهُ مِن طِينٍ",
                    "transliteration": {
                        "en": "Qaala ana khairum minah; khalaqtanee min naarinw wa khalaqtahoo min teen"
                    }
                },
                "translation": {
                    "en": "He said, \"I am better than him. You created me from fire and created him from clay.\"",
                    "id": "(Iblis) berkata, “Aku lebih baik daripadanya, karena Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4046",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4046.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4046.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Iblis berkata, “Aku lebih baik daripadanya, karena Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.” Iblis mengira api lebih baik daripada tanah karena api selalu membumbung sedangkan tanah selalu di bawah (Lihat pula: Surah al-A‘ràf/7: 12).",
                        "long": "Allah berkata kepada Iblis, \"Hai Iblis, apa yang menyebabkanmu enggan sujud menghormati Adam, makhluk yang telah Aku ciptakan sendiri dengan kekuasaan-Ku? Aku sendirilah yang menciptakan Adam itu, bukan makhluk-Ku yang menciptakannya. Kenapa kamu berlaku angkuh dan sombong. Apakah kamu telah merasa dirimu lebih tinggi dan lebih terhormat di antara makhluk-makhluk yang telah Aku ciptakan, sehingga kamu berpendapat bahwa kamu berhak dan berwenang berbuat apa yang kamu inginkan?\"\n\nIblis menjawab dan memberikan alasan pembangkangannya. Ia mengatakan bahwa ia lebih baik daripada Adam karena Allah menjadikannya dari api, sedang Adam dari tanah. Menurut Iblis, api lebih baik daripada tanah karena sifat api selalu meninggi dan tanah selalu di bawah. Padahal, materi asal itu tidak bisa dijadikan indikator kemuliaan makhluk. Kemuliaan itu tergantung pada ketaatan dan kepatuhan kepada Allah. Percakapan di atas disebutkan dalam firman Allah:\n\n(Allah) berfirman, \"Apakah yang menghalangimu (sehingga) kamu tidak bersujud (kepada Adam) ketika Aku menyuruhmu?\" (Iblis) menjawab, \"Aku lebih baik daripada dia. Engkau ciptakan aku dari api, sedangkan dia Engkau ciptakan dari tanah.\"(al-A.'raf/7: 12)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4047,
                    "inSurah": 77
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالَ فَاخْرُجْ مِنْهَا فَإِنَّكَ رَجِيمٌ",
                    "transliteration": {
                        "en": "Qaala fakhruj minhaa fainnaka rajeem"
                    }
                },
                "translation": {
                    "en": "[Allah] said, \"Then get out of Paradise, for indeed, you are expelled.",
                    "id": "(Allah) berfirman, “Kalau begitu keluarlah kamu dari surga! Sesungguhnya kamu adalah makhluk yang terkutuk."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4047",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4047.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4047.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Mengetahui kedurhakaan Iblis, Allah mengusirnya seraya berfirman, “Kalau begitu, keluarlah kamu dari surga! Sesungguhnya kamu adalah makhluk yang terkutuk, terusir dari rahmat-Ku, dan terlarang dari surga-Ku.",
                        "long": "Karena kedurhakaan Iblis yang enggan menaati perintah Allah, maka Allah mengusir Iblis dari surga, dan menjadikannya sebagai makhluk yang terkutuk. Kutukan itu tetap berlaku sampai hari Kiamat, yaitu hari pembalasan terhadap semua perbuatan manusia.\n\nFirman Allah:\n\n(Allah) berfirman, \"Maka turunlah kamu darinya (surga); karena kamu tidak sepatutnya menyombongkan diri di dalamnya. Keluarlah! Sesungguhnya kamu termasuk makhluk yang hina.\"( al-A.'raf/7: 13)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4048,
                    "inSurah": 78
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِنَّ عَلَيْكَ لَعْنَتِي إِلَىٰ يَوْمِ الدِّينِ",
                    "transliteration": {
                        "en": "Wa inna 'alaika la'nateee ilaa Yawmid Deen"
                    }
                },
                "translation": {
                    "en": "And indeed, upon you is My curse until the Day of Recompense.\"",
                    "id": "Dan sungguh, kutukan-Ku tetap atasmu sampai hari pembalasan.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4048",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4048.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4048.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sungguh, kutukan-Ku tetap berlaku atasmu sampai hari pembalasan, hari ketika seluruh perbuatan diperhitungkan dan dibalas.” Iblis berkata seraya memohon,",
                        "long": "Karena kedurhakaan Iblis yang enggan menaati perintah Allah, maka Allah mengusir Iblis dari surga, dan menjadikannya sebagai makhluk yang terkutuk. Kutukan itu tetap berlaku sampai hari Kiamat, yaitu hari pembalasan terhadap semua perbuatan manusia.\n\nFirman Allah:\n\n(Allah) berfirman, \"Maka turunlah kamu darinya (surga); karena kamu tidak sepatutnya menyombongkan diri di dalamnya. Keluarlah! Sesungguhnya kamu termasuk makhluk yang hina.\"( al-A.'raf/7: 13)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4049,
                    "inSurah": 79
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالَ رَبِّ فَأَنظِرْنِي إِلَىٰ يَوْمِ يُبْعَثُونَ",
                    "transliteration": {
                        "en": "Qaala Rabbi fa anzirneee ilaa Yawmi yub'asoon"
                    }
                },
                "translation": {
                    "en": "He said, \"My Lord, then reprieve me until the Day they are resurrected.\"",
                    "id": "(Iblis) berkata, “Ya Tuhanku, tangguhkanlah aku sampai pada hari mereka dibangkitkan.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4049",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4049.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4049.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "“Ya Tuhanku, karena Engkau telah menjadikan aku makhluk-Mu yang terlaknat, maka tangguhkanlah kematianku dan izinkanlah aku hidup sampai pada hari mereka dibangkitkan supaya aku bisa menggoda mereka sepanjang hayat.”",
                        "long": "Setelah menjadi makhluk yang terkutuk, Iblis memohon kepada Allah, \"Wahai Tuhanku, jika Engkau telah menjadikan aku sebagai makhluk-Mu yang terkutuk dan telah terjauh dari rahmat-Mu, maka aku mohon agar umurku dipanjangkan, hingga sampai hari kebangkitan nanti. Janganlah engkau wafatkan aku selama dunia masih ada.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4050,
                    "inSurah": 80
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالَ فَإِنَّكَ مِنَ الْمُنظَرِينَ",
                    "transliteration": {
                        "en": "Qaala fa innaka minal munzareen"
                    }
                },
                "translation": {
                    "en": "[Allah] said, \"So indeed, you are of those reprieved",
                    "id": "(Allah) berfirman, “Maka sesungguhnya kamu termasuk golongan yang diberi penangguhan,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4050",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4050.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4050.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah berfirman, “Maka sesungguhnya kamu, wahai Iblis, termasuk golongan yang diberi penangguhan.",
                        "long": "Allah mengabulkan permohonan Iblis itu dengan membiarkannya hidup sampai waktu yang ditentukan, sebagaimana firman Allah:\n\n(Iblis) menjawab, \"Berilah aku penangguhan waktu, sampai hari mereka dibangkitkan.\"(Allah) berfirman, \"Benar, kamu termasuk yang diberi penangguhan waktu.\"( al-A.'raf/7: 14-15)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4051,
                    "inSurah": 81
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِلَىٰ يَوْمِ الْوَقْتِ الْمَعْلُومِ",
                    "transliteration": {
                        "en": "Ilaa Yawmil waqtil ma'loom"
                    }
                },
                "translation": {
                    "en": "Until the Day of the time well-known.\"",
                    "id": "sampai pada hari yang telah ditentukan waktunya (hari Kiamat).”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4051",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4051.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4051.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Aku akan memanjangkan umurmu dan menunda kematianmu sampai pada hari yang telah ditentukan waktunya, yaitu hari Kiamat.” Dengan penundaan ini Allah bermaksud memberi cobaan kepada hamba-Nya untuk menguji siapa yang menaati perintah Allah dan siapa yang mengikuti langkah Iblis.",
                        "long": "Allah mengabulkan permohonan Iblis itu dengan membiarkannya hidup sampai waktu yang ditentukan, sebagaimana firman Allah:\n\n(Iblis) menjawab, \"Berilah aku penangguhan waktu, sampai hari mereka dibangkitkan.\"(Allah) berfirman, \"Benar, kamu termasuk yang diberi penangguhan waktu.\"( al-A.'raf/7: 14-15)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4052,
                    "inSurah": 82
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالَ فَبِعِزَّتِكَ لَأُغْوِيَنَّهُمْ أَجْمَعِينَ",
                    "transliteration": {
                        "en": "Qaala fabi'izzatika la ughwiyannahum ajma'een"
                    }
                },
                "translation": {
                    "en": "[Iblees] said, \"By your might, I will surely mislead them all",
                    "id": "(Iblis) menjawab, “Demi kemuliaan-Mu, pasti aku akan menyesatkan mereka semuanya,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4052",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4052.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4052.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Iblis menjawab dan memohon lagi, “Wahai Tuhanku, demi kekuasan dan kemuliaan-Mu, berilah aku kesempatan menggoda manusia, pasti aku akan menyesatkan mereka semuanya dengan tipu dayaku sehingga mereka memandang baik perbuatan buruk.",
                        "long": "Selanjutnya Iblis memohon lagi, \"Wahai Tuhanku, demi kekuasaan dan kemuliaan Engkau, berilah aku kesempatan untuk menggoda dan menyesatkan manusia dari jalan Engkau, dengan menjadikan mereka memandang baik perbuatan buruk dan maksiat yang mereka kerjakan.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4053,
                    "inSurah": 83
                },
                "meta": {
                    "juz": 23,
                    "page": 457,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِلَّا عِبَادَكَ مِنْهُمُ الْمُخْلَصِينَ",
                    "transliteration": {
                        "en": "Illaa 'ibaadaka minhumul mukhlaseen"
                    }
                },
                "translation": {
                    "en": "Except, among them, Your chosen servants.\"",
                    "id": "kecuali hamba-hamba-Mu yang terpilih di antara mereka.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4053",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4053.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4053.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Akan aku tipu semua manusia, kecuali hamba-hamba-Mu yang terpilih di antara mereka, yaitu mereka yang Kauberi taufik untuk menaati petunjuk dan perintah-Mu. Aku hanya akan mampu menggoda dan menyesatkan mereka yang kafir dan lemah imannya.”",
                        "long": "Selanjutnya Iblis mengatakan, \"Tentu saja hamba-hamba Engkau yang kuat imannya, yang tunduk dan patuh kepada Engkau, tidak dapat aku goda dan sesatkan. Hanya orang-orang kafir seperti aku dan orang-orang yang lemah imannya yang mungkin aku sesatkan.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4054,
                    "inSurah": 84
                },
                "meta": {
                    "juz": 23,
                    "page": 458,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قَالَ فَالْحَقُّ وَالْحَقَّ أَقُولُ",
                    "transliteration": {
                        "en": "Qaala falhaqq, walhaqqa aqool"
                    }
                },
                "translation": {
                    "en": "[Allah] said, \"The truth [is My oath], and the truth I say -",
                    "id": "(Allah) berfirman, “Maka yang benar (adalah sumpahku), dan hanya kebenaran itulah yang Aku katakan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4054",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4054.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4054.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah mengabulkan permintaan Iblis seraya berfirman, “Maka yang benar adalah sumpah-Ku, dan janji-Ku pasti benar. Hanya kebenaran itulah yang Aku katakan.",
                        "long": "Allah mengabulkan permintaan Iblis dan berkata, \"Yang hak itu ada pada-Ku. Sungguh, yang hak itulah Aku katakan. Neraka Jahanam itu aku penuhi dengan engkau dan anak cucumu yang datang kemudian dan yang mengikuti engkau dalam kesesatan dari sebagian anak cucu Adam. Allah mengancam orang-orang yang menjadikan setan sebagai pemimpin-pemimpin mereka dan mengabaikan perintah Allah yang menghantarkan mereka kepada kebahagiaan di dunia dan akhirat, Allah berfirman:\n\ndan pasti kusesatkan mereka, dan akan kubangkitkan angan-angan kosong pada mereka dan akan kusuruh mereka memotong telinga-telinga binatang ternak, (lalu mereka benar-benar memotongnya), dan akan aku suruh mereka mengubah ciptaan Allah, (lalu mereka benar-benar mengubahnya). Barangsiapa menjadikan setan sebagai pelindung selain Allah, maka sungguh, dia menderita kerugian yang nyata.(an-Nisa'/4: 119)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4055,
                    "inSurah": 85
                },
                "meta": {
                    "juz": 23,
                    "page": 458,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَأَمْلَأَنَّ جَهَنَّمَ مِنكَ وَمِمَّن تَبِعَكَ مِنْهُمْ أَجْمَعِينَ",
                    "transliteration": {
                        "en": "La amla'annna Jahannama minka wa mimman tabi'aka minhum ajma'een"
                    }
                },
                "translation": {
                    "en": "[That] I will surely fill Hell with you and those of them that follow you all together.\"",
                    "id": "Sungguh, Aku akan memenuhi neraka Jahanam dengan kamu dan dengan orang-orang yang mengikutimu di antara mereka semuanya.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4055",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4055.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4055.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sungguh, Aku akan memenuhi neraka Jahanam dengan kamu dan keturunanmu, wahai Iblis, dan dengan orang-orang yang mengikutimu dalam kesesatan di antara mereka semuanya, yakni anak cucu Adam.”",
                        "long": "Allah mengabulkan permintaan Iblis dan berkata, \"Yang hak itu ada pada-Ku. Sungguh, yang hak itulah Aku katakan. Neraka Jahanam itu aku penuhi dengan engkau dan anak cucumu yang datang kemudian dan yang mengikuti engkau dalam kesesatan dari sebagian anak cucu Adam. Allah mengancam orang-orang yang menjadikan setan sebagai pemimpin-pemimpin mereka dan mengabaikan perintah Allah yang menghantarkan mereka kepada kebahagiaan di dunia dan akhirat, Allah berfirman:\n\ndan pasti kusesatkan mereka, dan akan kubangkitkan angan-angan kosong pada mereka dan akan kusuruh mereka memotong telinga-telinga binatang ternak, (lalu mereka benar-benar memotongnya), dan akan aku suruh mereka mengubah ciptaan Allah, (lalu mereka benar-benar mengubahnya). Barangsiapa menjadikan setan sebagai pelindung selain Allah, maka sungguh, dia menderita kerugian yang nyata.(an-Nisa'/4: 119)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4056,
                    "inSurah": 86
                },
                "meta": {
                    "juz": 23,
                    "page": 458,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قُلْ مَا أَسْأَلُكُمْ عَلَيْهِ مِنْ أَجْرٍ وَمَا أَنَا مِنَ الْمُتَكَلِّفِينَ",
                    "transliteration": {
                        "en": "Qul maaa as'alukum 'alaihi min ajrinw wa maaa ana minal mutakallifeen"
                    }
                },
                "translation": {
                    "en": "Say, [O Muhammad], \"I do not ask you for the Qur'an any payment, and I am not of the pretentious",
                    "id": "Katakanlah (Muhammad), “Aku tidak meminta imbalan sedikit pun kepadamu atasnya (dakwahku); dan aku bukanlah termasuk orang yang mengada-ada."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4056",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4056.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4056.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Wahai Nabi Muhammad, katakanlah kepada orang-orang kafir, “Aku diutus oleh Allah untuk mendakwahkan risalah dan aku tidak meminta imbalan atau upah sedikit pun kepadamu atasnya. Tugasku hanya-lah menyampaikan risalah dan Allah-lah yang akan memberiku upah atas tugas itu. Dan ketahuilah bahwa aku bukanlah termasuk orang yang mengada-ada dan suka membuat-buat.",
                        "long": "Allah memerintahkan kepada Rasulullah saw agar menyampaikan kepada orang-orang musyrik bahwa ia tidak mengharapkan apalagi meminta upah kepada mereka sebagai imbalan dari tugas menyampaikan agama Allah. Sedikit pun Rasul tidak mengharapkannya. Hanya Allah yang akan memberi upah padanya. Orang-orang telah mengenal rasul dengan sebaik-baiknya bahwa ia tidak pernah mengada-ada dan membuat yang bukan-bukan.\"\n\nDari ayat ini dipahami agar orang-orang yang beriman meniru apa yang telah diperbuat Rasulullah, yaitu selalu menyampaikan agama Allah kepada manusia, walaupun hanya sedikit yang diketahuinya. Imam Muslim meriwayatkan bahwa Ibnu Mas'ud berkata:\n\nWahai sekalian manusia, barangsiapa di antara kamu yang memperoleh pengetahuan, maka hendaklah ia mengatakannya. Dan barangsiapa yang tidak mengetahui hendaklah ia menyatakan, \"Allah Taala lebih mengetahui,\". Allah Taala berfirman kepada Rasulullah saw, \"Qul ma'as 'alukum . . .\" sampai akhir ayat\"."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4057,
                    "inSurah": 87
                },
                "meta": {
                    "juz": 23,
                    "page": 458,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنْ هُوَ إِلَّا ذِكْرٌ لِّلْعَالَمِينَ",
                    "transliteration": {
                        "en": "In huwa illaa zikrul lil'aalameen"
                    }
                },
                "translation": {
                    "en": "It is but a reminder to the worlds.",
                    "id": "(Al-Qur'an) ini tidak lain hanyalah peringatan bagi seluruh alam."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4057",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4057.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4057.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Al-Qur’an ini tidak lain hanyalah peringatan dari Allah. Allah memenuhinya dengan petunjuk bagi seluruh alam, baik jin maupun manusia, menuju jalan yang lurus dan menjadikannya pembeda antara yang hak dan yang batil.",
                        "long": "Allah menegaskan bahwa Al-Qur'an ini berisi petunjuk dan pengajaran bagi jin dan manusia. Semua orang yang sehat akal pikirannya, tentu mengakui kebenarannya. Al-Qur'an merupakan petunjuk ke jalan yang lurus dan pembeda antara yang hak dan yang batil."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4058,
                    "inSurah": 88
                },
                "meta": {
                    "juz": 23,
                    "page": 458,
                    "manzil": 6,
                    "ruku": 395,
                    "hizbQuarter": 183,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَتَعْلَمُنَّ نَبَأَهُ بَعْدَ حِينٍ",
                    "transliteration": {
                        "en": "Wa lata'lamunna naba ahoo ba'da heen"
                    }
                },
                "translation": {
                    "en": "And you will surely know [the truth of] its information after a time.\"",
                    "id": "Dan sungguh, kamu akan mengetahui (kebenaran) beritanya (Al-Qur'an) setelah beberapa waktu lagi.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4058",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4058.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4058.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sungguh, wahai orang-orang kafir, kamu akan mengetahui kebenaran beritanya setelah beberapa waktu lagi. Tidak lama lagi, entah di dunia atau akhirat, kamu akan mendapati kebenaran isi Al-Qur’an, seperti janji dan ancaman Allah, kejadian di masa depan, dan hari kebangkitan.",
                        "long": "Pada akhir surah ini, Allah menyampaikan kepada orang-orang yang tidak mengindahkan seruan Rasulullah, bahwa kelak mereka setelah mati akan mengetahui apakah tindakan mereka itu salah atau benar."
                    }
                }
            }
        ]
    }
}