{
    "code": 200,
    "status": "OK.",
    "message": "Success fetching surah.",
    "data": {
        "number": 41,
        "sequence": 61,
        "numberOfVerses": 54,
        "name": {
            "short": "فصلت",
            "long": "سورة فصلت",
            "transliteration": {
                "en": "Fussilat",
                "id": "Fussilat"
            },
            "translation": {
                "en": "Explained in detail",
                "id": "Yang Dijelaskan"
            }
        },
        "revelation": {
            "arab": "مكة",
            "en": "Meccan",
            "id": "Makkiyyah"
        },
        "tafsir": {
            "id": "Surat Fushshilat terdiri atas 54 ayat, termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Al Mu'min. Dinamai Fushshilat (yang dijelaskan) karena ada hubungannya dengan perkataan Fushshilat yang terdapat pada permulaan surat ini yang berarti yang dijelaskan. Maksudnya ayat-ayatnya diperinci dengan jelas tentang hukum-hukum, keimanan, janji dan ancaman, budi pekerti, kisah, dan sebagainya. Dinamai juga dengan Haa Miim dan As Sajdah karena surat ini dimulai dengan Haa Miim dan dalam surat ini terdapat ayat Sajdah."
        },
        "preBismillah": {
            "text": {
                "arab": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
                "transliteration": {
                    "en": "Bismillaahir Rahmaanir Raheem"
                }
            },
            "translation": {
                "en": "In the name of Allah, the Entirely Merciful, the Especially Merciful.",
                "id": "Dengan nama Allah Yang Maha Pengasih, Maha Penyayang."
            },
            "audio": {
                "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1",
                "secondary": [
                    "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1.mp3",
                    "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1.mp3"
                ]
            }
        },
        "verses": [
            {
                "number": {
                    "inQuran": 4219,
                    "inSurah": 1
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 413,
                    "hizbQuarter": 190,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "حم",
                    "transliteration": {
                        "en": "Haa Meeem"
                    }
                },
                "translation": {
                    "en": "Ha, Meem.",
                    "id": "Ha Mim"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4219",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4219.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4219.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Hà Mìm. Hanya Allah saja Yang Maha Tahu tentang apa maksudnya.",
                        "long": "Penjelasan tentang arti \"ha Mim\" dapat dilihat pada Al-Qur'an dan Tafsirnya jilid I, tentang keterangan arti dari fawatih as-suwar."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4220,
                    "inSurah": 2
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 413,
                    "hizbQuarter": 190,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "تَنزِيلٌ مِّنَ الرَّحْمَٰنِ الرَّحِيمِ",
                    "transliteration": {
                        "en": "Tanzeelum Minar-Rahmaanir-Raheem"
                    }
                },
                "translation": {
                    "en": "[This is] a revelation from the Entirely Merciful, the Especially Merciful -",
                    "id": "(Al-Qur'an ini) diturunkan dari Tuhan Yang Maha Pengasih, Maha Penyayang."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4220",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4220.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4220.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Al-Qur’an ini diturunkan secara bertahap dari Allah, Tuhan Yang Maha Pengasih kepada semua makhluk ciptaan-Nya, lagi Maha Penyayang hanya kepada orang-orang yang beriman.",
                        "long": "Ayat ini menerangkan bahwa Al-Qur'an berasal dari Allah Yang Maha Pemurah lagi Maha Penyayang, diturunkan kepada rasul-Nya, Muhammad saw, dengan perantaraan Malaikat Jibril.\n\nPada ayat ini dikatakan bahwa Al-Qur'an itu berasal dari Allah Yang Maha Pemurah lagi Maha Penyayang. Pernyataan ini mengandung maksud bahwa Al-Qur'an ini diturunkan kepada manusia sebagai tanda bahwa Allah Maha Pemurah dan Maha Pengasih kepada hamba-hamba-Nya. Al-Qur'an bagi manusia dapat diibaratkan sebagai obat bagi orang yang sakit guna menyembuhkan penyakitnya. Manusia sangat menginginkan kebahagiaan hidup di dunia dan akhirat. Mereka tidak mengetahui jalan yang harus ditempuh untuk mencapai keinginannya itu. Karena sifat Maha Pemurah dan Maha Penyayang kepada hamba-hamba-Nya itu, Allah menurunkan petunjuk ke jalan yang dimaksud sehingga manusia mencapai keinginannya itu. Petunjuk-petunjuk itu terdapat di dalam Al-Qur'an yang diturunkan-Nya kepada Nabi Muhammad.\n\nAllah berfirman:\n\nDan Kami tidak mengutus engkau (Muhammad) melainkan untuk (menjadi) rahmat bagi seluruh alam. (al-Anbiya'/21: 107)\n\nMaksud pernyataan bahwa Nabi Muhammad saw diutus ke dunia merupakan rahmat bagi semesta alam ialah Allah mengutusnya untuk menyampaikan agama Allah kepada manusia. Agama Allah itu merupakan rahmat bagi manusia, dan pokok-pokok agama Allah itu terdapat di dalam Al-Qur'an. Jadi yang menjadi rahmat utama itu ialah Al-Qur'an.\n\nFirman Allah:\n\nDan sungguh, (Al-Qur'an) ini benar-benar diturunkan oleh Tuhan seluruh alam, yang dibawa turun oleh Ar-Ruh Al-Amin (Jibril), ke dalam hatimu (Muhammad) agar engkau termasuk orang yang memberi peringatan, dengan bahasa Arab yang jelas. Dan sungguh, (Al-Qur'an) itu (disebut) dalam kitab-kitab orang yang terdahulu. (asy-Syu'ara'/26: 192-197)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4221,
                    "inSurah": 3
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 413,
                    "hizbQuarter": 190,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "كِتَابٌ فُصِّلَتْ آيَاتُهُ قُرْآنًا عَرَبِيًّا لِّقَوْمٍ يَعْلَمُونَ",
                    "transliteration": {
                        "en": "Kitaabun fussilat Aayaatuhoo Qur-aanan 'Arabiyyal liqawminy ya'lamoon"
                    }
                },
                "translation": {
                    "en": "A Book whose verses have been detailed, an Arabic Qur'an for a people who know,",
                    "id": "Kitab yang ayat-ayatnya dijelaskan, bacaan dalam bahasa Arab, untuk kaum yang mengetahui,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4221",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4221.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4221.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kitab itu adalah Al-Qur’an yang dalam ayat-ayatnya dijelaskan semua yang diperlukan oleh manusia untuk meraih kebahagiaan hidup duniawi dan ukhrawi, bacaan yang mulia dalam bahasa Arab, sebagai petunjuk untuk kaum yang mau dan berpotensi mengetahui.",
                        "long": "Al-Qur'an yang diturunkan kepada Nabi Muhammad terdiri atas ayat-ayat. Ayat-ayat itu diterangkan satu per satu dengan jelas. Setiap ayat dipisahkan dengan ayat-ayat yang lain, dengan tanda-tanda yang jelas pula. Ada permulaan dan akhir dari tiap-tiap surah. Isinya bermacam-macam petunjuk, ada yang berhubungan dengan pelajaran, nasihat, akhlak yang mulia, mensucikan jiwa, kisah-kisah rasul yang terdahulu dengan umat-umatnya, petunjuk ke jalan kebahagiaan hidup di dunia dan akhirat, dan sebagainya.\n\nAllah berfirman:\n\n(Inilah) Kitab yang ayat-ayatnya disusun dengan rapi kemudian dijelaskan secara terperinci, (yang diturunkan) dari sisi (Allah) Yang Mahabijaksana, Mahateliti. (Hud/11: 1)\n\nDiterangkan pula bahwa Al-Qur'an diturunkan berbahasa Arab, bahasa ibu dari rasul yang menyampaikannya dan sesuai pula dengan bahasa yang digunakan oleh bangsa yang pertama kali menerimanya. Dengan demikian, Al-Qur'an itu mudah dipahami kandungan dan maksudnya oleh mereka dan dengan mudah pula mereka menyampaikan kepada bangsa-bangsa lain di seluruh dunia, yang mempunyai bahasa ibu bukan bahasa Arab.\n\nAllah berfirman:\n\nDan Kami tidak mengutus seorang rasul pun, melainkan dengan bahasa kaumnya, agar dia dapat memberi penjelasan kepada mereka. (Ibrahim/14: 4)\n\nPada akhir ayat ini diterangkan bahwa Al-Qur'an itu berfaedah bagi yang mengetahui dan memahaminya. Maksudnya ialah bahwa Al-Qur'an itu akan berfaedah bagi orang-orang yang berpengetahuan, ingin mencari kebenaran yang hakiki, dan ingin memperoleh petunjuk yang benar yang dapat menghantarkan kepada kebahagiaan dunia dan akhirat. Mereka mempelajari Al-Qur'an, membandingkannya dengan ajaran-ajaran yang lain serta menyerap ajarannya dengan pengetahuan yang telah ada pada diri mereka. Mereka itu yang dapat memahami dan menyelami rahasia dan petunjuk Al-Qur'an.\n\nDari pengertian ini dapat dipahami bahwa orang-orang yang ada penyakit dalam hatinya tidak ingin mencari kebenaran, karena mereka telah terikat oleh agama atau kepercayaan yang telah mereka anut sebelumnya. Demikian juga dengan orang yang memperturutkan hawa nafsu, fanatik terhadap golongan, atau mengutamakan pangkat dan kedudukan, tidak akan dapat menyelami dan memahami isi Al-Qur'an, apalagi mendapat petunjuk darinya.\n\nSebagian ahli tafsir ada yang menafsirkan ayat ini dengan mengatakan bahwa Al-Qur'an akan dipahami oleh orang-orang yang mengetahui bahasa Arab, karena bahasa Arab itu adalah bahasa yang paling luas, lengkap, dan dalam maknanya, serta mudah memengaruhi jiwa. Waktu itu orang-orang Arab mengetahui bahasa dengan baik, banyak di antara mereka menjadi ahli bahasa, sastrawan yang terkenal, dan banyak pula yang menjadi penyair. Bahasa Arab Al-Qur'an adalah bahasa Arab yang sangat tinggi nilainya, baik gaya bahasanya maupun gramatikanya. Oleh karena itu, orang yang dapat memahami ayat-ayatnya hanyalah orang yang memiliki pengetahuan bahasa Arab yang mendalam."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4222,
                    "inSurah": 4
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 413,
                    "hizbQuarter": 190,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "بَشِيرًا وَنَذِيرًا فَأَعْرَضَ أَكْثَرُهُمْ فَهُمْ لَا يَسْمَعُونَ",
                    "transliteration": {
                        "en": "Basheeranw wa nazeeran fa-a'rada aksaruhum fahum laa yasma'oon"
                    }
                },
                "translation": {
                    "en": "As a giver of good tidings and a warner; but most of them turn away, so they do not hear.",
                    "id": "yang membawa berita gembira dan peringatan, tetapi kebanyakan mereka berpaling (darinya) serta tidak mendengarkan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4222",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4222.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4222.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Al-Qur’an itu adalah kitab yang membawa berita gembira bagi orang-orang yang beriman dan beramal saleh, dan peringatan bagi orang-orang yang membuat kerusakan di muka bumi, tetapi sangat disayangkan karena kebanyakan dari mereka orang-orang yang membuat kerusakan itu berpaling dari petunjuk-Nya serta hal itulah yang membuat mereka tidak mendengarkan yakni tidak menyambut berita gembira dan peringatan itu.",
                        "long": "Ayat ini menerangkan bahwa Al-Qur'an membawa berita gembira bagi orang-orang yang mengamalkan petunjuk-Nya. Ia juga membawa berita yang menakutkan bagi orang-orang yang mengingkarinya. Orang yang mengikuti petunjuknya akan memperoleh kenikmatan hidup di dunia dan akan dimasukkan ke dalam surga yang penuh kenikmatan di akhirat. Sedangkan orang yang mengingkarinya dan mendustakan ayat-ayatnya akan memperoleh kesengsaraan yang tidak terhingga di akhirat nanti.\n\nSekalipun demikian tujuan dan isi Al-Qur'an, namun orang-orang musyrik tetap tidak mengacuhkannya, bahkan mereka menyombongkan diri, tidak mau mendengarkan, apalagi mengikuti petunjuk-petunjuknya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4223,
                    "inSurah": 5
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 413,
                    "hizbQuarter": 190,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالُوا قُلُوبُنَا فِي أَكِنَّةٍ مِّمَّا تَدْعُونَا إِلَيْهِ وَفِي آذَانِنَا وَقْرٌ وَمِن بَيْنِنَا وَبَيْنِكَ حِجَابٌ فَاعْمَلْ إِنَّنَا عَامِلُونَ",
                    "transliteration": {
                        "en": "Wa qaaloo quloobunaa feee akinnatim mimmaa tad'oonaaa ilaihi wa feee aazaaninaa waqrunw wa mim baininaa wa bainika bijaabun fa'mal innanaa 'aamiloon"
                    }
                },
                "translation": {
                    "en": "And they say, \"Our hearts are within coverings from that to which you invite us, and in our ears is deafness, and between us and you is a partition, so work; indeed, we are working.\"",
                    "id": "Dan mereka berkata, “Hati kami sudah tertutup dari apa yang engkau seru kami kepadanya dan telinga kami sudah tersumbat, dan di antara kami dan engkau ada dinding, karena itu lakukanlah (sesuai kehendakmu), sesungguhnya kami akan melakukan (sesuai kehendak kami).”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4223",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4223.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4223.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Penolakan dan keberpalingan orang-orang musyrik Mekah terhadap Al-Qur’an itu mereka nyatakan dalam bentuk pengakuan langsung. Dan mereka orang-orang musyrik Mekah itu, berkata, “Hati dan akal pikiran kami sudah tertutup dan terkunci rapat dari apa yang engkau seru kami kepadanya, dan telinga kami sudah tersumbat sehingga kami tidak dapat mendengar apa pun yang engkau sampaikan, dan di antara kami dan engkau ada dinding pembatas yang sangat tebal. Oleh karena itu, lakukanlah apa yang sesuai menurut kehendakmu, dan demikian pula sesungguhnya kami akan melakukan apa yang sesuai menurut kehendak kami.”",
                        "long": "Pada ayat ini disebutkan penyebab orang-orang musyrik mengingkari dan mendustakan ayat-ayat Al-Qur'an, yaitu:\n\n1. Mereka menyatakan bahwa hati mereka telah tertutup, tidak dapat dimasuki oleh seruan kepada iman, melaksanakan petunjuk-petunjuk Al-Qur'an, dan yang disampaikan Muhammad saw.\n\n2. Mereka menyatakan bahwa telinga-telinga mereka telah tersumbat sehingga tidak dapat mendengar seruan Muhammad saw dan ayat-ayat Al-Qur'an yang dibacakan kepadanya.\n\n3. Mereka mengatakan bahwa antara mereka dan kaum Muslimin ada dinding pemisah yang menghalangi mereka menerima seruan itu.\n\nSebagian ahli tafsir berpendapat bahwa yang diterangkan ayat ini merupakan gambaran keadaan orang-orang musyrik yang jiwa dan hati mereka tidak dapat lagi memahami seruan Rasulullah saw dan tidak mau mengikuti petunjuk Al-Qur'an. Hati mereka diserupakan dengan benda yang terletak dalam suatu tempat yang tertutup, telinga mereka diserupakan dengan telinga orang tuli yang tidak dapat mendengar sesuatu pun, dan keadaan mereka diserupakan dengan orang yang berdiri di samping dinding tebal dan tinggi, sehingga tidak mengetahui apa yang terjadi di balik dinding itu.\n\nKarena seruan tidak berfaedah sedikit pun bagi orang-orang musyrik, mereka disuruh melakukan segala yang mereka inginkan, termasuk usaha tipu daya, menyiksa dan menyakiti orang-orang yang beriman, menjauhkan manusia dari Muhammad, dan menghancurkan Islam dan kaum Muslimin. Akan tetapi, Allah pun akan menjaga kaum Muslimin dari tindakan mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4224,
                    "inSurah": 6
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 413,
                    "hizbQuarter": 190,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قُلْ إِنَّمَا أَنَا بَشَرٌ مِّثْلُكُمْ يُوحَىٰ إِلَيَّ أَنَّمَا إِلَٰهُكُمْ إِلَٰهٌ وَاحِدٌ فَاسْتَقِيمُوا إِلَيْهِ وَاسْتَغْفِرُوهُ ۗ وَوَيْلٌ لِّلْمُشْرِكِينَ",
                    "transliteration": {
                        "en": "Qul innamaaa ana basharum mislukum yoohaaa ilaiya annamaaa ilaahukum Ilaahunw Waahidun fastaqeemooo ilaihi wastagfirooh; wa wailul lil mushrikeen"
                    }
                },
                "translation": {
                    "en": "Say, O [Muhammad], \"I am only a man like you to whom it has been revealed that your god is but one God; so take a straight course to Him and seek His forgiveness.\" And woe to those who associate others with Allah -",
                    "id": "Katakanlah (Muhammad), “Aku ini hanyalah seorang manusia seperti kamu, yang diwahyukan kepadaku bahwa Tuhan kamu adalah Tuhan Yang Maha Esa, karena itu tetaplah kamu (beribadah) kepada-Nya dan mohonlah ampunan kepada-Nya. Dan celakalah bagi orang-orang yang mempersekutukan-(Nya),"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4224",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4224.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4224.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Setelah mendengar pernyataan langsung dari kaum musyrik Me-kah tentang penolakan mereka tersebut, Allah memerintah Nabi Muhammad untuk menjawabnya. Katakanlah kepada mereka, wahai Nabi Muhammad, “Aku ini hanyalah seorang manusia seperti kamu juga. Aku adalah nabi dan rasul Allah dengan membawa Al-Qur’an yang diwahyukan kepadaku. Di dalam Al-Qur’an itu terdapat ajaran dasar bahwa Tuhan kamu adalah Allah dan Dia adalah Tuhan Yang Maha Esa; karena itu tetaplah kamu beribadah kepada-Nya, dan mohonlah ampunan kepada-Nya agar kamu tidak terjerumus kepada kesesatan. Dan sadarilah bahwa dengan bercermin kepada umat terdahulu yang telah diazab Allah, maka akan celakalah orang-orang yang mempersekutukan-Nya dengan yang lain.",
                        "long": "Mendengar alasan-alasan yang dikemukakan orang-orang musyrik pada ayat-ayat yang lalu, Allah memerintahkan kepada Rasulullah menjawab ucapan mereka dengan mengatakan bahwa nabi adalah manusia biasa yang tidak ada perbedaan dengan mereka, hanya saja beliau mendapat wahyu bahwa Tuhan yang berhak disembah adalah Tuhan Yang Maha Esa. Oleh karena itu, mereka diperintahkan untuk beribadah hanya kepada-Nya, dilarang menyekutukan-Nya, dan memohon ampun atas dosa-dosa yang telah mereka lakukan.\n\nPada akhir ayat ini Allah menegaskan bahwa kerugian dan kesengsaraan yang besar akan dialami oleh orang-orang yang mempersekutukan Tuhan. Mereka akan kekal di dalam neraka di akhirat nanti."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4225,
                    "inSurah": 7
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 413,
                    "hizbQuarter": 190,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "الَّذِينَ لَا يُؤْتُونَ الزَّكَاةَ وَهُم بِالْآخِرَةِ هُمْ كَافِرُونَ",
                    "transliteration": {
                        "en": "Allazeena laa yu'toonaz Zakaata wa hum bil-Aakhiratihum kaafiroon"
                    }
                },
                "translation": {
                    "en": "Those who do not give zakah, and in the Hereafter they are disbelievers.",
                    "id": "(yaitu) orang-orang yang tidak menunaikan zakat dan mereka ingkar terhadap kehidupan akhirat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4225",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4225.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4225.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Siapakah orang-orang yang mempersekutukan Allah itu? Mereka adalah orang-orang yang tidak menunaikan zakat, dan mereka juga ingkar terhadap kehidupan akhirat dan tidak mempercayai adanya kebangkitan manusia kembali setelah mereka dimatikan.",
                        "long": "Yang dimaksud dengan orang-orang yang mempersekutukan Allah pada ayat di atas ialah orang-orang yang tidak menunaikan zakat dan orang-orang yang mengingkari adanya hari akhir.\n\nZakat diwajibkan pada periode Medinah dan ayat ini termasuk Makkiyyah (ayat-ayat yang diturunkan sebelum hijrah ke Medinah). Oleh karena itu, yang dimaksud dengan zakat ialah mensucikan jiwa dari kesyirikan dan kekikiran.\n\nIbnu 'Abbas menerangkan pengertian la yu'tuna az-zakah (tidak menunaikan zakat) adalah tidak bersaksi bahwa tidak ada tuhan selain Allah. Itulah zakat al-anfus (penyucian jiwa) karena surah ini termasuk surah Makkiyyah dan zakat diwajibkan di Medinah. Sebagian mufasir berpendapat bahwa orang kafir Mekah senang berinfak dan memberi minum dan makan jamaah haji. Namun mereka tidak memberikannya kepada Nabi Muhammad dan orang-orang yang beriman. Maka turunlah ayat ini."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4226,
                    "inSurah": 8
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 413,
                    "hizbQuarter": 190,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ",
                    "transliteration": {
                        "en": "Innal lazeena aamanoo wa 'amilus saalihaati lahum ajrun ghairu mamnoon"
                    }
                },
                "translation": {
                    "en": "Indeed, those who believe and do righteous deeds - for them is a reward uninterrupted.",
                    "id": "Sesungguhnya orang-orang yang beriman dan mengerjakan kebajikan, mereka mendapat pahala yang tidak ada putus-putusnya.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4226",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4226.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4226.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Setelah menggambarkan ancaman bagi orang-orang musyrik Mekah, Al-Qur’an mengalihkan perhatian kepada orang-orang beriman. Sesungguhnya orang-orang yang beriman dengan tulus ikhlas dan yang membuktikan iman mereka dengan mengerjakan kebajikan dan beramal saleh, mereka mendapat anugerah pahala yang sangat besar serta dilimpahi rezeki yang tidak ada putus-putusnya.”",
                        "long": "Pada ayat ini diterangkan janji Allah kepada orang-orang yang beriman. Semua orang yang beriman kepada Allah dan rasul-Nya, mengerjakan perintah-perintah Allah, dan menjauhi larangan-larangan-Nya akan memperoleh balasan yang paling baik dan tidak terputus dari Allah. Itulah pembalasan yang paling baik, yaitu pembalasan yang diberikan kepada orang-orang yang beramal saleh.\n\nMenurut as-Suddi ayat ini diturunkan berhubungan dengan orang sakit yang tidak dapat lagi diharapkan kesembuhannya, orang yang telah sangat tua, sehingga ia tidak dapat lagi beramal seperti ia beramal di waktu masih muda, tetapi mereka masih mempunyai semangat yang tinggi dan ingin beramal seperti yang pernah dilakukannya. Terhadap orang yang seperti itu, Allah memberikan pahala seperti pahala yang diberikan kepada orang yang sanggup mengerjakan amal itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4227,
                    "inSurah": 9
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 414,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ قُلْ أَئِنَّكُمْ لَتَكْفُرُونَ بِالَّذِي خَلَقَ الْأَرْضَ فِي يَوْمَيْنِ وَتَجْعَلُونَ لَهُ أَندَادًا ۚ ذَٰلِكَ رَبُّ الْعَالَمِينَ",
                    "transliteration": {
                        "en": "Qul a'innakum latakfuroona billazee khalaqal arda fee yawmaini wa taj'aloona lahooo andaadaa; zaalika Rabbul 'aalameen"
                    }
                },
                "translation": {
                    "en": "Say, \"Do you indeed disbelieve in He who created the earth in two days and attribute to Him equals? That is the Lord of the worlds.\"",
                    "id": "Katakanlah, “Pantaskah kamu ingkar kepada Tuhan yang menciptakan bumi dalam dua masa dan kamu adakan pula sekutu-sekutu bagi-Nya? Itulah Tuhan seluruh alam.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4227",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4227.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4227.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Penggambaran sikap orang-orang musyrik Mekah yang memper-sekutukan Allah dan menolak keniscayaan hari Kiamat merupakan sikap yang tidak pantas untuk dilakukan terhadap Sang Pencipta alam semesta. Oleh sebab itu, Nabi Muhammad diperintahkan untuk memberikan peringatan keras terhadap orang-orang musyrik Mekah itu dan orang-orang yang bersikap sama dengan mereka. Katakanlah wahai Nabi Muhammad, “Pantaskah kamu ingkar kepada Allah, Tuhan yang menciptakan planet bumi dalam dua masa, dan pada waktu yang sama kamu adakan pula sekutu-sekutu bagi-Nya? Allah Yang Maha Esa itulah Tuhan Pencipta dan Pemelihara seluruh alam.”",
                        "long": "Allah memerintahkan kepada Nabi Muhammad agar menanyakan kepada orang-orang musyrik Mekah kenapa mereka mengingkari Allah yang telah menciptakan bumi dalam dua hari. Kenapa mereka menyembah tuhan-tuhan yang lain di samping menyembah Allah? Padahal Allah Maha Suci dari segala sesuatu.\n\nSebagian ahli tafsir berpendapat bahwa yang dimaksud dengan menjadikan bumi pada ayat ini ialah menciptakan wujudnya, dan yang dimaksud dengan \"hari atau masa\" dalam ayat ini ialah waktu, karena hari dan malam belum ada di saat langit dan bumi diciptakan.\n\nMakna pembentukan bumi dalam waktu dua hari, dapat ditafsirkan secara ilmiah bahwa pembentukan bumi ini terjadi pada dua periode atau dua masa. Hari pertama adalah masa ketika sekitar 4,6 miliar yang lampau, awan debu dan gas yang mengapung di ruang angkasa mulai mengecil (lihat penjelasan dalam al-A.'raf/7: 54 tentang pembentukan langit dan bumi dalam enam masa). Materi pada pusat awan itu mengumpul menjadi matahari dan sisa gas dan debunya memipih berbentuk cakram di sekitar matahari. Kemudian butir-butir debu dalam awan itu saling melekat dan membentuk planetisimal yang kemudian saling bertabrakan membentuk planet, di antaranya adalah bumi. Hari kedua diawali ketika proses pemanasan akibat peluruhan radioaktif menyebabkan proto bumi meleleh, dan bahan-bahan yang berat seperti besi tenggelam ke pusat bumi sedangkan yang ringan seperti air dan karbondioksida beralih ke luar. Planet bumi kemudian mendingin dan sekitar 2,5 miliar tahun yang lampau bumi terlihat seperti apa yang kita lihat sekarang ini.\n\nPertanyaan yang disampaikan kepada orang-orang musyrik pada ayat ini, tidak bermaksud untuk bertanya, tetapi untuk mencela perbuatan mereka menyembah berhala. Seakan-akan dikatakan kepada mereka bahwa bukankah mereka telah mengetahui dengan pasti bahwa berhala-berhala yang mereka sembah itu terbuat dari batu yang tidak dapat berbuat sesuatu pun, bahkan berhala itu mereka sendiri yang membuatnya, mengapa mereka sembah yang demikian itu. Jika mereka mau menghambakan diri, maka hambakanlah kepada yang menciptakan bumi dalam dua masa dan yang menentukan segala sesuatu.\n\nTuhan yang berhak mereka sembah ialah Allah yang menciptakan, menguasai, mengatur, memelihara kelangsungan adanya, dan yang menentukan akhir kesudahan semesta alam ini, bukan berhala yang mereka sembah itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4228,
                    "inSurah": 10
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 414,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَجَعَلَ فِيهَا رَوَاسِيَ مِن فَوْقِهَا وَبَارَكَ فِيهَا وَقَدَّرَ فِيهَا أَقْوَاتَهَا فِي أَرْبَعَةِ أَيَّامٍ سَوَاءً لِّلسَّائِلِينَ",
                    "transliteration": {
                        "en": "Wa ja'ala feehaa rawaa siya min fawqihaa wa baaraka feehaa wa qaddara feehaaaa aqwaatahaa feee arba'ati ayyaamin sawaaa'al lissaaa'ileen"
                    }
                },
                "translation": {
                    "en": "And He placed on the earth firmly set mountains over its surface, and He blessed it and determined therein its [creatures'] sustenance in four days without distinction - for [the information] of those who ask.",
                    "id": "Dan Dia ciptakan padanya gunung-gunung yang kokoh di atasnya. Dan kemudian Dia berkahi, dan Dia tentukan makanan-makanan (bagi penghuni)nya dalam empat masa, memadai untuk (memenuhi kebutuhan) mereka yang memerlukannya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4228",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4228.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4228.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan setelah menciptakan bumi, Dia ciptakan pula padanya gunung-gunung yang kokoh di atasnya yang menjadi pasak bagi bumi. Dan kemudian Dia berkahi bumi itu sehingga layak menjadi tempat kehidupan bagi makhluk tumbuhan, hewan, dan manusia, dan Dia pula yang tentukan makanan-makanan bagi para penghuni-nya. Semua itu tercipta dalam empat masa. Penjelasan ini sangat memadai untuk memenuhi kebutuhan orang-orang yang bertanya tentang penciptaan alam raya, serta mereka yang memerlukannya.",
                        "long": "Pada ayat ini diterangkan keindahan penciptaan dan hukum-hukum yang berlaku pada bumi. Dia telah menjadikan gunung-gunung di permukaan bumi, ada yang tinggi ada yang sedang, ada yang merupakan dataran tinggi saja, ada yang berapi, dan gunung yang merupakan pasak atau paku bumi. Dengan adanya gunung, permukaan bumi menjadi indah, ada yang tinggi dan ada yang rendah. Tumbuh-tumbuhan pegunungan pun berbeda dengan tumbuh-tumbuhan yang ada di dataran rendah demikian pula binatang-binatangnya. Dengan adanya gunung-gunung, maka ada sungai-sungai yang mengalir dari dataran tinggi ke dataran rendah, dan akhirnya bermuara ke laut. Seakan-akan gunung itu merupakan tempat penyimpanan air yang terus-menerus mengalir memenuhi keperluan manusia.\n\nSelanjutnya Allah menerangkan bahwa Dia menciptakan bumi ini sebagai tempat yang penuh keberkahan bagi manusia, dan penuh dengan keindahan. Bumi juga dilengkapi dengan segala macam kebutuhan yang diperlukan manusia untuk kelangsungan hidupnya dan keperluan makhluk-makhluk lain. Sejak dari udara yang dihisap setiap saat, makanan-makanan yang diperlukan, tempat-tempat yang sejuk dan nyaman, lautan yang luas, barang tambang yang terpendam di dalam tanah dan banyak lagi nikmat yang lain yang disediakan-Nya yang tidak terhitung macam dan jumlahnya.\n\nDia pula yang telah menentukan ukuran dan kadar segala sesuatu. Mengadakan makanan yang dapat mengenyangkan sesuai dengan keadaan binatang atau manusia yang memerlukannya. Untuk manusia disediakan padi, gandum, dan sebagainya. Untuk binatang ternak disediakan-Nya rumput dan sebagainya. Betapa banyak jumlah manusia, betapa banyak ikan di laut, burung yang beterbangan, binatang-binatang yang hidup di dalam rimba, semuanya disediakan Allah rezeki dan keperluan hidupnya, sesuai dengan keadaan masing-masing.\n\nAllah menerangkan bahwa Dia menciptakan bumi dan gunung-gunung yang ada padanya dalam dua masa dan menciptakan keperluan-keperluan, makanan, dan sebagainya dalam dua masa pula. Semuanya dilakukan dalam empat masa. Dalam waktu empat masa itu, terciptalah semuanya dan dasar-dasar dari segala sesuatu yang ada di alam ini, sesuai dengan masa dan keadaan dalam perkembangan selanjutnya.\n\nTafsiran ilmiah empat hari, bisa jadi tercermin empat masa dalam kurun waktu geologi yakni: Proterozoikum, dimana kehidupan masih sangat tidak jelas; Paleozoikum di mana kehidupan mulai jelas yang ditandai antara lain oleh amfibi, reptil, ikan-ikan besar, dan tumbuhan paku; Mesozoikum, kehidupan pertengahan yang ditandai dengan berlimpahnya vegetasi dan binatang laut, antara lain hewan laut, komodo, pohon daun lebar; dan Kenozoikum, kehidupan baru, dimana ditandai oleh banyaknya kehidupan di zaman Kenozoikum yang punah. Pada masa Kenozoikum ditandai oleh munculnya gajah, dan pepohonan semakin berkembang dan paling penting adalah kemunculan manusia."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4229,
                    "inSurah": 11
                },
                "meta": {
                    "juz": 24,
                    "page": 477,
                    "manzil": 6,
                    "ruku": 414,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "ثُمَّ اسْتَوَىٰ إِلَى السَّمَاءِ وَهِيَ دُخَانٌ فَقَالَ لَهَا وَلِلْأَرْضِ ائْتِيَا طَوْعًا أَوْ كَرْهًا قَالَتَا أَتَيْنَا طَائِعِينَ",
                    "transliteration": {
                        "en": "Summas tawaaa ilas-samaaa'i wa hiya dukhaanun faqaala lahaa wa lil ardi'tiyaaa taw'an aw karhan qaalataaa atainaa taaa'i'een"
                    }
                },
                "translation": {
                    "en": "Then He directed Himself to the heaven while it was smoke and said to it and to the earth, \"Come [into being], willingly or by compulsion.\" They said, \"We have come willingly.\"",
                    "id": "Kemudian Dia menuju ke langit dan (langit) itu masih berupa asap, lalu Dia berfirman kepadanya dan kepada bumi, “Datanglah kamu berdua menurut perintah-Ku dengan patuh atau terpaksa.” Keduanya menjawab, “Kami datang dengan patuh.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4229",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4229.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4229.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dari menguraikan ihwal penciptaan bumi dan sarana kehidupan bagi makhluk yang mendiaminya, Al-Qur’an kemudian beralih kepada ihwal penciptaan langit. Kemudian Dia, yakni perintah atau kekuasaan-Nya menuju ke langit dan langit ketika itu masih berupa asap, lalu Dia berfirman kepadanya dan kepada bumi, “Datanglah kamu berdua menuruti perintah-Ku dengan patuh atau terpaksa.” Mendengar perintah itu, keduanya, langit dan bumi, lalu menjawab, “Kami datang kepada-MU ya Allah dengan tunduk dan patuh guna mengikuti aturan-Mu.”",
                        "long": "Pada ayat ini Allah menerangkan keadaan langit. Setelah Allah menciptakan bumi Dia menuju ke langit, waktu itu langit berupa asap. Bagaimana keadaan asap itu dan apa hakikatnya, hanya Allah sajalah yang mengetahui-Nya. Sekalipun ada yang mencoba menerangkan keadaan asap yang dimaksud, baik yang dikemukakan oleh pendeta-pendeta Yahudi, maupun oleh para ahli yang telah mencoba menyelidikinya, namun belum ada keterangan yang pasti yang menerangkan keadaan dan hakikat asap itu.\n\nMenurut teori ilmu pengetahuan, ayat di atas menggambarkan mengenai permulaan alam semesta. Peristiwa tersebut ditandai dengan terjadinya peristiwa yang oleh para ilmuwan disebut Big Bang. Peristiwa tersebut sangat jelas terlihat pada surah al-Anbiya'/21 ayat 30 yang penggalannya berbunyi demikian: \"....bahwa langit dan bumi keduanya dahulu adalah satu yang padu, kemudian Kami pisahkan...\" .\n\nIlmu kosmologi modern, baik dari pengamatan maupun teori, secara jelas mengindikasikan bahwa pada suatu saat, seluruh alam semesta terdiri hanya dari awan dari \"asap\" yang terdiri atas komposisi gas yang padat dan sangat panas. Kumpulan ini terdiri atas sejumlah besar kekuatan atom yang saling berkaitan dan berada di bawah tekanan yang sangat kuat. Jari-jari kumpulan yang berbentuk bola ini diperkirakan sekitar 5 juta kilometer. Cairan atom pertamanya berupa ledakan dahsyat (yang biasa disebut Big Bang), dan mengakibatkan terbentuk dan terpencarnya berbagai benda langit. Hal ini sudah menjadi prinsip yang teruji dan menjadi dasar dalam kosmologi modern. Dengan semakin majunya ilmu pengetahuan, para peneliti saat ini dapat menyaksikan \"kelahiran\" bintang dengan menggunakan teleskop yang sangat canggih. Teori mengenai bentukan \"asap\" sebagai asal-muasal suatu bintang, juga telah disebutkan dalam Surah Fushshilat/41: 11 di atas.\n\nKarena bumi dan langit di atasnya (matahari, bulan, bintang, planet, galaksi, dan sebagainya) terbentuk dari \"asap\" yang sama, maka para pakar menyimpulkan bahwa bumi dan isi langit seluruhnya adalah satu kesatuan sebelumnya. Dari material \"asap\" yang sama ini, kemudian mereka terpisah satu sama lain. Hal yang demikian ini juga telah diungkapkan oleh Al-Qur'an dalam Surah al-Anbiya'/21: 30 tersebut di atas. \n\nPada ayat ini, seolah-olah Allah menerangkan bahwa bumi lebih dahulu diciptakan dari langit dengan segala isinya, termasuk di dalamnya matahari, bulan, dan bintang-bintang. Ayat yang lain menerangkan bahwa Allah menciptakan langit lebih dahulu dari menciptakan bumi. Oleh karena itu, ada sebagian mufasir yang mencoba mengompromikan kedua ayat ini. Menurut mereka, dalam perencanaan, Allah lebih dahulu merencanakan bumi dengan segala isinya. Akan tetapi, dalam pelaksanaannya, Allah menciptakan langit dengan segala isinya lebih dahulu, kemudian sesudah itu baru menciptakan bumi dengan segala isinya.\n\nSetelah selesai menciptakan langit dan bumi beserta segala isinya, Allah memerintahkan keduanya untuk datang kepada-Nya, baik dalam keadaan senang maupun terpaksa. Langit dan bumi mengatakan bahwa mereka akan datang dengan tunduk dan patuh. Kemudian Allah bertitah kepada langit, \"Perhatikanlah sinar mataharimu, cahaya bulanmu, cahaya gemerlap dari binatang-bintang, hembuskanlah anginmu, edarkanlah awanmu, sehingga dapat menurunkan hujan.\" Allah berfirman pula kepada bumi, \"Alirkanlah sungai-sungaimu, serta tumbuhkanlah tanaman-tanaman dan pohon-pohonmu.\" Keduanya menjawab, \"Kami penuhi segala perintah-Mu dengan patuh dan taat.\"\n\nSebagian ahli tafsir menafsirkan \"datanglah kamu keduanya menurut perintah-Ku dengan suka atau terpaksa\" dengan \"jadilah kamu keduanya menurut Sunnah-Ku yang telah Aku tetapkan, jangan menyimpang sedikit pun dari ketentuan-Ku itu, ikutilah proses-proses kejadianmu sesuai dengan waktu yang telah ditentukan.\" Dengan kata lain dapat dipahami bahwa Allah memerintahkan kepada langit dan bumi untuk menyempurnakan kejadiannya sesuai dengan ketetapan yang telah ditentukan, seperti bumi akan tercipta pada saatnya, demikian pula gunung-gunung, air, udara, binatang-binatang, manusia, dan tumbuh-tumbuhan. Semuanya akan terjadi pada waktu yang ditentukan-Nya, tidak ada satu pun yang menyimpang dari ketentuan-Nya.\n\nDari ayat ini dapat dipahami bahwa kejadian langit dan bumi itu, mulai dari terjadinya sampai kepada bentuk yang ada sekarang, melalui proses-proses tertentu sesuai dengan sunah Allah. Segala sesuatu yang ada di bumi dan di langit akan ada pada waktunya, dan akan hilang atau musnah pada waktunya pula, sesuai dengan keadaan langit dan bumi pada waktu itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4230,
                    "inSurah": 12
                },
                "meta": {
                    "juz": 24,
                    "page": 478,
                    "manzil": 6,
                    "ruku": 414,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَقَضَاهُنَّ سَبْعَ سَمَاوَاتٍ فِي يَوْمَيْنِ وَأَوْحَىٰ فِي كُلِّ سَمَاءٍ أَمْرَهَا ۚ وَزَيَّنَّا السَّمَاءَ الدُّنْيَا بِمَصَابِيحَ وَحِفْظًا ۚ ذَٰلِكَ تَقْدِيرُ الْعَزِيزِ الْعَلِيمِ",
                    "transliteration": {
                        "en": "Faqadaahunna sab'a samaawaatin fee yawmaini wa awhaa fee kulli samaaa'in amarahaa; wa zaiyannassa maaa'ad dunyaa bimasaabeeha wa hifzaa; zaalika taqdeerul 'Azeezil 'Aleem"
                    }
                },
                "translation": {
                    "en": "And He completed them as seven heavens within two days and inspired in each heaven its command. And We adorned the nearest heaven with lamps and as protection. That is the determination of the Exalted in Might, the Knowing.",
                    "id": "Lalu diciptakan-Nya tujuh langit dalam dua masa dan pada setiap langit Dia mewahyukan urusan masing-masing. Kemudian langit yang dekat (dengan bumi), Kami hiasi dengan bintang-bintang, dan (Kami ciptakan itu) untuk memelihara. Demikianlah ketentuan (Allah) Yang Mahaperkasa, Maha Mengetahui."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4230",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4230.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4230.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat ini masih menjelaskan tentang penciptaan langit. Lalu diciptakan-Nya tujuh langit dalam waktu dua masa, dan pada setiap langit Dia mewahyukan dan menetapkan urusan masing-masing. Kemudian langit yang dekat dengan bumi, Kami hiasi dengan bintang-bintang yang bersinar cemerlang, dan Kami ciptakan bintang-bintang itu untuk memelihara langit dengan pemeliharaan yang sempurna. Demikianlah ketentuan Allah berlaku, dan Dia adalah Zat Yang Mahaperkasa lagi Maha Mengetahui.",
                        "long": "Ayat ini menerangkan bahwa Allah menyempurnakan kejadian langit itu dengan menjadikan tujuh langit dalam dua masa. Dengan demikian, lamanya Allah merencanakan penciptaan langit dan bumi ialah selama enam masa. Firman Allah:\n\nSungguh, Tuhanmu (adalah) Allah yang menciptakan langit dan bumi dalam enam masa. (al-A'raf/7: 54)\n\nDiterangkan juga bahwa Allah menghiasi langit dengan bintang-bintang yang gemerlapan. Ada bintang yang bercahaya sendiri dan ada pula yang menerima pantulan cahaya dari bintang yang lain. Oleh karena itu, cahaya bintang-bintang itu terlihat tidak sama. Ketidaksamaan cahaya bintang-bintang itu menimbulkan keindahan yang tiada taranya.\n\nAllah menjadikan pada tiap-tiap langit sesuatu yang diperlukan, sesuai dengan hikmah dan sunah-Nya. Seperti adanya memberi tarik pada tiap-tiap planet dan menjadikannya berjalan pada garis edarnya, sehingga planet-planet itu tidak akan jatuh dan berbenturan antara yang satu dengan yang lain. Untuk setiap planet itu ditetapkan tugas-tugas tertentu, sesuai dengan keadaan dan sifatnya, seperti tugas bulan tidak sama dengan tugas matahari, karena kejadian keduanya berlainan.\n\nSemua yang diterangkan itu merupakan ciptaan Allah, Tuhan Yang Mahakuasa, dan mereka harus tunduk kepada ketetapan-Nya. Tidak ada satu pun dari ciptaan Allah yang menyimpang dari ketetapan-Nya. Dia mengetahui keadaan makhluk yang diciptakan-Nya itu, baik yang halus maupun yang kasar, baik yang nyata maupun yang tersembunyi."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4231,
                    "inSurah": 13
                },
                "meta": {
                    "juz": 24,
                    "page": 478,
                    "manzil": 6,
                    "ruku": 414,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَإِنْ أَعْرَضُوا فَقُلْ أَنذَرْتُكُمْ صَاعِقَةً مِّثْلَ صَاعِقَةِ عَادٍ وَثَمُودَ",
                    "transliteration": {
                        "en": "Fa-in a'radoo faqul anzartukum saa'iqatam misla saa'iqati 'Aadinw wa Samood"
                    }
                },
                "translation": {
                    "en": "But if they turn away, then say, \"I have warned you of a thunderbolt like the thunderbolt [that struck] 'Aad and Thamud.",
                    "id": "Jika mereka berpaling maka katakanlah, “Aku telah memperingatkan kamu akan (bencana) petir seperti petir yang menimpa kaum ’Ad dan kaum Samud.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4231",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4231.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4231.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ihwal penciptaan langit dan bumi sebagai bukti kemahakuasaan Allah, yang dijelaskan oleh ayat-ayat terdahulu, ternyata tidaklah membuat orang-orang musyrik Mekah berubah sikap dan keyakinan. Oleh sebab itu, ayat-ayat berikut memerintahkan Nabi Muhammad menyampaikan peringatan berupa pengalaman kaum ‘Ad dan Šamùd yang telah menolak kebenaran. Jika mereka, orang-orang musyrik Mekah, masih saja berpaling dari kebenaran yang disampaikan itu, maka katakanlah kepada mereka, “Aku telah memperingatkan kamu akan bencana petir seperti petir yang menimpa kaum ‘Ad dan kaum Šamùd.”",
                        "long": "Ayat ini menerangkan perintah Allah kepada Nabi Muhammad agar menyeru kepada orang-orang kafir untuk beriman kepada Allah yang telah menciptakan langit dan bumi dan apa yang ada pada keduanya. Jika mereka tidak menerima ajakan itu dan berpaling, Rasulullah diperintahkan untuk mengingatkan mereka tentang azab yang akan ditimpakan Allah kepada setiap orang yang ingkar kepada-Nya. Di antara azab yang pernah ditimpakan kepada orang-orang yang ingkar ialah suara keras yang mengguntur dari langit dan memusnahkan semua yang dikenainya, seperti yang pernah ditimpakan kepada kaum 'Ad, kaum Samud, penduduk Aikah, dan sebagainya. Malapetaka itu menimpa mereka karena mengingkari seruan rasul yang diutus kepada mereka dan mengabaikan peringatan para rasul itu. Rasulullah menambahkan bahwa jika mereka tidak ingin ditimpa malapetaka seperti itu, maka ikutilah seruan yang disampaikannya dan agar hanya menyembah Allah, Tuhan Yang Maha Esa, tidak mempersekutukan-Nya dengan sesuatu apa pun.\n\nSeruan Rasulullah itu ditanggapi orang-orang musyrik dengan sikap angkuh dan sombong. Mereka mengingkarinya dengan mengatakan bahwa sekiranya Allah hendak mengutus para rasul kepada manusia, tentu Dia tidak akan mengutus manusia seperti Nabi Muhammad. Akan tetapi, Allah akan mengutus orang-orang yang mempunyai kelebihan dari manusia biasa, mempunyai kekuatan gaib, sanggup mengabulkan langsung segala yang diminta orang-orang yang diserunya, seperti malaikat, jin dan sebagainya. Menurut mereka, rasul yang diangkat dari manusia biasa tidak akan bisa memerkenankan permintaan orang-orang yang diserunya karena tidak mempunyai kelebihan apa pun. Sementara, menurut mereka, Allah belum berkehendak mengutus rasul itu. Itulah sebabnya mereka mengingkari kerasulan Nabi Muhammad.\n\nDiriwayatkan oleh al-Baihaqi dalam kitab \" Ad-Dalail\" dan Ibnu Asakir dari Jabir bin 'Abdullah. Ia mengatakan bahwa Abu Jahal dan para pemimpin kaum Quraisy berkata, \"Sesungguhnya kurang jelas bagi kita apa yang disampaikan oleh Muhammad itu, jika kamu menemukan seorang ahli sihir, tenung, dan syair, maka hendaklah ia berbicara dengannya, dan datang kepada kita untuk menerangkan maksud yang disampaikan Muhammad saw itu.\" 'Utbah bin Rabi'ah berkata, \"Demi Allah, aku benar-benar telah mendengar sihir, tenung, dan syair. Aku benar-benar memahami rumpun engkau hai Muhammad adalah orang yang paling baik dalam rumpun keluarga Abdul Muththalib?\" Muhammad tidak menjawab. 'Utbah berkata lagi, \"Mengapa engkau mencela tuhan-tuhan kami dan menganggap kami sesat? Jika engkau menghendaki wanita, pilihlah olehmu sepuluh wanita yang paling cantik yang kamu kehendaki dari suku Quraisy ini. Jika engkau menghendaki harta, kami kumpulkan harta itu sesuai dengan yang kamu perlukan.\" \n\nSetelah Rasulullah mendengar ucapan 'Utbah, beliau membaca Surah Fushshilat ini sejak permulaan ayat sampai kepada ayat ini, yang menerangkan malapetaka yang pernah ditimpakan kepada kaum 'Ad, dan Samud. Mendengar ayat yang dibacakan Rasulullah saw, Utbah diam seribu bahasa, lalu pulang ke rumahnya, tidak langsung kepada kaumnya. Tatkala kaumnya melihat 'Utbah dalam keadaan demikian, mereka mengatakan bahwa 'Utbah telah kena sihir Muhammad. Lalu mereka mencari 'Utbah dan berkata kepadanya, \"Ya 'Utbah, engkau tidak datang kepada kami itu adalah karena engkau telah kena sihir.\" Maka 'Utbah marah dan bersumpah tidak akan berbicara lagi dengan Muhammad, kemudian ia berkata, \"Demi Allah, aku benar-benar telah berbicara dengannya, lalu ia menjawab dengan satu jawaban yang menurut pendapatku jawaban itu bukan syair, bukan sihir, dan bukan pula tenung. Tatkala ia sampai kepada ucapan: petir yang seperti menimpa kaum 'Ad dan Samud, aku pun diam seribu bahasa. Aku benar-benar mengetahui bahwa Muhammad itu, apabila ia mengatakan sesuatu, ia tidak berdusta, dan ia takut kepada azab yang akan menimpa itu.\"\n\nSebagaimana diketahui bahwa 'Utbah termasuk pemuka Quraisy dan orang yang berpengetahuan luas di antara mereka. Di samping seorang sastrawan ia juga mengetahui seluk-beluk sihir dan tenung yang dipercayai orang pada waktu itu. Kebungkaman 'Utbah itu menunjukkan bahwa hatinya telah beriman kepada Rasulullah, tetapi karena pengaruh nafsu dan kedudukan, maka ia mengingkari suara hatinya. Demikian pula halnya dengan kebanyakan orang-orang musyrik. Hatinya telah beriman dan ia telah takut kepada azab yang akan ditimpakan kepadanya seandainya ia tidak beriman, tetapi mereka tetap tidak beriman karena khawatir akan dikucilkan oleh kaumnya. Oleh karena itu, mereka mencari-cari alasan untuk menutupi hati mereka dengan mengatakan bahwa mustahil Allah mengangkat seorang rasul dari golongan manusia biasa. Jika Allah mengangkat rasul, tentu rasul itu dari golongan malaikat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4232,
                    "inSurah": 14
                },
                "meta": {
                    "juz": 24,
                    "page": 478,
                    "manzil": 6,
                    "ruku": 414,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِذْ جَاءَتْهُمُ الرُّسُلُ مِن بَيْنِ أَيْدِيهِمْ وَمِنْ خَلْفِهِمْ أَلَّا تَعْبُدُوا إِلَّا اللَّهَ ۖ قَالُوا لَوْ شَاءَ رَبُّنَا لَأَنزَلَ مَلَائِكَةً فَإِنَّا بِمَا أُرْسِلْتُم بِهِ كَافِرُونَ",
                    "transliteration": {
                        "en": "Iz jaaa'at humur Rusulu mim baini aydeehim wa min khalfihim allaa ta'budooo illal laaha qaaloo law shaaa'a Rabunaa la anzala malaaa 'ikatan fa innaa bimaaa ursiltum bihee kaafiroon"
                    }
                },
                "translation": {
                    "en": "[That occurred] when the messengers had come to them before them and after them, [saying], \"Worship not except Allah.\" They said, \"If our Lord had willed, He would have sent down the angels, so indeed we, in that with which you have been sent, are disbelievers.\"",
                    "id": "Ketika para rasul datang kepada mereka dari depan dan dari belakang mereka (dengan menyerukan), “Janganlah kamu menyembah selain Allah.” Mereka menjawab, “Kalau Tuhan kami menghendaki tentu Dia menurunkan malaikat-malaikat-Nya, maka sesungguhnya kami mengingkari wahyu yang engkau diutus menyampaikannya.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4232",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4232.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4232.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Demikianlah, sebagaimana juga dikisahkan oleh Al-Qur’an, ketika para rasul datang kepada masing-masing mereka, kaum ‘Ad dan Šamùd, baik dari arah depan dan juga dari arah belakang mereka. Hal ini bermakna bahwa para rasul itu menyampaikan seruan kebenaran dengan berbagai cara, baik terang-terangan maupun dengan sembunyi-sembunyi. Para rasul itu menyerukan, “Janganlah kamu menyembah selain Allah.” Mendengar seruan itu mereka, kaum ‘Ad dan Šamùd menjawab, “Kalau Tuhan kami menghendaki untuk mengutus rasul, tentu Dia mengutus dan menurunkan malaikat-malaikat-Nya kepada kami, bukan manusia biasa seperti kamu. Maka sesungguhnya dengan kenyataan seperti itu, kami mengingkari wahyu yang engkau sengaja diutus untuk menyampaikannya kepada kami.”",
                        "long": "Ayat ini menerangkan perintah Allah kepada Nabi Muhammad agar menyeru kepada orang-orang kafir untuk beriman kepada Allah yang telah menciptakan langit dan bumi dan apa yang ada pada keduanya. Jika mereka tidak menerima ajakan itu dan berpaling, Rasulullah diperintahkan untuk mengingatkan mereka tentang azab yang akan ditimpakan Allah kepada setiap orang yang ingkar kepada-Nya. Di antara azab yang pernah ditimpakan kepada orang-orang yang ingkar ialah suara keras yang mengguntur dari langit dan memusnahkan semua yang dikenainya, seperti yang pernah ditimpakan kepada kaum 'Ad, kaum Samud, penduduk Aikah, dan sebagainya. Malapetaka itu menimpa mereka karena mengingkari seruan rasul yang diutus kepada mereka dan mengabaikan peringatan para rasul itu. Rasulullah menambahkan bahwa jika mereka tidak ingin ditimpa malapetaka seperti itu, maka ikutilah seruan yang disampaikannya dan agar hanya menyembah Allah, Tuhan Yang Maha Esa, tidak mempersekutukan-Nya dengan sesuatu apa pun.\n\nSeruan Rasulullah itu ditanggapi orang-orang musyrik dengan sikap angkuh dan sombong. Mereka mengingkarinya dengan mengatakan bahwa sekiranya Allah hendak mengutus para rasul kepada manusia, tentu Dia tidak akan mengutus manusia seperti Nabi Muhammad. Akan tetapi, Allah akan mengutus orang-orang yang mempunyai kelebihan dari manusia biasa, mempunyai kekuatan gaib, sanggup mengabulkan langsung segala yang diminta orang-orang yang diserunya, seperti malaikat, jin dan sebagainya. Menurut mereka, rasul yang diangkat dari manusia biasa tidak akan bisa memerkenankan permintaan orang-orang yang diserunya karena tidak mempunyai kelebihan apa pun. Sementara, menurut mereka, Allah belum berkehendak mengutus rasul itu. Itulah sebabnya mereka mengingkari kerasulan Nabi Muhammad.\n\nDiriwayatkan oleh al-Baihaqi dalam kitab \" Ad-Dalail\" dan Ibnu Asakir dari Jabir bin 'Abdullah. Ia mengatakan bahwa Abu Jahal dan para pemimpin kaum Quraisy berkata, \"Sesungguhnya kurang jelas bagi kita apa yang disampaikan oleh Muhammad itu, jika kamu menemukan seorang ahli sihir, tenung, dan syair, maka hendaklah ia berbicara dengannya, dan datang kepada kita untuk menerangkan maksud yang disampaikan Muhammad saw itu.\" 'Utbah bin Rabi'ah berkata, \"Demi Allah, aku benar-benar telah mendengar sihir, tenung, dan syair. Aku benar-benar memahami rumpun engkau hai Muhammad adalah orang yang paling baik dalam rumpun keluarga Abdul Muththalib?\" Muhammad tidak menjawab. 'Utbah berkata lagi, \"Mengapa engkau mencela tuhan-tuhan kami dan menganggap kami sesat? Jika engkau menghendaki wanita, pilihlah olehmu sepuluh wanita yang paling cantik yang kamu kehendaki dari suku Quraisy ini. Jika engkau menghendaki harta, kami kumpulkan harta itu sesuai dengan yang kamu perlukan.\" \n\nSetelah Rasulullah mendengar ucapan 'Utbah, beliau membaca Surah Fushshilat ini sejak permulaan ayat sampai kepada ayat ini, yang menerangkan malapetaka yang pernah ditimpakan kepada kaum 'Ad, dan Samud. Mendengar ayat yang dibacakan Rasulullah saw, Utbah diam seribu bahasa, lalu pulang ke rumahnya, tidak langsung kepada kaumnya. Tatkala kaumnya melihat 'Utbah dalam keadaan demikian, mereka mengatakan bahwa 'Utbah telah kena sihir Muhammad. Lalu mereka mencari 'Utbah dan berkata kepadanya, \"Ya 'Utbah, engkau tidak datang kepada kami itu adalah karena engkau telah kena sihir.\" Maka 'Utbah marah dan bersumpah tidak akan berbicara lagi dengan Muhammad, kemudian ia berkata, \"Demi Allah, aku benar-benar telah berbicara dengannya, lalu ia menjawab dengan satu jawaban yang menurut pendapatku jawaban itu bukan syair, bukan sihir, dan bukan pula tenung. Tatkala ia sampai kepada ucapan: petir yang seperti menimpa kaum 'Ad dan Samud, aku pun diam seribu bahasa. Aku benar-benar mengetahui bahwa Muhammad itu, apabila ia mengatakan sesuatu, ia tidak berdusta, dan ia takut kepada azab yang akan menimpa itu.\"\n\nSebagaimana diketahui bahwa 'Utbah termasuk pemuka Quraisy dan orang yang berpengetahuan luas di antara mereka. Di samping seorang sastrawan ia juga mengetahui seluk-beluk sihir dan tenung yang dipercayai orang pada waktu itu. Kebungkaman 'Utbah itu menunjukkan bahwa hatinya telah beriman kepada Rasulullah, tetapi karena pengaruh nafsu dan kedudukan, maka ia mengingkari suara hatinya. Demikian pula halnya dengan kebanyakan orang-orang musyrik. Hatinya telah beriman dan ia telah takut kepada azab yang akan ditimpakan kepadanya seandainya ia tidak beriman, tetapi mereka tetap tidak beriman karena khawatir akan dikucilkan oleh kaumnya. Oleh karena itu, mereka mencari-cari alasan untuk menutupi hati mereka dengan mengatakan bahwa mustahil Allah mengangkat seorang rasul dari golongan manusia biasa. Jika Allah mengangkat rasul, tentu rasul itu dari golongan malaikat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4233,
                    "inSurah": 15
                },
                "meta": {
                    "juz": 24,
                    "page": 478,
                    "manzil": 6,
                    "ruku": 414,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَأَمَّا عَادٌ فَاسْتَكْبَرُوا فِي الْأَرْضِ بِغَيْرِ الْحَقِّ وَقَالُوا مَنْ أَشَدُّ مِنَّا قُوَّةً ۖ أَوَلَمْ يَرَوْا أَنَّ اللَّهَ الَّذِي خَلَقَهُمْ هُوَ أَشَدُّ مِنْهُمْ قُوَّةً ۖ وَكَانُوا بِآيَاتِنَا يَجْحَدُونَ",
                    "transliteration": {
                        "en": "Fa ammaa 'Aadun fastak baroo fil ardi bighairul haqqi wa qaaloo man ashaddu minnaa quwwatan awalam yaraw annal laahal lazee khalaqahum Huwa ashaddu minhum quwwatanw wa kaanoo bi Aayaatinaa yajhadoon"
                    }
                },
                "translation": {
                    "en": "As for 'Aad, they were arrogant upon the earth without right and said, \"Who is greater than us in strength?\" Did they not consider that Allah who created them was greater than them in strength? But they were rejecting Our signs.",
                    "id": "Maka adapun kaum ‘Ad, mereka menyombongkan diri di bumi tanpa (mengindahkan) kebenaran dan mereka berkata, “Siapakah yang lebih hebat kekuatannya dari kami?” Tidakkah mereka memperhatikan bahwa sesungguhnya Allah yang menciptakan mereka. Dia lebih hebat kekuatan-Nya dari mereka? Dan mereka telah mengingkari tanda-tanda (kebesaran) Kami."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4233",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4233.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4233.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat berikut memerinci apa yang dialami oleh kaum ‘Ad dan apa pula yang dialami oleh kaum Šamùd. Maka adapun kaum ‘Ad, mereka sangat menyombongkan diri di bumi tanpa mengindahkan kebenaran yang diserukan oleh Nabi Hud, rasul yang dibangkitkan di kalangan mereka, dan bahkan dengan congkak mereka berkata, “Siapakah, yakni tidak ada siapa pun, yang lebih hebat kekuatannya dari kami?” Sungguh sangat congkak dan sombong sikap kaum ‘Ad itu. Tidakkah mereka memperhatikan dan menyadari bahwa sesungguhnya Allah yang menciptakan mereka adalah Zat Yang Mahakuasa lagi Mahaperkasa? Dia adalah Zat yang lebih hebat kekuatan-Nya dari kekuatan yang mereka punya. Dan dalam sikap kesombongan dan kecongkakan seperti itu, mereka juga telah mengingkari tanda-tanda kebesaran Kami.",
                        "long": "Pada ayat ini, Allah menerangkan keadaan kaum 'Ad yang telah ditimpa azab Allah dan sikapnya terhadap seruan rasul yang diutus kepadanya. Diterangkan bahwa kaum 'Ad itu menyombongkan diri, merasa diri mereka tidak ada yang menandingi, dan semua tunduk kepadanya. Oleh karena itu, mereka durhaka kepada Tuhan yang telah menciptakan dan memberikan karunia kepada mereka, dan tidak menerima seruan rasul Allah yang diutus kepada mereka. Mereka menantang siapa yang sanggup menandingi mereka.\n\nAllah mengancam dan memperingatkan mereka dengan mengatakan apakah mereka telah memikirkan betul-betul yang mereka ucapkan, dan apakah mereka tidak mengetahui siapa yang mereka tentang itu? Yang mereka tentang itu adalah Allah Yang Mahakuasa, yang menciptakan segala sesuatu termasuk diri mereka sendiri, Yang Mahaperkasa, yang lebih kuat dari mereka. Jika Allah menghendaki, maka Dia dapat menimpakan bencana apa pun terhadap mereka dan sedikit pun mereka tidak akan dapat menghindarkan diri dari bencana itu.\n\nMereka sebenarnya telah mengetahui dan meyakini bukti-bukti kebesaran dan kekuasaan Kami, yang disampaikan oleh para rasul yang diutus kepada mereka. Akan tetapi, mereka mengingkarinya dan mendurhakai para rasul itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4234,
                    "inSurah": 16
                },
                "meta": {
                    "juz": 24,
                    "page": 478,
                    "manzil": 6,
                    "ruku": 414,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَأَرْسَلْنَا عَلَيْهِمْ رِيحًا صَرْصَرًا فِي أَيَّامٍ نَّحِسَاتٍ لِّنُذِيقَهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةِ الدُّنْيَا ۖ وَلَعَذَابُ الْآخِرَةِ أَخْزَىٰ ۖ وَهُمْ لَا يُنصَرُونَ",
                    "transliteration": {
                        "en": "Fa arsalnaa 'alaihim reehan sarsaran feee ayyaamin nahisaatil linuzeeqahum 'azaabal khizyi fil hayaatid dunyaa wa la'azaabul Aakhirati akhzaa wa hum laa yunsaroon"
                    }
                },
                "translation": {
                    "en": "So We sent upon them a screaming wind during days of misfortune to make them taste the punishment of disgrace in the worldly life; but the punishment of the Hereafter is more disgracing, and they will not be helped.",
                    "id": "Maka Kami tiupkan angin yang sangat bergemuruh kepada mereka dalam beberapa hari yang nahas, karena Kami ingin agar mereka itu merasakan siksaan yang menghinakan dalam kehidupan di dunia. Sedangkan azab akhirat pasti lebih menghinakan dan mereka tidak diberi pertolongan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4234",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4234.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4234.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sebagai ganjaran bagi kecongkakan dan kesombongan mereka itu, maka Kami tiupkan kepada mereka angin yang sangat bergemuruh dan di-ngin hingga terasa menusuk tulang yang berlangsung dalam beberapa hari, yakni selama tujuh malam dan delapan hari yang mereka anggap sebagai hari yang nahas. Itu semua Kami timpakan kepada para pendurhaka itu karena Kami ingin agar mereka itu merasakan siksaan yang menghinakan dalam kehidupan di dunia. Sedangkan azab akhirat pasti lebih menghinakan dibandingkan siksaan di dunia, dan mereka tidak diberi pertolongan sedikit pun.",
                        "long": "Pada ayat ini Allah menerangkan bentuk azab yang ditimpakan kepada kaum 'Ad. Dia menghembuskan angin kencang yang sangat dingin diiringi dengan suara gemuruh yang memusnahkan mereka. Angin kencang yang sangat dingin itu terus-menerus melanda mereka dalam tujuh malam dan delapan hari, yang merupakan hari yang sial bagi mereka, sebagaimana diterangkan dalam firman Allah:\n\nSedangkan kaum 'Ad, mereka telah dibinasakan dengan angin topan yang sangat dingin, Allah menimpakan angin itu kepada mereka selama tujuh malam delapan hari terus-menerus; maka kamu melihat kaum 'Ad pada waktu itu mati bergelimpangan seperti batang-batang pohon kurma yang telah kosong (lapuk). (al-haqqah/69: 6-7)\n\nDiterangkan pada ayat ini bahwa tujuan Allah menimpakan azab yang dahsyat itu kepada kaum 'Ad agar mereka merasakan akibat dari menyombongkan diri dan takabur terhadap Allah dan para rasul yang diutus kepada mereka, yaitu kehinaan, kerendahan, dan malapetaka yang menimpa mereka dalam kehidupan duniawi. Sedang azab akhirat lebih dahsyat dan sangat menghinakan mereka. Mereka tidak akan memperoleh seorang penolong pun yang dapat membebaskan dari azab itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4235,
                    "inSurah": 17
                },
                "meta": {
                    "juz": 24,
                    "page": 478,
                    "manzil": 6,
                    "ruku": 414,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَأَمَّا ثَمُودُ فَهَدَيْنَاهُمْ فَاسْتَحَبُّوا الْعَمَىٰ عَلَى الْهُدَىٰ فَأَخَذَتْهُمْ صَاعِقَةُ الْعَذَابِ الْهُونِ بِمَا كَانُوا يَكْسِبُونَ",
                    "transliteration": {
                        "en": "Wa ammaa Samoodu fahadinaahum fastahabbul 'ama 'alal huda fa akhazathum saa'iqatul 'azaabil hooni bimaa kaanoo yaksiboon"
                    }
                },
                "translation": {
                    "en": "And as for Thamud, We guided them, but they preferred blindness over guidance, so the thunderbolt of humiliating punishment seized them for what they used to earn.",
                    "id": "Dan adapun kaum Samud, mereka telah Kami beri petunjuk tetapi mereka lebih menyukai kebutaan (kesesatan) daripada petunjuk itu, maka mereka disambar petir sebagai azab yang menghinakan disebabkan apa yang telah mereka kerjakan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4235",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4235.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4235.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan adapun terhadap kaum Šamùd, mereka telah Kami beri petunjuk untuk mencapai jalan kebaikan dengan mengutus Nabi Saleh. Sebagai bukti kebenaran risalahnya, Kami berikan kepada Nabi Saleh itu mukjizat berupa unta yang tidak boleh disembelih, tetapi mereka lebih menyukai kebutaan atau kesesatan yang disebabkan kebutaan mata hati, daripada petunjuk yang Kami sampaikan itu. Maka, mereka disambar petir dan halilintar sebagai azab yang menghinakan dan membinasakan disebabkan apa yang telah mereka kerjakan.",
                        "long": "Kepada kaum Samud, Allah telah menyampaikan agama-Nya dengan perantaraan Nabi Saleh. Allah telah menunjukkan kepada mereka jalan keselamatan dan jalan yang lurus, dengan memperlihatkan tanda-tanda kebesaran dan kekuasaan-Nya yang ada di cakrawala luas ini. Allah juga mengajarkan kepada mereka hukum-hukum yang dapat membahagiakan mereka di dunia dan akhirat. Akan tetapi, mereka mengutamakan kekafiran dari keimanan yang berarti pula mereka lebih mengutamakan kehinaan dan kesengsaraan daripada kemuliaan dan kebahagiaan. Karena sikap dan perbuatan mereka itu, maka Allah menurunkan kepada mereka azab berupa suara keras yang mengguntur dari langit.\n\nPada ayat yang lain, Allah menerangkan azab yang ditimpakan kepada kaum Samud. Allah berfirman:\n\nKemudian suara yang mengguntur menimpa orang-orang zalim itu, sehingga mereka mati bergelimpangan di rumahnya. Seolah-olah mereka belum pernah tinggal di tempat itu. Ingatlah, kaum Samud mengingkari Tuhan mereka. Ingatlah, binasalah kaum Samud. (Hud/11: 67-68)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4236,
                    "inSurah": 18
                },
                "meta": {
                    "juz": 24,
                    "page": 478,
                    "manzil": 6,
                    "ruku": 414,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَنَجَّيْنَا الَّذِينَ آمَنُوا وَكَانُوا يَتَّقُونَ",
                    "transliteration": {
                        "en": "Wa najjainal lazeena aamanoo wa kaanoo yattaqoon"
                    }
                },
                "translation": {
                    "en": "And We saved those who believed and used to fear Allah.",
                    "id": "Dan Kami selamatkan orang-orang yang beriman karena mereka adalah orang-orang yang bertakwa."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4236",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4236.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4236.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Setelah menjelaskan azab yang ditimpakan kepada kaum ‘Ad dan Šamùd yang mendurhakai nabinya masing-masing, Allah lalu menjelaskan keadaan Nabi Hud dan Nabi Saleh beserta para pengikutnya. Allah berfirman, “Dan Kami selamatkan kedua nabi itu, Nabi Hud dan Nabi Saleh, beserta orang-orang beriman yang menjadi pengikut keduanya karena mereka adalah orang-orang yang senantiasa bertakwa dengan melaksanakan segala yang Kami perintahkan dan meninggalkan apa yang Kami larang.",
                        "long": "Nabi Saleh dan orang-orang yang beriman diselamatkan Allah dari azab itu. Mereka tidak ditimpa malapetaka dan bencana yang dahsyat itu karena keimanan dan ketakwaan mereka kepada-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4237,
                    "inSurah": 19
                },
                "meta": {
                    "juz": 24,
                    "page": 478,
                    "manzil": 6,
                    "ruku": 415,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَيَوْمَ يُحْشَرُ أَعْدَاءُ اللَّهِ إِلَى النَّارِ فَهُمْ يُوزَعُونَ",
                    "transliteration": {
                        "en": "Wa yawma yuhsharu a'daaa'ul laahi ilan Naari fahum yooza'oon"
                    }
                },
                "translation": {
                    "en": "And [mention, O Muhammad], the Day when the enemies of Allah will be gathered to the Fire while they are [driven] assembled in rows,",
                    "id": "Dan (ingatlah) pada hari (ketika) musuh-musuh Allah digiring ke neraka lalu mereka dipisah-pisahkan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4237",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4237.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4237.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat-ayat sebelum ini berbicara tentang azab dan siksaan yang ditimpakan kepada kaum pendurhaka ketika mereka masih di dunia, dan mengisyaratkan bahwa siksaan di akhirat jauh lebih dahsyat dan menghinakan. Ayat-ayat berikut menjelaskan bagaimana penggambaran azab akhirat tersebut. Dan ingatkanlah kaum kafir Mekah itu, wahai Nabi Muhammad, bahwa pada hari Kiamat ketika mereka musuh-musuh Allah itu, seperti kaum ‘Ad dan Šamud, digiring dengan kasar dan tanpa belas kasihan oleh para malaikat ke dalam neraka lalu mereka dipisah-pisahkan.",
                        "long": "Ayat ini menerangkan perintah Allah kepada Nabi Muhammad agar menyampaikan kepada orang-orang yang ingkar itu keadaan mereka pada hari Kiamat nanti. Pada hari itu, semua musuh-musuh Allah dan orang-orang yang ingkar kepada-Nya akan dikumpulkan dalam neraka. Mereka dihalau ke dalamnya seperti orang menggiring dan menghalau binatang ternak. Tidak ada satu pun yang luput dan tertinggal di antara mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4238,
                    "inSurah": 20
                },
                "meta": {
                    "juz": 24,
                    "page": 478,
                    "manzil": 6,
                    "ruku": 415,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "حَتَّىٰ إِذَا مَا جَاءُوهَا شَهِدَ عَلَيْهِمْ سَمْعُهُمْ وَأَبْصَارُهُمْ وَجُلُودُهُم بِمَا كَانُوا يَعْمَلُونَ",
                    "transliteration": {
                        "en": "Hattaaa izaa maa jaaa'oohaa shahida 'alaihim samu'uhum wa absaaruhum wa julooduhum bimaa kaanoo ya'maloon"
                    }
                },
                "translation": {
                    "en": "Until, when they reach it, their hearing and their eyes and their skins will testify against them of what they used to do.",
                    "id": "Sehingga apabila mereka sampai ke neraka, pendengaran, penglihatan dan kulit mereka menjadi saksi terhadap apa yang telah mereka lakukan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4238",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4238.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4238.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sehingga apabila mereka, para musuh Allah itu, sampai ke depan pintu neraka, lalu diajukanlah kepada mereka pertanyaan tentang dosa-dosa yang telah mereka lakukan selama hidup di dunia. Akan tetapi, mereka mengingkarinya dan tidak mengakui perbuatan dosa itu. Maka, Allah mengambil anggota badan mereka, seperti pendengaran, penglihatan, dan kulit mereka menjadi saksi terhadap apa yang telah mereka lakukan selama hidup di dunia itu.",
                        "long": "Tatkala mereka sampai di pinggir neraka, mereka ditanya tentang perbuatan-perbuatan yang telah mereka lakukan selama hidup di dunia. Sebagai saksi atas perbuatan yang telah mereka lakukan itu ialah seluruh anggota badan mereka yang langsung melakukan perbuatan-perbuatan dosa itu, seperti telinga, mata, dan anggota-anggota tubuh mereka. Tiap-tiap makhluk ditanya sesuai dengan keadaan dan sifatnya. Apa yang ditanya dan bagaimana jawaban makhluk-makhluk itu, termasuk ilmu yang gaib, hanya Allah sendiri yang mengetahuinya. Mungkin ada soal yang berhubungan dengan niat dan isi hatinya, atau mengenai perbuatan-perbuatannya. Jika pertanyaan itu tentang ketaatan beribadah, sopan-santun, hubungan silaturrahim, amal saleh, dan yang serupa dengan itu dihadapkan kepada orang yang suka mengerjakan perbuatan itu selama hidup di dunia, tentu orang-orang itu akan menjawabnya dengan gembira kepada Allah. Jika budi pekerti yang buruk, memutuskan hubungan silaturrahim, perbuatan jahat, dan perbuatan lain yang serupa dengan itu, dihadapkan kepada orang yang mengerjakannya, tentulah mereka menjawab dengan gemetar dan penuh ketakutan. Allah Maha Mengetahui tentang itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4239,
                    "inSurah": 21
                },
                "meta": {
                    "juz": 24,
                    "page": 479,
                    "manzil": 6,
                    "ruku": 415,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالُوا لِجُلُودِهِمْ لِمَ شَهِدتُّمْ عَلَيْنَا ۖ قَالُوا أَنطَقَنَا اللَّهُ الَّذِي أَنطَقَ كُلَّ شَيْءٍ وَهُوَ خَلَقَكُمْ أَوَّلَ مَرَّةٍ وَإِلَيْهِ تُرْجَعُونَ",
                    "transliteration": {
                        "en": "Wa qaaloo lijuloodihim lima shahittum 'alainaa qaaloo antaqanal laahul lazeee antaqa kulla shai'inw wa Huwa khalaqakum awwala marratinw wa ilaihi turja'oon"
                    }
                },
                "translation": {
                    "en": "And they will say to their skins, \"Why have you testified against us?\" They will say, \"We were made to speak by Allah, who has made everything speak; and He created you the first time, and to Him you are returned.",
                    "id": "Dan mereka berkata kepada kulit mereka, “Mengapa kamu menjadi saksi terhadap kami?” (Kulit) mereka men-jawab, “Yang menjadikan kami dapat berbicara adalah Allah, yang (juga) menjadikan segala sesuatu dapat berbicara, dan Dialah yang menciptakan kamu yang pertama kali dan hanya kepada-Nya kamu dikembalikan.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4239",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4239.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4239.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ketika anggota tubuh mereka, seperti pendengaran, penglihatan, dan kulit mereka menjadi saksi terhadap perbuatan dosa yang mereka lakukan selama hidup di dunia, mereka pun mempertanyakan hal itu. Dan ingatlah ketika mereka para musuh Allah itu, berkata kepada kulit mereka sendiri, “Mengapa kamu menjadi saksi yang memberatkan terhadap kami?” Kulit mereka menjawab, “Yang menjadikan kami dapat berbicara adalah Allah, yang juga menjadikan segala sesuatu dapat berbicara, dan Dialah juga yang menciptakan kamu yang pertama kali serta menganugerahkan kemampuan berbicara, dan hanya kepada-Nya saja kamu dikembalikan.”",
                        "long": "Tatkala mendengar dan melihat bahwa kulitnya sendiri menjadi saksi atas perbuatan-perbuatannya, orang-orang kafir mencela kulit mereka itu dengan mengatakan, \"Mengapa kamu menjadi saksi atas diri kami, padahal kamulah yang membantu dan mendorong kami berbuat maksiat selama hidup di dunia?\" Kulit-kulit mereka menjawab, \"Allah Yang Mahakuasa telah menjadikan kami pandai berbicara, sehingga kami dapat menerangkan dengan jelas dan lengkap segala yang pernah kamu perintahkan kepada kami untuk mengerjakannya.\" Firman Allah:\n\nPada hari ini Kami tutup mulut mereka; tangan mereka akan berkata kepada Kami dan kaki mereka akan memberi kesaksian terhadap apa yang dahulu mereka kerjakan. (Yasin/36: 65)\n\nMengenai pertanyaan dan persaksian di akhirat ini diterangkan dalam hadis Nabi saw yang diriwayatkan dari Anas bin Malik, ia berkata:\n\nKetika kami bersama Rasulullah saw, beliau tertawa lalu berkata, \"Apakah kamu mengetahui kenapa aku tertawa?\" Kami menjawab, \"Allah dan Rasul-Nya yang lebih mengetahui.\" Beliau berkata, \"Aku tertawa karena pembicaraan seorang hamba dengan Tuhan (di hari Kiamat). Hamba berkata, \"Hai Tuhanku Apakah Engkau tidak melindungi aku dari kezaliman?\" Rasulullah berkata, \"Tuhan berkata, 'Benar.\" Rasulullah berkata, \"Hamba itu mengatakan, 'Maka saya tidak mengizinkan diriku kecuali saksi dari diriku sendiri.\" Rasulullah saw berkata, \"Allah berfirman, 'Cukuplah diri engkau menjadi saksi atas perbuatanmu sendiri pada hari ini, dan persaksian malaikat yang mencatat.\" Rasulullah berkata, \"Kemudian ditutuplah mulut orang itu dan dikatakan kepada anggota-anggota badannya, 'Berbicaralah, maka anggota-anggota badan itu menerangkan perbuatannya.\" Rasulullah berkata, \"Kemudian dibiarkan orang itu berbicara terhadap anggota badan mereka.\" Nabi berkata, \"Maka hamba itu berkata (kepada anggota badannya), 'Celaka dan hancurlah kamu semua. Aku ini berjuang untuk membela kamu.\"(Riwayat Muslim dan Ibnu hibban)\n\nAllah menerangkan bahwa Dialah Yang menciptakan manusia pada kali yang pertama, dari tidak ada kepada ada, dan Dia pula yang menjadikan untuk mereka dalil-dalil yang nyata. Jika Allah sanggup menciptakan manusia pada kali yang pertama, tentu Dia sanggup pula mengulangi penciptaan itu pada kali yang kedua, dengan membangkitkan manusia sesudah matinya, kemudian Dia membalas semua perbuatan manusia dengan adil."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4240,
                    "inSurah": 22
                },
                "meta": {
                    "juz": 24,
                    "page": 479,
                    "manzil": 6,
                    "ruku": 415,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا كُنتُمْ تَسْتَتِرُونَ أَن يَشْهَدَ عَلَيْكُمْ سَمْعُكُمْ وَلَا أَبْصَارُكُمْ وَلَا جُلُودُكُمْ وَلَٰكِن ظَنَنتُمْ أَنَّ اللَّهَ لَا يَعْلَمُ كَثِيرًا مِّمَّا تَعْمَلُونَ",
                    "transliteration": {
                        "en": "Wa maa kuntum tastatiroona ai-yashhada 'alaikum sam'ukum wa laaa absaarukum wa laa juloodukum wa laakin zanantum annal laaha laa ya'lamu kaseeram mimmaa ta'maloon"
                    }
                },
                "translation": {
                    "en": "And you were not covering yourselves, lest your hearing testify against you or your sight or your skins, but you assumed that Allah does not know much of what you do.",
                    "id": "Dan kamu tidak dapat bersembunyi dari kesaksian pendengaran, penglihatan dan kulitmu terhadapmu ) bahkan kamu mengira Allah tidak mengetahui banyak tentang apa yang kamu lakukan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4240",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4240.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4240.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan kamu benar-benar tidak dapat dan tidak mampu bersembunyi dari kesaksian yang diberikan oleh pendengaran, penglihatan, dan kulitmu terhadap diri-mu sendiri. Bahkan kamu mengira bahwa Allah Yang Maha Mendengar dan Maha Melihat itu tidak mengetahui banyak tentang apa yaitu perbuatan jahat yang telah kamu lakukan itu.",
                        "long": "Diriwayatkan dari al-Bukhari dan Muslim beserta imam-imam yang lain dari Ibnu Mas'ud ia berkata, \"Ketika aku bersembunyi di belakang tirai Ka'bah, maka datanglah tiga orang: seorang Quraisy dan dua orang Bani saqif, atau seorang Bani saqif dan dua orang Quraisy, sedikit sekali ilmunya dan amat buncit perut mereka, mereka mengucapkan perkataan yang tidak pernah aku dengar. Maka salah seorang mereka berkata, 'Apakah kamu berpendapat bahwa Allah mendengar perkataan kita ini? Maka yang lain menjawab, 'Sesungguhnya apabila kita mengeraskan suara kita, niscaya Dia mendengarnya dan apabila kita tidak mengeraskannya niscaya Dia tidak mendengarnya. Maka yang lain berkata, 'Jika Dia mendengar sesuatu daripadanya, pasti Dia mendengar seluruhnya.\" Maka Ibnu Mas'ud menyampaikan yang demikian pada Nabi saw, maka Allah menurunkan ayat ini sampai kepada firman-Nya: mi nal khasirin.\n\nAyat ini menerangkan bahwa manusia itu tidak dapat menyembunyikan dan merahasiakan perbuatan-perbuatan kejinya, sekalipun ia berbuat kemaksiatan, kejahatan, dan kekafiran secara terang-terangan dan mengingkari hari kebangkitan dan pembalasan Allah. Bahkan, ia mengira di saat ia menyembunyikan perbuatannya dari manusia, Allah pun tidak mengetahui apa-apa yang mereka kerjakan. Oleh karena itu, ia tidak akan dapat menghukum dan memberi pembalasan.\n\nAyat ini memperingatkan orang-orang yang beriman agar selalu waspada dan memikirkan benar-benar perbuatan-perbuatan yang akan mereka lakukan, karena Allah mengetahui segala yang mereka perbuat, tidak ada sesuatu pun yang tersembunyi bagi-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4241,
                    "inSurah": 23
                },
                "meta": {
                    "juz": 24,
                    "page": 479,
                    "manzil": 6,
                    "ruku": 415,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَذَٰلِكُمْ ظَنُّكُمُ الَّذِي ظَنَنتُم بِرَبِّكُمْ أَرْدَاكُمْ فَأَصْبَحْتُم مِّنَ الْخَاسِرِينَ",
                    "transliteration": {
                        "en": "Wa zaalikum zannukumul lazee zanantum bi-Rabbikum ardaakum fa asbahtum minal khaasireen"
                    }
                },
                "translation": {
                    "en": "And that was your assumption which you assumed about your Lord. It has brought you to ruin, and you have become among the losers.\"",
                    "id": "Dan itulah dugaanmu yang telah kamu sangkakan terhadap Tuhanmu (dugaan itu) telah membinasakan kamu, sehingga jadilah kamu termasuk orang yang rugi."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4241",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4241.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4241.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sungguh itulah dugaan buruk-mu yang telah kamu sangkakan terhadap Tuhan yang telah berbuat baik kepada-mu, dan sekarang ternyata dugaan itulah yang telah membinasakan kamu, sehingga jadilah kamu termasuk dalam kelompok orang yang rugi,",
                        "long": "Dugaan orang-orang kafir bahwa Allah tidak mengetahui dan tidak melihat perbuatan-perbuatan buruk yang dilakukannya adalah persangkaan yang tidak baik. Persangkaan yang demikian akan menimbulkan keberanian untuk melakukan perbuatan-perbuatan terlarang, sehingga berakibat kerugian pada diri sendiri. Akibat persangkaan yang demikian itu, mereka akan mendapat kerugian dan kehinaan di dunia dan azab pedih di akhirat nanti.\n\nDari ayat ini, dapat dipahami bahwa sangkaan yang baik ialah meyakini bahwa Allah mengetahui segala perbuatan hamba-Nya sejak dari yang halus sampai kepada yang besar, sejak dari yang nampak sampai kepada yang tersembunyi, dan Allah mengetahui segala isi hatinya.\n\nJika seseorang telah memercayai yang demikian, maka ia selalu meneliti segala yang akan diperbuatnya, mana yang diridai Allah dan mana yang tidak diridai-Nya. Ia akan menghentikan serta menjauhkan diri dari segala perbuatan yang tidak diridai Allah, karena ia telah yakin bahwa Allah melihat dan mengetahui semua perbuatannya itu.\n\nDiriwayatkan oleh Ahmad, Muslim, Abu Dawud., dan Ibnu Majah dari Jabir bin 'Abdullah:\n\nRasulullah saw bersabda, \"Kamu jangan sekali-kali mati kecuali berbaik sangka kepada Allah. (Riwayat Ahmad, Muslim, Abu Dawud, dan Ibnu Majah)\n\nPara ulama berpendapat bahwa sangkaan itu ada dua macam: pertama, sangkaan yang baik, yaitu menyangka bahwa Allah mempunyai rahmat, keutamaan, dan kebaikan yang akan dilimpahkan-Nya kepada manusia, sebagaimana tersebut dalam hadis Qudsi:\n\nAllah berfirman, \"Aku menuruti sangkaan hamba-Ku kepada-Ku.\"(Riwayat Muslim dari Anas)\n\nKedua, sangkaan yang jelek, yaitu menyangka bahwa Allah tidak mengetahui segala perbuatan hamba-hamba-Nya. \n\nMenurut Qatadah, sangkaan itu ada dua macam, yaitu: pertama, sangkaan yang menyelamatkan seperti yang diterangkan firman Allah:\n\nSesungguhnya aku yakin, bahwa (suatu saat) aku akan menerima perhitungan terhadap diriku. (al-haqqah/69: 20)\n\nDan firman Allah:\n\n(Yaitu) mereka yang yakin, bahwa mereka akan menemui Tuhannya, dan bahwa mereka akan kembali kepada-Nya. (al-Baqarah/2: 46)\n\nKedua, sangkaan yang merusak, seperti yang diterangkan firman Allah ini.\n\nUmar bin Khaththab berkata tentang ayat ini, \"Mereka adalah orang-orang yang terus-menerus berbuat maksiat, tidak bertobat dari perbuatan itu, dan mereka berdebat tentang ampunan Tuhan, sehingga mereka meninggalkan dunia tidak membawa apa-apa.\" Kemudian Umar membaca ayat ini.\n\nAl-hasan al-Bashri berkata, \"Sesungguhnya satu kaum yang diperdaya oleh angan-angannya yang kosong sehingga mereka meninggal dunia, dan tiadalah mereka mempunyai suatu kebaikan pun. Salah seorang dari mereka berkata, 'Sesungguhnya aku berbaik sangka terhadap Tuhanku. Sesungguhnya ia telah berdusta. Jika baik sangkaannya, tentu baik pula amalnya.\" Kemudian Al-hasan al-Bashrimembaca ayat ini."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4242,
                    "inSurah": 24
                },
                "meta": {
                    "juz": 24,
                    "page": 479,
                    "manzil": 6,
                    "ruku": 415,
                    "hizbQuarter": 191,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَإِن يَصْبِرُوا فَالنَّارُ مَثْوًى لَّهُمْ ۖ وَإِن يَسْتَعْتِبُوا فَمَا هُم مِّنَ الْمُعْتَبِينَ",
                    "transliteration": {
                        "en": "Fa-iny yasbiroo fan Naaru maswal lahum wa iny-yasta'tiboo famaa hum minal mu'tabeen"
                    }
                },
                "translation": {
                    "en": "So [even] if they are patient, the Fire is a residence for them; and if they ask to appease [Allah], they will not be of those who are allowed to appease.",
                    "id": "Meskipun mereka bersabar (atas azab neraka) maka nerakalah tempat tinggal mereka dan jika mereka minta belas kasihan, maka mereka itu tidak termasuk orang yang pantas dikasihani."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4242",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4242.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4242.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Agar terasa betapa besar murka Allah terhadap musuh-musuh-Nya itu, maka pembicaraan tidak ditujukan kepada mereka, karena mereka tidak layak lagi untuk diajak bicara, tetapi dikatakan bahwa meskipun mereka bersabar atau menahan rasa pedih atas azab neraka, maka memang yang pantas nerakalah yang menjadi tempat tinggal mereka, dan jika mereka minta belas kasihan agar diampuni dan diringankan siksanya, maka mereka itu tidak termasuk orang yang pantas dikasihani untuk diberi ampunan dan keringanan siksa.",
                        "long": "Pada ayat ini, Allah menerangkan keadaan orang-orang yang berburuk sangka terhadap Allah, yaitu mereka akan dimasukkan ke dalam neraka. Semuanya dimasukkan ke dalam neraka tidak ada kecualinya dan neraka inilah tempat kembali mereka.\n\nSeandainya di antara mereka ada yang minta ditangguhkan azab atau minta ampun kepada Allah dan bersedia kembali ke dunia seandainya Allah memberi mereka kesempatan, maka semuanya tidak akan dikabulkan. Permohonan mereka tidak mungkin dikabulkan karena mereka telah meninggalkan dunia. Tempat beramal dan dunia itu pun telah hancur, sedang akhirat bukanlah tempat beramal, tetapi tempat menerima hasil amal seseorang semasa hidup di dunia."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4243,
                    "inSurah": 25
                },
                "meta": {
                    "juz": 24,
                    "page": 479,
                    "manzil": 6,
                    "ruku": 415,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ وَقَيَّضْنَا لَهُمْ قُرَنَاءَ فَزَيَّنُوا لَهُم مَّا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَحَقَّ عَلَيْهِمُ الْقَوْلُ فِي أُمَمٍ قَدْ خَلَتْ مِن قَبْلِهِم مِّنَ الْجِنِّ وَالْإِنسِ ۖ إِنَّهُمْ كَانُوا خَاسِرِينَ",
                    "transliteration": {
                        "en": "Wa qaiyadnaa lahum quranaaa'a fazaiyanoo lahum maa baina aideehim wa maa khalfahum wa haqqa 'alaihimul qawlu feee umamin qad khalat min qablihim minal jinni wal insi innahum kaanoo khaasireen"
                    }
                },
                "translation": {
                    "en": "And We appointed for them companions who made attractive to them what was before them and what was behind them [of sin], and the word has come into effect upon them among nations which had passed on before them of jinn and men. Indeed, they [all] were losers.",
                    "id": "Dan Kami tetapkan bagi mereka teman-teman (setan) yang memuji-muji apa saja yang ada di hadapan dan di belakang mereka dan tetaplah atas mereka putusan azab bersama umat-umat yang terdahulu sebelum mereka dari (golongan) jin dan manusia. Sungguh, mereka adalah orang-orang yang rugi."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4243",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4243.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4243.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Setelah pada ayat-ayat yang lalu Al-Qur’an memberi kecaman terhadap para pendurhaka musyrikin Mekah dan siapa pun yang sama dengan mereka, pada ayat-ayat berikut Al-Qur’an menjelaskan lebih jauh sebab kedurhakaan itu. Dan Kami tetapkan bagi mereka para pendurhaka itu, teman-teman, yang sifat dan perangainya sama dengan mereka, yakni memuji-muji apa saja yang ada di hadapan mereka, yakni kelezatan duniawi, dan yang ada di belakang mereka, yakni kehidupan akhirat yang mereka ingkari. Dan oleh sebab itu, tetaplah atas mereka putusan, yakni azab, bersama umat-umat yang terdahulu sebelum mereka, dari golongan jin dan manusia. Sungguh, mereka semua para pendurhaka itu, adalah orang-orang yang benar-benar menderita kerugian.",
                        "long": "Allah menerangkan bahwa Dia telah menyediakan bagi orang kafir itu teman dan penolong berupa setan-setan dari golongan jin dan manusia. Mereka menganggap perbuatan-perbuatan duniawi yang membawa kepada kesesatan dan kekafiran itu baik, seperti memperturutkan hawa nafsu, suka mengumpulkan harta semata-mata untuk kepentingan diri sendiri, gila kekuasaan, mengerjakan perbuatan-perbuatan maksiat dan terlarang dan sebagainya. Demikian halnya dengan urusan-urusan akhirat, setan-setan itu telah menanamkan kepercayaan kepada hati manusia bahwa tidak ada surga atau neraka, tidak ada hidup sesudah mati, tidak ada kebangkitan dan hisab, tidak ada Tuhan yang wajib disembah, dan sebagainya. Oleh karena itu, mudah bagi mereka melakukan perbuatan-perbuatan yang mereka inginkan dan melakukan perbuatan-perbuatan terlarang. Firman Allah:\n\nDan barangsiapa berpaling dari pengajaran Allah Yang Maha Pengasih (Al-Qur'an), Kami biarkan setan (menyesatkannya) dan menjadi teman karibnya. Dan sungguh, mereka (setan-setan itu) benar-benar menghalang-halangi mereka dari jalan yang benar, sedang mereka menyangka bahwa mereka mendapat petunjuk. (az-Zukhruf/43: 36-37)\n\nKarena sikap dan perbuatan mereka itu, maka ditetapkanlah azab bagi mereka, seperti azab yang pernah ditimpakan kepada umat-umat dahulu, yang telah mengikuti tipu daya setan. Semua mereka itu, yaitu setan-setan beserta pengikut-pengikutnya, sama-sama menderita kerugian dan kehancuran. Mereka sama-sama mendapat azab yang pedih di akhirat nanti karena mereka sama-sama orang yang merugikan diri sendiri."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4244,
                    "inSurah": 26
                },
                "meta": {
                    "juz": 24,
                    "page": 479,
                    "manzil": 6,
                    "ruku": 416,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالَ الَّذِينَ كَفَرُوا لَا تَسْمَعُوا لِهَٰذَا الْقُرْآنِ وَالْغَوْا فِيهِ لَعَلَّكُمْ تَغْلِبُونَ",
                    "transliteration": {
                        "en": "Wa qaalal lazeena kafaroo laa tasma'oo lihaazal Quraani walghaw feehi la'allakum taghlihoon"
                    }
                },
                "translation": {
                    "en": "And those who disbelieve say, \"Do not listen to this Qur'an and speak noisily during [the recitation of] it that perhaps you will overcome.\"",
                    "id": "Dan orang-orang yang kafir berkata, “Janganlah kamu mendengarkan (bacaan) Al-Qur'an ini dan buatlah kegaduhan terhadapnya, agar kamu dapat mengalahkan (mereka).”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4244",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4244.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4244.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Contoh dari teman-teman para pendurhaka itu dapat dilihat pada perbuatan orang-orang yang melarang mendengarkan bacaan Al-Qur’an. Dan orang-orang yang kafir berkata satu sama lain di antara sesama mereka, “Janganlah kamu mendengarkan dengan cara apa pun bacaan Al-Qur’an ini, dan buatlah kegaduhan terhadapnya dengan cara berteriak-teriak atau bertepuk tangan sehingga bacaan itu tidak bisa didengar, agar dengan berbuat kegaduhan itu kamu dapat mengalahkan bacaan Al-Qur’an itu.",
                        "long": "Orang-orang yang kafir dan ingkar kepada Allah dan rasul-Nya berkata kepada kaum mereka, \"Jangan sekali-kali kamu mendengar ayat-ayat Al-Qur'an yang dibacakan oleh Muhammad, jangan kamu memperhatikan dan merenungkan isinya. Hendaklah kamu berusaha mengganggu pendengaran orang-orang yang mendengarnya, seperti dengan bernyanyi-nyanyi, bersorak-sorai. Dengan sikap kamu yang demikian, mudah-mudahan orang-orang yang mendengarnya, tidak mengetahui dengan jelas bacaan Al-Qur'an yang didengarnya itu.\"\n\nDahulu waktu Rasulullah masih di Mekah, sebelum hijrah ke Medinah, apabila beliau membaca ayat-ayat Al-Qur'an, beliau mengeraskan suaranya agar didengar orang-orang banyak. Apabila pemuda-pemuda musyrik Mekah mendengar beliau membaca Al-Qur'an, mereka mengusir orang-orang yang mendengar bacaan Nabi saw itu dengan mengatakan, \"Ganggulah suara Muhammad itu dengan menangis, bersiul, bernyanyi, atau dengan bertepuk tangan.\"\n\nIbnu 'Abbas berkata bahwa Abu Jahal berkata kepada kaumnya, \"Apabila Muhammad membaca ayat-ayat Al-Qur'an, berteriaklah dengan keras di mukanya, sehingga tidak terdengar apa yang diucapkannya.\" Padahal, Allah memerintahkan untuk mendengarkan jika Al-Qur'an dibacakan. Firman-Nya:\n\nDan apabila dibacakan Al-Qur'an, maka dengarkanlah dan diamlah, agar kamu mendapat rahmat. (al-A 'raf/7: 204)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4245,
                    "inSurah": 27
                },
                "meta": {
                    "juz": 24,
                    "page": 479,
                    "manzil": 6,
                    "ruku": 416,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَلَنُذِيقَنَّ الَّذِينَ كَفَرُوا عَذَابًا شَدِيدًا وَلَنَجْزِيَنَّهُمْ أَسْوَأَ الَّذِي كَانُوا يَعْمَلُونَ",
                    "transliteration": {
                        "en": "Falanuzeeqannal lazeena kafaroo 'azaaban shadeedanw wa lanajziyannahum aswallazee kaanoo ya'maloon"
                    }
                },
                "translation": {
                    "en": "But We will surely cause those who disbelieve to taste a severe punishment, and We will surely recompense them for the worst of what they had been doing.",
                    "id": "Maka sungguh, akan Kami timpakan azab yang keras kepada orang-orang yang kafir itu dan sungguh, akan Kami beri balasan mereka dengan seburuk-buruk balasan terhadap apa yang telah mereka kerjakan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4245",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4245.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4245.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Menanggapi saran para pendurhaka itu kepada teman-temannya agar membuat kegaduhan ketika Al-Qur’an sedang dibacakan, maka Allah akan menimpakan azab kepada mereka. Firman Allah, “Maka sungguh, akan segera Kami timpakan azab yang keras serta siksa yang pedih kepada orang-orang yang kafir itu, dan di samping itu sungguh akan Kami beri balasan kepada mereka dengan seburuk-buruk balasan di akhirat nanti terhadap apa yang telah mereka kerjakan di dunia.",
                        "long": "Pada ayat ini, Allah mengancam orang-orang kafir dengan azab yang pedih dengan mengatakan, \"Kami benar-benar akan merasakan kepada orang-orang kafir itu azab yang tidak dapat digambarkan kedahsyatnnya dan Kami akan membalas semua perbuatan dosa dan larangan yang telah mereka lakukan. Kami tidak akan memberi pahala semua perbuatan baik yang telah mereka kerjakan, karena semua perbuatan baik seperti menghubungkan silaturrahim, menolong orang sengsara, mengerjakan perbuatan baik dan sebagainya, telah dihapus oleh kekafiran mereka. Tidak ada satu pun yang dapat mereka harapkan dari perbuatan baik itu selain dari amal yang buruk.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4246,
                    "inSurah": 28
                },
                "meta": {
                    "juz": 24,
                    "page": 479,
                    "manzil": 6,
                    "ruku": 416,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "ذَٰلِكَ جَزَاءُ أَعْدَاءِ اللَّهِ النَّارُ ۖ لَهُمْ فِيهَا دَارُ الْخُلْدِ ۖ جَزَاءً بِمَا كَانُوا بِآيَاتِنَا يَجْحَدُونَ",
                    "transliteration": {
                        "en": "Zaalika jazaaa'u a'daaa'il laahin Naaru lahum feehaa daarul khuld, jazaaa'am bimaa kaanoo bi aayaatinaa yajhdoon"
                    }
                },
                "translation": {
                    "en": "That is the recompense of the enemies of Allah - the Fire. For them therein is the home of eternity as recompense for what they, of Our verses, were rejecting.",
                    "id": "Demikianlah balasan (terhadap) musuh-musuh Allah (yaitu) neraka; mereka mendapat tempat tinggal yang kekal di dalamnya sebagai balasan atas keingkaran mereka terhadap ayat-ayat Kami."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4246",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4246.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4246.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Demikianlah, siksa yang seburuk-buruknya itu merupakan balasan terhadap musuh-musuh Allah yaitu neraka; mereka mendapat tempat tinggal yang kekal di dalamnya sebagai balasan atas keingkaran mereka yang terus menerus terhadap ayat-ayat Kami.",
                        "long": "Balasan bagi orang-orang yang memperolok-olokkan ayat-ayat Allah dan bagi musuh-musuhnya ialah api neraka. Mereka kekal di dalamnya dan azab itu mereka rasakan terus-menerus. Mereka tidak dapat menghindarinya lagi.\n\nKemudian Allah menerangkan bahwa mereka berada di neraka Jahanam kekal selama-lamanya, sebagai balasan terhadap perbuatan mereka mengingkari ayat-ayat Allah sewaktu di dunia"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4247,
                    "inSurah": 29
                },
                "meta": {
                    "juz": 24,
                    "page": 479,
                    "manzil": 6,
                    "ruku": 416,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالَ الَّذِينَ كَفَرُوا رَبَّنَا أَرِنَا اللَّذَيْنِ أَضَلَّانَا مِنَ الْجِنِّ وَالْإِنسِ نَجْعَلْهُمَا تَحْتَ أَقْدَامِنَا لِيَكُونَا مِنَ الْأَسْفَلِينَ",
                    "transliteration": {
                        "en": "Wa qaalal lazeena kafaroo Rabbanaaa arinal lazaini adal laanaa minal jinni wal insi naj'alhumaa tahta aqdaaminaa liyakoonaa minal asfaleen"
                    }
                },
                "translation": {
                    "en": "And those who disbelieved will [then] say, \"Our Lord, show us those who misled us of the jinn and men [so] we may put them under our feet that they will be among the lowest.\"",
                    "id": "Dan orang-orang yang kafir berkata, “Ya Tuhan kami, perlihatkanlah kepada kami dua golongan yang telah menyesatkan kami yaitu (golongan) jin dan manusia, agar kami letakkan keduanya di bawah telapak kaki kami agar kedua golongan itu menjadi yang paling bawah (hina).”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4247",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4247.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4247.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Berkaitan erat dengan siksa yang menanti orang-orang kafir itu di neraka, ayat ini menggambarkan permintaan mereka agar diperlihatkan siapa yang telah menyesatkan mereka. Dan ketika sudah berada di neraka, orang-orong yang kafir berkata, “Ya Tuhan kami, perlihatkanlah kepada kami dua golongan makhluk yang telah menyesatkan dan mengakibatkan kami terjerumus masuk neraka ini, yaitu golongan jin dan manusia, agar kami letakkan mereka keduanya di bawah telapak kaki kami, agar kedua golongan itu menjadi orang yang paling bawah atau hina.”",
                        "long": "Pada ayat ini diterangkan bahwa tatkala orang-orang kafir itu merasakan azab neraka, mereka minta kepada Allah agar setan-setan yang menyesatkan mereka dihadapkan kepada mereka. Permintaan itu diajukan agar mereka dapat melampiaskan dendam mereka. Mereka berkata, \"Wahai Tuhan kami, hadapkanlah kepada kami setan-setan yang menyesatkan kami itu, agar kami dapat melampiaskan sakit hati kami kepada mereka dengan menginjak-injak tubuh mereka.\"\n\nPada ayat-ayat yang lain diterangkan bahwa setan-setan itu ada yang jenis jin dan ada yang dari jenis manusia, seperti firman Allah:\n\nDan demikianlah untuk setiap nabi Kami menjadikan musuh yang terdiri dari setan-setan manusia dan jin¦ (al-An'am/6: 112)\n\nDan firman Allah:\n\nYang membisikkan (kejahatan) ke dalam dada manusia, dari (golongan) jin dan manusia. (an-Nas/114: 5-6)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4248,
                    "inSurah": 30
                },
                "meta": {
                    "juz": 24,
                    "page": 480,
                    "manzil": 6,
                    "ruku": 416,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّ الَّذِينَ قَالُوا رَبُّنَا اللَّهُ ثُمَّ اسْتَقَامُوا تَتَنَزَّلُ عَلَيْهِمُ الْمَلَائِكَةُ أَلَّا تَخَافُوا وَلَا تَحْزَنُوا وَأَبْشِرُوا بِالْجَنَّةِ الَّتِي كُنتُمْ تُوعَدُونَ",
                    "transliteration": {
                        "en": "Innal lazeena qaaloo Rabbunal laahu summas taqaamoo tatanazzalu 'alaihimul malaaa 'ikatu allaa takhaafoo wa laa tahzanoo wa abshiroo bil Jannnatil latee kuntum too'adoon"
                    }
                },
                "translation": {
                    "en": "Indeed, those who have said, \"Our Lord is Allah \" and then remained on a right course - the angels will descend upon them, [saying], \"Do not fear and do not grieve but receive good tidings of Paradise, which you were promised.",
                    "id": "Sesungguhnya orang-orang yang berkata, “Tuhan kami adalah Allah” kemudian mereka meneguhkan pendirian mereka, maka malaikat-malaikat akan turun kepada mereka (dengan berkata), “Janganlah kamu merasa takut dan janganlah kamu bersedih hati; dan bergembiralah kamu dengan (memperoleh) surga yang telah dijanjikan kepadamu.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4248",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4248.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4248.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Pada ayat-ayat yang lalu telah dijelaskan adanya teman-teman bagi para pendurhaka yang menjerumuskan mereka ke dalam neraka, maka pada ayat-ayat berikut disajikan kebalikan dari itu, yakni orang-orang beriman yang bersaksi bahwa Allah adalah Tuhan mereka. Sesungguhnya orang-orang beriman yang berkata, “Tuhan kami adalah Allah,” kemudian mereka bermohon kepada Allah agar meneguhkan pendirian mereka beristikamah dalam hidup, maka malaikat-malaikat akan turun kepada mereka yang akan menjadi teman mereka dengan berkata, “Janganlah kamu merasa takut menghadapi masa datang, dan janganlah kamu bersedih hati; dan bergembiralah kamu dengan memperoleh surga yang telah dijanjikan Allah kepadamu melalui Rasul-Nya.”",
                        "long": "Ayat ini menerangkan bahwa orang-orang yang mengatakan dan mengakui bahwa Tuhan Yang Menciptakan, Memelihara, dan Menjaga kelangsungan hidup, Memberi rezeki, dan yang berhak disembah, hanyalah Tuhan Yang Maha Esa, kemudian mereka tetap teguh dalam pendiriannya itu, maka para malaikat akan turun untuk mendampingi mereka pada saat-saat diperlukan. Di antaranya pada saat mereka meninggal dunia, di dalam kubur, dan dihisab di akhirat nanti, sehingga segala kesulitan yang mereka hadapi terasa menjadi ringan.\n\nDalam hadis Nabi saw diterangkan bahwa teguh dalam pendirian itu merupakan hal yang sangat diperlukan oleh seorang mukmin:\n\nSufyan bin 'Abdullah ats-saqaf meriwayatkan bahwa seseorang berkata, \"Ya Rasulullah,perintahkan kepadaku tentang Islam suatu pererintah yang, aku tidak menanyakan lagi kepada orang selain engkau.\" Rasulullah menjawab, \"Katakanlah: Aku beriman kepada Allah, kemudian teguhkanlah pendirianmu.\" Aku berkata, \"Apa yang harus aku jaga?\" Maka Rasulullah mengisyaratkan kepada lidahnya sendiri. (Riwayat Muslim)\n\nMenurut Abu Bakar, yang dimaksud dengan perkataan \"istiqamah\" ialah tidak mempersekutukan Allah dengan sesuatu apa pun.\n\nKepada orang yang beriman dan berpendirian teguh dengan tidak mempersekutukan-Nya, Allah menurunkan malaikat yang menyampaikan kabar menggembirakan, memberikan segala yang bermanfaat, menolak kemudaratan, dan menghilangkan duka cita yang mungkin ada padanya dalam seluruh urusan duniawi maupun urusan ukhrawi. Dengan demikian, dadanya menjadi lapang dan tenteram, tidak ada kekhawatiran pada diri mereka. Sedangkan kepada orang-orang kafir, datang setan yang selalu menggoda mereka, sehingga menjadikan perbuatan buruk indah menurut pandangan mereka.\n\nWaki' dan Ibnu Zaid berpendapat bahwa para malaikat memberikan berita gembira kepada orang-orang yang beriman pada tiga keadaan yaitu, ketika mati, di dalam kubur, dan di waktu kebangkitan.\n\nKepada orang-orang yang beriman itu para malaikat mengatakan agar mereka tidak usah khawatir menghadapi hari kebangkitan dan hari perhitungan nanti. Mereka juga tidak usah bersedih hati terhadap urusan dunia yang luput dari mereka seperti yang berhubungan dengan keluarga, anak, harta, dan sebagainya.\n\nMenurut 'Atha', yang dimaksud dengan \"alla takhafu wa la tahzanu\" ialah: janganlah kamu khawatir bahwa Allah tidak memberi pahala amalmu, sesungguhnya kamu itu diterima Allah, dan janganlah kamu bersedih hati atas perbuatan dosa yang telah kamu perbuat, maka sesungguhnya Allah mengampuninya.\n\nAyat ini selanjutnya menjelaskan bahwa para malaikat mengatakan kepada orang-orang beriman agar bergembira dengan surga yang telah dijanjikan para rasul. Mereka pasti masuk surga, dan kekal di dalamnya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4249,
                    "inSurah": 31
                },
                "meta": {
                    "juz": 24,
                    "page": 480,
                    "manzil": 6,
                    "ruku": 416,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "نَحْنُ أَوْلِيَاؤُكُمْ فِي الْحَيَاةِ الدُّنْيَا وَفِي الْآخِرَةِ ۖ وَلَكُمْ فِيهَا مَا تَشْتَهِي أَنفُسُكُمْ وَلَكُمْ فِيهَا مَا تَدَّعُونَ",
                    "transliteration": {
                        "en": "Nahnu awliyaaa'ukum fil hayaatid dunyaa wa fil Aakhirati wa lakum feehaa maa tashtaheee anfusukum wa lakum feehaa ma tadda'oon"
                    }
                },
                "translation": {
                    "en": "We [angels] were your allies in worldly life and [are so] in the Hereafter. And you will have therein whatever your souls desire, and you will have therein whatever you request [or wish]",
                    "id": "Kamilah pelindung-pelindungmu dalam kehidupan dunia dan akhirat; di dalamnya (surga) kamu memperoleh apa yang kamu inginkan dan memperoleh apa yang kamu minta."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4249",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4249.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4249.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Demikianlah para malaikat menenangkan orang-orang beriman dan membuat mereka lebih merasa nyaman. Para malaikat itu berkata, “Kami, atas perintah Allah, menjadi pelindung-pelindungmu dan akan selalu siap membantu kamu dalam kehidupan dunia dan demikian pula dalam kehidupan akhirat. Maka di dalamnya, yakni di dalam surga ini, kamu memperoleh apa yang kamu inginkan dalam bentuk berbagai kenikmatan, dan memperoleh apa saja yang pernah kamu minta dulu di dunia.",
                        "long": "Selanjutnya para malaikat itu menyatakan kepada orang-orang yang beriman bahwa mereka selalu mendampingi dan menolong orang-orang tersebut dalam segala urusan dunia. Para malaikat selalu memberi petunjuk yang menuju kepada kebaikan, kebenaran, dan kemaslahatan. Demikian pula para malaikat akan bersama-sama orang-orang beriman di akhirat nanti, menemani mereka di dalam kubur, pada waktu hari Kiamat, dan hari perhitungan sampai mereka masuk ke dalam surga.\n\nSebagian ahli tafsir berpendapat bahwa yang menyatakan kepada orang-orang beriman dalam ayat ini ialah Allah sendiri, sehingga maksud ayat ini adalah: \"Dan Allah wali bagi orang-orang yang beriman yang kuat pendiriannya . . .\"\n\nMalaikat mengatakan bahwa di dalam surga itu orang-orang yang beriman akan memperoleh berbagai macam kesenangan, kebahagiaan, dan kenikmatan yang selalu diidam-idamkan, serta segala yang diinginkan dan diminta."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4250,
                    "inSurah": 32
                },
                "meta": {
                    "juz": 24,
                    "page": 480,
                    "manzil": 6,
                    "ruku": 416,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "نُزُلًا مِّنْ غَفُورٍ رَّحِيمٍ",
                    "transliteration": {
                        "en": "Nuzulam min Ghafoorir Raheem"
                    }
                },
                "translation": {
                    "en": "As accommodation from a [Lord who is] Forgiving and Merciful.\"",
                    "id": "Sebagai penghormatan (bagimu) dari (Allah) Yang Maha Pengampun, Maha Penyayang."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4250",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4250.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4250.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Yang demikian itu adalah sebagai penghormatan bagimu dari Allah Yang Maha Pengampun lagi Maha Penyayang.",
                        "long": "Pada ayat ini diterangkan bahwa Allah menganugerahkan yang demikian itu sebagai suatu kemuliaan bagi mereka. Dia mengampuni segala dosa-dosa dan mencurahkan rahmat kepada mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4251,
                    "inSurah": 33
                },
                "meta": {
                    "juz": 24,
                    "page": 480,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَنْ أَحْسَنُ قَوْلًا مِّمَّن دَعَا إِلَى اللَّهِ وَعَمِلَ صَالِحًا وَقَالَ إِنَّنِي مِنَ الْمُسْلِمِينَ",
                    "transliteration": {
                        "en": "Wa man ahsanu qawlam mimman da'aaa ilal laahi wa 'amila saalihanw wa qaala innanee minal muslimeen"
                    }
                },
                "translation": {
                    "en": "And who is better in speech than one who invites to Allah and does righteousness and says, \"Indeed, I am of the Muslims.\"",
                    "id": "Dan siapakah yang lebih baik perkataannya daripada orang yang menyeru kepada Allah dan mengerjakan kebajikan dan berkata, “Sungguh, aku termasuk orang-orang muslim (yang berserah diri)?”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4251",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4251.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4251.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Setelah ayat-ayat yang lalu menjelaskan penghargaan kepada orang-orang yang istikamah dengan kedatangan malaikat yang membantu mereka, maka ayat-ayat berikut memberikan pujian terhadap orang yang menyeru ke jalan Allah. Dan siapakah yang lebih baik perkataannya di antara manusia, daripada orang yang menyeru kepada Allah agar manusia tidak melakukan kemusyrikan, dan selalu gemar mengerjakan kebajikan dan berkata dengan penuh keyakinan, “Sungguh, aku termasuk ke dalam kelompok orang-orang muslim yang berserah diri?”",
                        "long": "Ayat ini mencela orang-orang yang mengatakan yang bukan-bukan tentang Al-Qur'an. Al-Qur'an mempertanyakan: perkataan manakah yang lebih baik daripada Al-Qur'an, siapakah yang lebih baik perkataannya dari orang yang menyeru manusia agar taat kepada Allah.\n\nIbnu Sirin, as-Suddi, Ibnu Zaid, dan al-hasan berpendapat bahwa orang yang paling baik perkataannya itu ialah Rasulullah saw. Apabila membaca ayat ini, al-hasan berkata bahwa yang dimaksud adalah Rasulullah, ia adalah kecintaan dan wali Allah. Ia adalah yang disucikan Allah dan merupakan pilihan-Nya. Ia adalah penduduk bumi yang paling cinta kepada Allah. Allah memperkenankan seruannya dan ia menyeru manusia agar mengikuti seruan itu. Sebagian ulama lain berpendapat bahwa ayat ini maksudnya umum, yaitu semua orang yang menyeru orang lain untuk menaati Allah. Rasulullah termasuk orang yang paling baik perkataannya, karena beliau menyeru manusia kepada agama Allah.\n\nAyat ini menerangkan bahwa seseorang dikatakan paling baik apabila perkataannya mengandung tiga perkara, yaitu:\n\n1. Seruan pada orang lain untuk mengikuti agama tauhid, mengesakan Allah dan taat kepada-Nya.\n\n2. Ajakan untuk beramal saleh, taat melaksanakan perintah-perintah Allah dan menghentikan larangan-Nya.\n\n3. Menjadikan Islam sebagai agama dan memurnikan ketaatan hanya kepada Allah saja.\n\nDengan menerangkan perkataan yang paling baik itu, seakan-akan Allah menegaskan kepada Rasulullah bahwa tugas yang diberikan kepada beliau itu adalah tugas yang paling mulia. Oleh karena itu, beliau diminta untuk tetap melaksanakan dakwah, dan sabar dalam menghadapi kesukaran-kesukaran dan rintangan-rintangan yang dilakukan orang-orang kafir.\n\nDari ayat ini dipahami bahwa sesuatu yang paling utama dikerjakan oleh seorang muslim ialah memperbaiki diri lebih dahulu, dengan memperkuat iman di dada, menaati segala perintah Allah, dan menghentikan segala larangan-Nya. Setelah diri diperbaiki, serulah orang lain mengikuti agama Allah. Orang yang bersih jiwanya, kuat imannya, dan selalu mengerjakan amal yang saleh, ajakannya lebih diperhatikan orang, karena ia menyeru orang lain dengan keyakinan yang kuat dan dengan suara yang mantap, tidak ragu-ragu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4252,
                    "inSurah": 34
                },
                "meta": {
                    "juz": 24,
                    "page": 480,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَا تَسْتَوِي الْحَسَنَةُ وَلَا السَّيِّئَةُ ۚ ادْفَعْ بِالَّتِي هِيَ أَحْسَنُ فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَهُ عَدَاوَةٌ كَأَنَّهُ وَلِيٌّ حَمِيمٌ",
                    "transliteration": {
                        "en": "Wa laa tastawil hasanatu wa las saiyi'ah; idfa' billatee hiya ahsanu fa'izal lazee bainaka wa bainahoo 'adaawatun ka'annahoo waliyun hameem"
                    }
                },
                "translation": {
                    "en": "And not equal are the good deed and the bad. Repel [evil] by that [deed] which is better; and thereupon the one whom between you and him is enmity [will become] as though he was a devoted friend.",
                    "id": "Dan tidaklah sama kebaikan dengan kejahatan. Tolaklah (kejahatan itu) dengan cara yang lebih baik, sehingga orang yang ada rasa permusuhan an-tara kamu dan dia akan seperti teman yang setia."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4252",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4252.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4252.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Orang seperti itulah orang yang terbaik. Dan dengan demikian tidaklah sama antara kebaikan dan pelaku kebaikan itu dengan kejahatan dan pelaku kejahatan itu. Oleh sebab itu, tolaklah kejahatan itu dengan cara yang lebih baik, dalam arti sebaik-baiknya. Jika itu yang dilakukan sehingga orang yang ada rasa permusuhan antara kamu dan dia akan berubah sikapnya kepadamu menjadi seperti teman yang setia.",
                        "long": "Ayat ini menerangkan bahwa kebaikan yang diridai Allah dan diberi pahala itu tidak sama dengan keburukan yang dibenci-Nya dan orang yang melakukannya pasti diazab.\n\nAyat ini dapat ditafsirkan dengan pernyataan bahwa tidak sama dakwah orang yang menyeru kepada Allah dan mengikuti Islam, dengan perbuatan mencela orang-orang yang melaksanakan dakwah itu.\n\nSikap orang kafir yang mencela para dai diterangkan dalam firman Allah:\n\n¦ Hati kami sudah tertutup dari apa yang engkau seru kami kepadanya¦ (Fushshilat/41: 5)\n\nDan firman Allah:\n\nDan orang-orang yang kafir berkata, \"Janganlah kamu mendengarkan (bacaan) Al-Qur'an ini dan buatlah kegaduhan terhadapnya, agar kamu dapat mengalahkan (mereka).\" (Fushshilat/41: 26)\n\nDengan ayat ini, seakan-akan Allah menyatakan kepada Rasulullah saw bahwa jika ia mengerjakan kebaikan, maka akan memperoleh ganjaran kebaikan berupa penghargaan selama hidup di dunia dan pahala yang besar di akhirat nanti. Sedang orang-orang kafir yang mengerjakan kejahatan itu akan memperoleh penghinaan di dunia, dan di akhirat mereka akan memperoleh azab yang pedih. Rasulullah juga dilarang untuk membalas kejahatan mereka dengan kejahatan. Jika ia membalas kejahatan dengan kejahatan tentu mereka akan memperoleh kerugian yang berlipat ganda. Oleh karena itu, Rasulullah diperintahkan untuk membalas kejahatan mereka dengan kebaikan.\n\nKemudian Allah menerangkan cara membalas kejahatan orang-orang kafir itu dengan kebaikan dengan memerintahkan kepada Rasulullah agar membalas kebodohan dan kejahatan orang-orang kafir dengan cara yang paling baik, membalas perbuatan buruk mereka dengan perbuatan baik, memaafkan kesalahan mereka, dan menghadapi kemarahan mereka dengan kesabaran. Jika Nabi berbuat demikian, lambat laun mereka akan menilai sendiri perbuatan mereka, dan menimbulkan malu kepada mereka karena tindakan-tindakan mereka itu.\n\nAllah menerangkan hasil yang akan diperoleh orang-orang yang beriman jika membalas perbuatan buruk orang-orang kafir dengan perbuatan baik. Allah mengatakan jika orang-orang beriman berhasil berbuat demikian, tentu permusuhan orang-orang kafir kepada mereka akan berubah menjadi persahabatan, kebencian akan berubah menjadi kecintaan.\n\nIbnu 'Abbas berkata bahwa pada ayat ini, Allah memerintahkan kepada manusia agar berlaku sabar ketika marah, penyantun terhadap orang yang bodoh, dan memaafkan kesalahan orang. Jika seseorang mengerjakan yang demikian, Allah akan memelihara mereka dari setan, dan musuh-musuh mereka akan tunduk dan patuh kepada mereka.\n\nDiriwayatkan bahwa seorang laki-laki mencela Qunbur, budak 'Ali bin Abi thalib, yang telah dimerdekakannya. 'Ali lalu memanggilnya dan berkata, Wahai Qunbur, tinggalkanlah orang yang mencelamu itu, biarkanlah ia, semoga Tuhan Yang Maha Penyayang meridai, dan setan menjadi marah.\"\n\nMenurut Muqatil., ayat ini turun berhubungan dengan Abu Sufyan. Dia adalah salah seorang musuh Rasulullah yang paling besar. Akan tetapi karena kesabaran dan sikap Nabi yang baik kepadanya, Abu Sufyan menjadi sahabat Nabi yang akrab, dengan mengadakan hubungan perbesanan (mushaharah)."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4253,
                    "inSurah": 35
                },
                "meta": {
                    "juz": 24,
                    "page": 480,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا يُلَقَّاهَا إِلَّا الَّذِينَ صَبَرُوا وَمَا يُلَقَّاهَا إِلَّا ذُو حَظٍّ عَظِيمٍ",
                    "transliteration": {
                        "en": "Wa maa yulaqqaahaaa illal lazeena sabaroo wa maa yulaqqaahaaa illaa zoo hazzin 'azeem"
                    }
                },
                "translation": {
                    "en": "But none is granted it except those who are patient, and none is granted it except one having a great portion [of good].",
                    "id": "Dan (sifat-sifat yang baik itu) tidak akan dianugerahkan kecuali kepada orang-orang yang sabar dan tidak dianugerahkan kecuali kepada orang-orang yang mempunyai keberuntungan yang besar."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4253",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4253.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4253.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ketahuilah bahwa sifat-sifat yang baik itu, yakni membalas keburukan dengan kebaikan, tidak akan dianugerahkan kecuali kepada orang-orang yang sudah terbiasa bersikap sabar dan juga tidak dianugerahkan kecuali kepada orang-orang yang mempunyai keberuntungan yang besar serta mempunyai hati yang bersih.",
                        "long": "Pada ayat ini, Allah menerangkan cara yang paling baik menghadapi orang-orang kafir, yaitu orang yang sabar ketika menderita kesulitan dan kesengsaraan, dapat menahan marah, tidak pendendam, dan suka memaafkan.\n\nAnas r.a. dalam menafsirkan ayat ini mengatakan bahwa yang dimaksud dengan sabar dalam ayat ini ialah apabila seseorang dimaki oleh orang lain, ia berkata, \"Jika engkau memakiku dengan alasan yang benar, mudah-mudahan Allah akan mengampuni dosamu. Jika engkau memakiku dengan alasan yang tidak benar, mudah-mudahan Allah mengampuni dosa-dosaku.\"\n\nNasihat agar berlaku sabar, menahan marah, dan suka memaafkan kesalahan orang lain itu adalah suatu nasihat yang paling utama dan tinggi nilainya. Yang dapat menerima nasihat itu hanyalah orang-orang yang beriman dan beramal saleh, yang akan memperoleh kebahagiaan di dunia dan di akhirat nanti.\n\nQatadah mengatakan bahwa arti dari \"keuntungan yang besar\" ialah surga. Maksud ayat ini ialah kesabaran itu hanyalah dianugerahkan kepada orang-orang yang akan masuk surga."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4254,
                    "inSurah": 36
                },
                "meta": {
                    "juz": 24,
                    "page": 480,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِمَّا يَنزَغَنَّكَ مِنَ الشَّيْطَانِ نَزْغٌ فَاسْتَعِذْ بِاللَّهِ ۖ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ",
                    "transliteration": {
                        "en": "Wa immaa yanzaghannaka minash Shaitaani nazghun fasta'iz billaahi innahoo Huwas Samee'ul 'Aleem"
                    }
                },
                "translation": {
                    "en": "And if there comes to you from Satan an evil suggestion, then seek refuge in Allah. Indeed, He is the Hearing, the Knowing.",
                    "id": "Dan jika setan mengganggumu dengan suatu godaan, maka mohonlah perlindungan kepada Allah. Sungguh, Dialah Yang Maha Mendengar, Maha Mengetahui."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4254",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4254.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4254.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sikap terpuji yang membalas keburukan dengan kebaikan itu sangat dibenci oleh setan. ltulah sebabnya setan selalu menghalang-halangi manusia agar tidak bersikap seperti demikian. Untuk itu, Allah mengajarkan bagaimana menghadapi setan berkaitan dengan hal itu. Dan jika setan mengganggumu wahai Nabi Muhammad, dengan suatu godaan, membalas keburukan dengan keburukan atau berbuat perbuatan lain yang tidak terpuji, maka mohonlah perlindungan kepada Allah. Sungguh, Dialah Yang Maha Mendengar, Maha Mengetahui sebagai tempat berlindung.",
                        "long": "Ayat ini menerangkan bahwa jika setan menggoda agar engkau membalas kejahatan dengan kejahatan pula, maka berlindunglah kepada Allah dari segala tipu daya setan yang terkutuk itu. Allah Maha Mendengar permohonanmu dan Maha Mengetahui segala yang dibisikkan setan ke dalam dadamu itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4255,
                    "inSurah": 37
                },
                "meta": {
                    "juz": 24,
                    "page": 480,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمِنْ آيَاتِهِ اللَّيْلُ وَالنَّهَارُ وَالشَّمْسُ وَالْقَمَرُ ۚ لَا تَسْجُدُوا لِلشَّمْسِ وَلَا لِلْقَمَرِ وَاسْجُدُوا لِلَّهِ الَّذِي خَلَقَهُنَّ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ",
                    "transliteration": {
                        "en": "Wa min Aayaatihil lailu wannahaaru washshamsu walqamar; laa tasjudoo lishshamsi wa laa lilqamari wasjudoo lillaahil lazee khala qahunna in kuntum iyyaahu ta'budoon"
                    }
                },
                "translation": {
                    "en": "And of His signs are the night and day and the sun and moon. Do not prostrate to the sun or to the moon, but prostate to Allah, who created them, if it should be Him that you worship.",
                    "id": "Dan sebagian dari tanda-tanda kebesaran-Nya ialah malam, siang, mata-hari dan bulan. Janganlah bersujud kepada matahari dan jangan (pula) kepada bulan, tetapi bersujudlah kepada Allah yang menciptakannya, jika kamu hanya menyembah kepada-Nya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4255",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4255.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4255.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Al-Qur’an memang kitab hidayah yang menuntun manusia agar menempuh jalan yang lurus. Setelah berbicara tentang sikap terpuji, yakni membalas keburukan dengan kebaikan, Al-Qur’an kemudian mengingatkan manusia betapa Allah itu sangat berkuasa sehingga malam, siang, matahari dan bulan dengan caranya sendiri-sendiri bersujud kepada Allah. Dengan metode observasi terhadap fenomena alam ini merupakan bentuk pengajaran yang menyentuh, bagi orang-orang yang mau mempergunakan nalarnya dengan baik.\r\nDan sebagian dari tanda-tanda kebesaran dan kekuasaan-Nya ialah adanya malam, siang, matahari, dan bulan yang merupakan ciptaan Allah. Oleh sebab itu, janganlah pernah bersujud kepada matahari dan jangan pula pernah bersujud kepada bulan, karena kedua-duanya adalah ciptaan Allah, tetapi bersujudlah hanya kepada Allah saja yang menciptakannya, jika memang kamu sudah menyatakan hanya akan menyembah kepada-Nya saja.",
                        "long": "Ayat ini menerangkan bahwa di antara tanda-tanda kebesaran dan kekuasaan Allah ialah adanya malam sebagai waktu istirahat, siang waktu bekerja dan berusaha, matahari yang memancarkan sinarnya, dan bulan yang bercahaya. Dia yang mengatur perjalanan planet-planet pada garis edarnya di cakrawala sehingga dengan demikian diketahui perhitungan tahun, bulan, hari, dan waktu sebagaimana firman Allah:\n\nDialah yang menjadikan matahari bersinar dan bulan bercahaya, dan Dialah yang menetapkan tempat-tempat orbitnya, agar kamu mengetahui bilangan tahun, dan perhitungan (waktu). (Yunus/10: 5)\n\nSetelah Allah menerangkan tanda-tanda kebesaran dan kekuasaan-Nya, Dia memperingatkan hamba-hamba-Nya agar jangan sekali-kali bersujud kepada tanda-tanda kebesaran dan kekuasaan-Nya itu, seperti matahari, bulan, bintang, dan sebagainya. Jangan sekali-kali memuliakan, menyembah, dan menganggapnya mempunyai kekuatan gaib, karena semuanya itu hanya Dialah yang menciptakan, menguasai, mengatur, dan menentukan ada dan tidaknya.\n\nSeakan-akan ayat ini menerangkan dan mengingatkan bahwa manusia adalah makhluk Tuhan yang paling mulia di antara makhluk-makhluk yang diciptakan-Nya. Karena itu tidak pantas manusia memuliakan, menganggap keramat, dan menghormati makhluk Tuhan yang lebih rendah daripadanya. Yang patut disembah, dimuliakan, dan dihormati adalah sesuatu yang paling berkuasa dan paling mulia yaitu Allah. Seandainya ada manusia yang menyembah dan memuliakan makhluk selain Allah, berarti manusia telah merendahkan martabat dirinya sendiri.\n\nAyat ini juga memperingatkan manusia yang menyekutukan Allah, penyembah-penyembah patung, penyembah-penyembah matahari, bulan, dan bintang-bintang agar menyadari kedudukannya di antara makhluk-makhluk yang lain itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4256,
                    "inSurah": 38
                },
                "meta": {
                    "juz": 24,
                    "page": 480,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": true
                    }
                },
                "text": {
                    "arab": "فَإِنِ اسْتَكْبَرُوا فَالَّذِينَ عِندَ رَبِّكَ يُسَبِّحُونَ لَهُ بِاللَّيْلِ وَالنَّهَارِ وَهُمْ لَا يَسْأَمُونَ ۩",
                    "transliteration": {
                        "en": "Fa inis-takbaroo fallazee na 'inda Rabbika yusabbihoona lahoo billaili wannnahaari wa hum laa yas'amoon"
                    }
                },
                "translation": {
                    "en": "But if they are arrogant - then those who are near your Lord exalt Him by night and by day, and they do not become weary.",
                    "id": "Jika mereka menyombongkan diri, maka mereka (malaikat) yang di sisi Tuhanmu bertasbih kepada-Nya pada malam dan siang hari, sedang mereka tidak pernah jemu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4256",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4256.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4256.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Jika mereka orang-orang kafir itu masih menyombongkan diri tidak mau mengikuti tuntunan ini janganlah kecewa. Sebab, Allah tidak memerlukan penyembahan dari siapa pun dan sudah ada malaikat yang tunduk dan patuh kepada Allah. Dengan ketundukan dan kepatuhan itu, maka mereka para malaikat yang di sisi Tuhanmu itu senantiasa bertasbih kepada-Nya pada malam dan siang hari, sedang mereka dalam bertasbih itu tidak pernah merasa jemu dan bosan.",
                        "long": "Kemudian Allah memperingatkan Nabi Muhammad bahwa jika orang-orang musyrik yang menyembah bintang-bintang itu bersikap angkuh dan tidak mengindahkan seruannya, biarkan saja mereka dengan kesesatan yang mereka lakukan itu. Allah tidak memerlukan mereka sedikit pun. Mereka beriman atau tidak beriman tidak ada artinya bagi Allah sedikit pun.\n\nAllah melanjutkan peringatan-Nya bahwa para makhluk yang berada di sisi-Nya lebih baik dari orang-orang musyrik itu, tidak ada yang bersikap angkuh dan menyombongkan diri kepada-Nya. Mereka senantiasa bertasbih, salat siang dan malam, dan sedikit pun mereka tidak pernah merasa jemu.\n\nAllah berfirman:\n\nDan engkau (Muhammad) akan melihat malaikat-malaikat melingkar di sekeliling 'Arasy, bertasbih sambil memuji Tuhannya; lalu diberikan keputusan di antara mereka (hamba-hamba Allah) secara adil dan dikatakan, \"Segala puji bagi Allah, Tuhan seluruh alam.\" (az-Zumar/39: 75)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4257,
                    "inSurah": 39
                },
                "meta": {
                    "juz": 24,
                    "page": 481,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمِنْ آيَاتِهِ أَنَّكَ تَرَى الْأَرْضَ خَاشِعَةً فَإِذَا أَنزَلْنَا عَلَيْهَا الْمَاءَ اهْتَزَّتْ وَرَبَتْ ۚ إِنَّ الَّذِي أَحْيَاهَا لَمُحْيِي الْمَوْتَىٰ ۚ إِنَّهُ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
                    "transliteration": {
                        "en": "Wa min Aayaatiheee annaka taral arda khaashi'atan fa izaaa anzalna 'alaihal maaa'ah tazzat wa rabat; innal lazeee ahyaahaa lamuhiyil mawtaa; innahoo 'alaa kulli shai-in Qadeer"
                    }
                },
                "translation": {
                    "en": "And of His signs is that you see the earth stilled, but when We send down upon it rain, it quivers and grows. Indeed, He who has given it life is the Giver of Life to the dead. Indeed, He is over all things competent.",
                    "id": "Dan sebagian dari tanda-tanda (kebesaran)-Nya, engkau melihat bumi itu kering dan tandus, tetapi apabila Kami turunkan hujan di atasnya, niscaya ia bergerak dan subur. Sesungguhnya (Allah) yang menghidupkannya pasti dapat menghidupkan yang mati; sesungguhnya Dia Mahakuasa atas segala sesuatu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4257",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4257.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4257.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sebagian dari tanda-tanda kebesaran dan kekuasaan-Nya adalah engkau melihat dengan kasat mata atau dengan pemikiran bumi itu kering dan tandus juga gersang dan mati, tetapi apabila Kami turunkan hujan dari langit di atas tanah yang kering dan tandus itu, niscaya dengan air hujan ia bergerak dan subur memberikan kehidupan, sehingga dapat ditumbuhi oleh tanam-tanaman yang sangat diperlukan oleh manusia dalam kehidupan. Ketahuilah, bahwa sesungguhnya Allah-lah yang menghidupkannya, dan dengan demikian pasti Allah dapat menghidupkan yang mati; sesungguhnya Dia Mahakuasa atas segala sesuatu.",
                        "long": "Ayat ini menerangkan bahwa di antara bukti-bukti kekuasaan Allah membangkitkan manusia di hari Kiamat nanti ialah bumi yang tandus dan mati, tidak ditumbuhi tumbuh-tumbuhan sedikit pun. Akan tetapi, apabila Dia menyirami tanah itu dengan air hujan dengan mengalirkan air kepadanya, maka bumi itu berubah menjadi hijau, karena tanahnya menjadi subur dan ditumbuhi tanam-tanaman.\n\nAllah berfirman:\n\nDan kamu lihat bumi ini kering, kemudian apabila telah Kami turunkan air (hujan) di atasnya, hiduplah bumi itu dan menjadi subur dan menumbuhkan berbagai jenis pasangan tetumbuhan yang indah. (al-hajj/22: 5)\n\nAyat ini berkaitan dengan tumbuhnya tumbuh-tumbuhan dengan adanya anugerah berupa air yang diturunkan dalam bentuk hujan. Pesan yang mirip, juga dapat ditemui pada Surah al-hajj/22 ayat 5, yang pada akhir ayatnya berbunyi: \"...Dan engkau melihat bumi kering kerontang, maka apabila Kami turunkan air di atasnya dia bergerak dan mengembang dan menumbuhkan berbagai jenis tanaman yang indah.\" Kata \"bergerak dan mengembang\" dikaitkan dengan gerakan butiran tanah saat biji tumbuhan berkecambah dan akarnya berkembang dan tumbuh hingga menjadi pohon dewasa.\n\nAllah yang telah menghidupkan bumi yang mati itu dengan menyiramkan air, dan menghidupkan tumbuh-tumbuhan, sehingga bumi itu menghijau, kuasa pula menghidupkan manusia yang telah mati, dan kuasa membangkitkannya dari kubur. Semuanya itu tidak ada yang sukar bagi-Nya. Semuanya mudah bagi-Nya. Dia Mahakuasa atas segala sesuatu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4258,
                    "inSurah": 40
                },
                "meta": {
                    "juz": 24,
                    "page": 481,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّ الَّذِينَ يُلْحِدُونَ فِي آيَاتِنَا لَا يَخْفَوْنَ عَلَيْنَا ۗ أَفَمَن يُلْقَىٰ فِي النَّارِ خَيْرٌ أَم مَّن يَأْتِي آمِنًا يَوْمَ الْقِيَامَةِ ۚ اعْمَلُوا مَا شِئْتُمْ ۖ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ",
                    "transliteration": {
                        "en": "Innal lazeena yulhidoona feee Aayaatina laa yakhfawna 'alainaa' afamai yulqaa fin Naari khayrun am mai yaateee aaminai Yawmal Qiyaamah; i'maloo ma shi'tum innahoo bimaa ta'maloona Baseer"
                    }
                },
                "translation": {
                    "en": "Indeed, those who inject deviation into Our verses are not concealed from Us. So, is he who is cast into the Fire better or he who comes secure on the Day of Resurrection? Do whatever you will; indeed, He is Seeing of what you do.",
                    "id": "Sesungguhnya orang-orang yang mengingkari tanda-tanda (kebesaran) Kami, mereka tidak tersembunyi dari Kami. Apakah orang-orang yang dilemparkan ke dalam neraka yang lebih baik ataukah mereka yang datang dengan aman sentosa pada hari Kiamat? Lakukanlah apa yang kamu kehendaki! Sungguh, Dia Maha Melihat apa yang kamu kerjakan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4258",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4258.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4258.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sangatlah logis bila dikatakan bahwa orang-orang yang mengingkari tanda-tanda kebesaran dan kemahakuasaan Allah tidak akan mampu bersembunyi dari penglihatan-Nya, karena Allah itu Zat Yang Maha Melihat lagi Maha Mengetahui. Ayat berikut memperingatkan dengan mengancam mereka. Sesungguhnya orang-orang yang mengingkari tanda-tanda kebesaran Kami dengan menempuh jalan yang sesat, mereka itu sedetik pun tidak tersembunyi dari tilikan Kami. Maka jika demikian manakah yang terbaik, apakah arang-orang yang dilemparkan ke dalam neraka yang lebih baik, ataukah mereka yang datang dengan aman sentosa pada hari Kiamat? Oleh sebab itu, katakanlah kepada orang-orang yang durhaka itu, “Lakukanlah apa saja yang kamu kehendaki sesuka hatimu! Sungguh, Dia Maha Melihat apa yang kamu kerjakan dan membalas kamu sesuai dengan apa yang kamu perbuat itu.",
                        "long": "Ayat ini menerangkan bahwa Allah Maha Mengetahui semua yang dilakukan dan tipu daya yang dibuat oleh orang-orang yang menentang Al-Qur'an menurut keinginan hawa nafsu mereka sendiri, mengingkari, dan mencelanya. Tidak ada sesuatu pun yang tersembunyi dan tidak diketahui Allah. Oleh karena itu, Dia akan membalas segala perbuatan mereka itu dengan ganjaran yang setimpal.\n\nKemudian Allah menerangkan perbedaan dan bentuk pembalasan yang akan diterima oleh orang-orang mukmin dan orang-orang kafir di akhirat nanti dengan mengatakan bahwa orang-orang yang dimasukkan ke dalam neraka karena mengingkari Allah, rasul, dan ayat-ayat-Nya tidak sama dengan orang-orang beriman yang memercayai ayat-ayat Al-Qur'an, mengikuti rasul-Nya, dan mendapat surga. Allah akan menetapkan keputusan dengan adil antara mereka dan balasan yang akan mereka peroleh tentu pula tidak sama.\n\nAyat ini ditujukan kepada seluruh manusia yang kafir dan mukmin. Akan tetapi, sebagian ulama berpendapat bahwa ayat ini berarti umum dan khusus. Umum meliputi seluruh manusia yang kafir dan beriman, khusus berhubungan dengan Abu Jahal yang mengingkari Rasulullah saw dan orang-orang yang beriman kepadanya.\n\nDiriwayatkan oleh 'Abd ar-Razzaq, Ibnu al-Mundzir, Ibnu Asakir dari Busyair bin Tamim, ia berkata, \"Ayat ini diturunkan berkenaan dengan Abu Jahal dan 'Ammar bin Yasir.\"\n\nPada akhir ayat ini, Allah menegaskan bahwa Nabi Muhammad telah mengetahui akibat yang diperoleh orang-orang yang berbuat dosa di akhirat nanti, dan akibat yang akan diperoleh orang-orang yang beriman kelak. Oleh karena itu, manusia dipersilakan untuk melakukan apa saja yang dikehendaki, ia telah mengetahui akibatnya. Allah melihat segala perbuatan manusia dan memberi balasan sesuai dengan yang telah diperbuatnya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4259,
                    "inSurah": 41
                },
                "meta": {
                    "juz": 24,
                    "page": 481,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّ الَّذِينَ كَفَرُوا بِالذِّكْرِ لَمَّا جَاءَهُمْ ۖ وَإِنَّهُ لَكِتَابٌ عَزِيزٌ",
                    "transliteration": {
                        "en": "Inna Lazeena kafaroo biz Zikri lammaa jaa'ahum wa innahoo la Kitaabun 'Azeez"
                    }
                },
                "translation": {
                    "en": "Indeed, those who disbelieve in the message after it has come to them... And indeed, it is a mighty Book.",
                    "id": "Sesungguhnya orang-orang yang mengingkari Al-Qur'an ketika (Al-Qur'an) itu disampaikan kepada mereka (mereka itu pasti akan celaka), dan sesungguhnya (Al-Qur'an) itu adalah Kitab yang mulia,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4259",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4259.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4259.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat-ayat Allah ada yang terbentang di alam raya dan ada yang termaktub dalam Al-Qur’an. Bahkan Al-Qur’an adalah himpunan dari ayat-ayat Allah. Sebagaimana orang-orang yang mengingkari ayat-ayat Allah yang terbentang di alam raya ini, orang-orang yang mengingkari Al-Qur’an juga akan menjadi celaka. Sesungguhnya orang-orang yang mengingkari Al-Qur’an ketika Al-Qur’an itu disampaikan kepada mereka, mereka itu pasti akan celaka jika tidak segera bertobat, dan sesungguhnya Al-Qur’an itu adalah Kitab yang mulia dari Zat Yang Mahamulia lagi Mahaperkasa.",
                        "long": "Pada ayat ini diterangkan tanda-tanda orang-orang yang ingkar itu ialah mengingkari ayat-ayat Allah, dan mengingkari Al-Qur'an ketika disampaikan kepada mereka. Mereka akan memperoleh ganjaran yang setimpal dengan kekafiran mereka itu.\n\nKemudian Allah menerangkan bahwa Al-Qur'an itu adalah sebuah kitab yang mulia, yang tidak dapat dibatalkan isinya, dan tidak dapat diubah-ubah sedikit pun."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4260,
                    "inSurah": 42
                },
                "meta": {
                    "juz": 24,
                    "page": 481,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَّا يَأْتِيهِ الْبَاطِلُ مِن بَيْنِ يَدَيْهِ وَلَا مِنْ خَلْفِهِ ۖ تَنزِيلٌ مِّنْ حَكِيمٍ حَمِيدٍ",
                    "transliteration": {
                        "en": "Laa yaateehil baatilu mim baini yadaihi wa laa min khalfihee tanzeelum min Hakeemin Hameed"
                    }
                },
                "translation": {
                    "en": "Falsehood cannot approach it from before it or from behind it; [it is] a revelation from a [Lord who is] Wise and Praiseworthy.",
                    "id": "yang) tidak akan didatangi oleh kebatilan baik dari depan maupun dari belakang (pada masa lalu dan yang akan datang), yang diturunkan dari Tuhan Yang Mahabijaksana, Maha Terpuji."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4260",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4260.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4260.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Al-Qur'an itu adalah kitab yang tidak akan didatangi oleh kebatilan baik dari depan maupun dari belakang, baik pada masa lalu dan yang akan datang, kitab yang diturunkan dari Tuhan Yang Mahabijaksana lagi Maha Terpuji.",
                        "long": "Ayat ini menegaskan bahwa tidak ada sesuatu pun yang membatalkan ayat-ayat Al-Qur'an, walaupun itu kitab-kitab Allah yang terdahulu, seperti Taurat, Zabur, dan Injil, dan tidak satu pun kitab Allah yang datang setelah Al-Qur'an. Arti ini sesuai dengan pendapat Sa'id bin Jubair dan al-Kalbi.\n\nPada akhir ayat ini diterangkan bahwa seluruh Al-Qur'an itu benar, tidak ada yang salah sedikit pun, karena Al-Qur'an berasal dari Allah, Tuhan semesta alam. Semua yang berasal dari Allah adalah benar belaka, tidak ada satu pun yang kurang, yang salah, atau tidak sempurna. Dia Mahabijaksana dan Maha Terpuji."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4261,
                    "inSurah": 43
                },
                "meta": {
                    "juz": 24,
                    "page": 481,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مَّا يُقَالُ لَكَ إِلَّا مَا قَدْ قِيلَ لِلرُّسُلِ مِن قَبْلِكَ ۚ إِنَّ رَبَّكَ لَذُو مَغْفِرَةٍ وَذُو عِقَابٍ أَلِيمٍ",
                    "transliteration": {
                        "en": "Maa yuqaalu laka illaa maa qad qeela lir Rusuli min qablik; inna Rabbaka lazoo maghfiratinw wa zoo 'iqaabin aleem"
                    }
                },
                "translation": {
                    "en": "Nothing is said to you, [O Muhammad], except what was already said to the messengers before you. Indeed, your Lord is a possessor of forgiveness and a possessor of painful penalty.",
                    "id": "Apa yang dikatakan (oleh orang-orang kafir) kepadamu tidak lain adalah apa yang telah dikatakan kepada rasul-rasul sebelummu. Sungguh, Tuhanmu mempunyai ampunan dan azab yang pedih."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4261",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4261.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4261.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Jelaslah sekarang, dari ungkapan ayat-ayat yang lalu, tindakan durhaka yang dilakukan oleh para pendurhaka yang memaki dan mengejek nabi dan rasul sama saja dengan apa yang dilakukan oleh musyrik Mekah terhadap Nabi Muhammad. “Apa yang dikatakan oleh orang-orang kafir musyrik Mekah kepadamu wahai Nabi Muhammad, apakah itu menyangkut dirimu, ataupun menyangkut Al-Qur’an, tidak lain adalah sama dengan apa yang telah dikatakan kepada rasul-rasul sebelummu. Oleh sebab itu, bersabarlah atas makian dan ejekan mereka. Sungguh, Tuhanmu akan melindungi dan membimbingmu, dan Dia mempunyai ampunan bagi orang-orang beriman dan mempunyai azab yang pedih untuk orang-orang yang durhaka.”",
                        "long": "Ayat ini merupakan hiburan Allah bagi Nabi saw yang sedih karena sikap dan perbuatan orang-orang musyrik terhadap Al-Qur'an yang disampaikannya. Allah mengatakan bahwa sikap, tindakan, dan ucapan-ucapan yang dilakukan orang-orang musyrik yang mendustakan ayat-ayat Allah itu, sama dengan tindakan dan ucapan-ucapan yang disampaikan oleh umat-umat terdahulu kepada rasul-rasul mereka. Walaupun demikian, mereka tetap bersabar dan tabah dalam menyampaikan risalahnya. Oleh karena itu, Nabi Muhammad juga diperintahkan untuk sabar dan tabah, sebagaimana rasul-rasul sebelumnya. Beliau juga diminta untuk tetap pada seruannya.\n\nAyat yang lain yang sama isinya dengan ayat ini ialah firman-Nya:\n\nDemikianlah setiap kali seorang Rasul yang datang kepada orang-orang yang sebelum mereka, mereka (kaumnya) pasti mengatakan, \"Dia itu pesihir atau orang gila.\" (adz-dzariyat/51: 52)\n\nSebagian ahli tafsir ada yang berpendapat bahwa maksud ayat ini adalah sesungguhnya yang disampaikan kepada Nabi Muhammad, seperti ajaran keesaan Allah, dan memurnikan ketaatan dan ketundukan hanya kepada-Nya, sama dengan yang pernah disampaikan kepada para rasul yang diutus sebelumnya. Hal ini adalah wajar karena agama Allah itu mempunyai azas dan prinsip yang sama. Semuanya sama-sama menentukan dan memerintahkan untuk menghambakan diri hanya kepada Allah, sama-sama percaya kepada adanya hari kebangkitan, dan sebagainya. Seandainya ada perbedaan, maka perbedaan itu bukanlah berhubungan dengan azas atau prinsip, tetapi hanyalah yang berhubungan dengan furu' atau yang bukan prinsip. Hal ini perlu karena perbedaan keadaan, masa, dan tempat.\n\nPenafsiran ini sesuai dengan firman Allah:\n\nSesungguhnya Kami mewahyukan kepadamu (Muhammad) sebagaimana Kami telah mewahyukan kepada Nuh dan nabi-nabi setelahnya¦ (an-Nisa'/4: 163)\n\nJika ayat ini dihubungkan dengan ayat-ayat yang sesudahnya, maka pendapat yang pertamalah yang lebih sesuai, karena pembicaraan ayat-ayat yang sesudahnya berhubungan dengan sikap orang-orang musyrik terhadap Al-Qur'an. Tetapi jika dihubungkan dengan ayat-ayat sebelumnya, maka pendapat yang kedualah yang sesuai, karena pembicaraan berhubungan dengan Al-Qur'an, sebagai wahyu yang di dalamnya tidak terdapat kesalahan dan kekurangan. Dalam penafsiran, ayat ini dimasukkan ke dalam kelompok ayat-ayat sesudahnya.\n\nPada akhir ayat ini diterangkan kepada Nabi Muhammad bahwa Tuhannya adalah Tuhan Yang Maha Esa. Yang berhak disembah itu adalah juga Tuhan Yang Maha Pengampun kepada hamba-hamba-Nya yang mau bertobat, dan juga memberi siksaan yang sangat pedih kepada orang-orang kafir lagi sombong dan tidak mau bertobat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4262,
                    "inSurah": 44
                },
                "meta": {
                    "juz": 24,
                    "page": 481,
                    "manzil": 6,
                    "ruku": 417,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَوْ جَعَلْنَاهُ قُرْآنًا أَعْجَمِيًّا لَّقَالُوا لَوْلَا فُصِّلَتْ آيَاتُهُ ۖ أَأَعْجَمِيٌّ وَعَرَبِيٌّ ۗ قُلْ هُوَ لِلَّذِينَ آمَنُوا هُدًى وَشِفَاءٌ ۖ وَالَّذِينَ لَا يُؤْمِنُونَ فِي آذَانِهِمْ وَقْرٌ وَهُوَ عَلَيْهِمْ عَمًى ۚ أُولَٰئِكَ يُنَادَوْنَ مِن مَّكَانٍ بَعِيدٍ",
                    "transliteration": {
                        "en": "Wa law ja'alnaahu Qur-aanan A'jamiyyal laqaaloo law laa fussilat Aayaatuhoo 'a A'jamiyyunw wa 'Arabiyy; qul huwa lillazeena aamanoo hudanw wa shifaaa'unw wallazeena la yu'minoona feee aazaanihim waqrunw wa huwa 'alaihim 'amaa; ulaaa'ika yunaadawna mim maakaanim ba'eed"
                    }
                },
                "translation": {
                    "en": "And if We had made it a non-Arabic Qur'an, they would have said, \"Why are its verses not explained in detail [in our language]? Is it a foreign [recitation] and an Arab [messenger]?\" Say, \"It is, for those who believe, a guidance and cure.\" And those who do not believe - in their ears is deafness, and it is upon them blindness. Those are being called from a distant place.",
                    "id": "Dan sekiranya Al-Qur'an Kami jadikan sebagai bacaan dalam bahasa selain bahasa Arab niscaya mereka mengatakan, “Mengapa tidak dijelaskan ayat-ayatnya?” Apakah patut (Al-Qur'an) dalam bahasa selain bahasa Arab sedang (rasul), orang Arab? Katakanlah, “Al-Qur'an adalah petunjuk dan penyembuh bagi orang-orang yang beriman. Dan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan (Al-Qur'an) itu merupakan kegelapan bagi mereka. Mereka itu (seperti) orang-orang yang dipanggil dari tempat yang jauh.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4262",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4262.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4262.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Salah satu pernyataan orang-orang durhaka itu tentang Al-Qur’an adalah bahwa mereka telah menutup hati dari Al-Qur’an (ayat 5). Pernyataan itu sebenarnya ungkapan lain dari pengingkaran bahwa mereka sebenarnya tidak mau mengerti dengan Al-Qur’an. Dan sekiranya Al-Qur’an yang Kami turunkan itu, Kami jadikan sebagai bacaan dalam bahasa selain bahasa Arab atau dalam bahasa Arab tetapi tidak jelas maknanya bagi orang-orang kafir itu, niscaya mereka mengatakan dengan nada mengecam, “Mengapa tidak dijelaskan dan diperinci apa maksud ayat-ayatnya?” Kecaman orang-orang kafir itu dijawab Allah dalam Al-Qur’an sendiri, “Apakah patut Al-Qur’an diturunkan dalam bahasa selain bahasa Arab, sedangkan rasul yang membawanya dan masyarakat yang ditujunya ketika itu adalah orang Arab yang berbahasa Arab? Katakanlah, wahai Nabi Muhammad, ‘Al-Qur’an itu secara khusus adalah sebagai petunjuk dan penyembuh bagi orang-orang yang beriman. Dan sedangkan bagi orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan Al-Qur’an itu merupakan kegelapan bagi mereka. Mereka itu seperti orang-orang yang dipanggil dari tempat yang jauh sehingga mereka tidak mendengar panggilan orang yang memanggil.’”",
                        "long": "Ayat ini merupakan jawaban dari sikap dan ucapan orang-orang musyrik yang terdapat pada ayat-ayat yang sebelumnya. Kepada mereka disampaikan bahwa seandainya Allah menurunkan Al-Qur'an kepada Nabi Muhammad dengan salah satu bahasa selain dari bahasa Arab, tentu orang-orang Quraisy Mekah akan berkata, \"Mengapa Al-Qur'an tidak diturunkan dalam bahasa Arab? Sehingga kami mudah memahami hukum-hukum dan ketentuan-ketentuan yang terdapat di dalamnya.\" Padahal dulunya mereka berkata, \"Apakah Al-Qur'an yang diturunkan itu berbahasa selain Arab, sedang rasul yang diutus itu berbahasa Arab.\"\n\nAllah memerintahkan agar Rasulullah menjawab pertanyaan orang-orang musyrik yang tidak mau percaya kepada Al-Qur'an itu dengan berkata kepada mereka, \"Al-Qur'an ini bagi orang-orang yang percaya kepadanya, meyakini bahwa ia berasal dari Allah Yang Mahakuasa, dan percaya kepada rasul yang menyampaikannya, merupakan petunjuk ke jalan kebahagiaan, penawar hati, dan menghilangkan keragu-raguan. Ayat ini sejalan dengan firman Allah:\n\nWahai manusia! Sungguh, telah datang kepadamu pelajaran (Al-Qur'an) dari Tuhanmu, penyembuh bagi penyakit yang ada dalam dada dan petunjuk serta rahmat bagi orang yang beriman. (Yunus/10: 57)\n\nOrang-orang yang tidak beriman kepada Allah, rasul-Nya, dan Al-Qur'an, pada telinga mereka ada sumbatan yang menutup pendengaran mereka dari mendengar ayat-ayat Al-Qur'an. Mereka buta sehingga tidak dapat melihat bukti-bukti kebesaran dan kekuasaan Allah dan tidak dapat menerima pelajaran yang disampaikan rasul.\n\nOrang-orang yang tidak mendengar ayat-ayat Allah dan tidak dapat melihat bukti-bukti kebesaran dan kekuasaan-Nya diserupakan dengan orang yang diseru dari suatu tempat yang jauh, ia hanya dapat mendengar suara yang tidak jelas, sehingga ia tidak mengerti maksud suara itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4263,
                    "inSurah": 45
                },
                "meta": {
                    "juz": 24,
                    "page": 481,
                    "manzil": 6,
                    "ruku": 418,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ فَاخْتُلِفَ فِيهِ ۗ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ لَقُضِيَ بَيْنَهُمْ ۚ وَإِنَّهُمْ لَفِي شَكٍّ مِّنْهُ مُرِيبٍ",
                    "transliteration": {
                        "en": "Wa laqad aatainaa Moosal Kitaaba fakhtulifa fee; wa lawlaa Kalimatun sabaqat mir Rabbika laqudiya bainahum; wa innahum lafee shakkim minhu mureeb"
                    }
                },
                "translation": {
                    "en": "And We had already given Moses the Scripture, but it came under disagreement. And if not for a word that preceded from your Lord, it would have been concluded between them. And indeed they are, concerning the Qur'an, in disquieting doubt.",
                    "id": "Dan sungguh, telah Kami berikan kepada Musa Kitab (Taurat) lalu diperselisihkan. Sekiranya tidak ada keputusan yang terdahulu dari Tuhanmu, orang-orang kafir itu pasti sudah dibinasakan. Dan sesungguhnya mereka benar-benar dalam keraguan yang mendalam terhadapnya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4263",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4263.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4263.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sama dengan apa yang dilakukan oleh orang-orang musyrik Mekah yang memperselisihkan Al-Qur’an, hal yang sama juga terjadi atas kitab Taurat yang diturunkan kepada Nabi Musa. Firman Allah, “Dan sungguh, telah Kami berikan kepada Musa Kitab Taurat, lalu Kitab Taurat itu diperselisihkan oleh Bani Israil. Sekiranya tidak ada keputusan yang terdahulu dari Tuhanmu, yakni menunda jatuhnya siksa sampai nanti pada hari yang ditetapkan, niscaya orang-orang kafir itu pasti sudah dibinasakan. Dan sesungguhnya mereka menyikapi Al-Qur’an itu benar-benar dalam keraguan yang mendalam, terutama terhadap kepastian-nya sebagai wahyu yang berasal dari Allah.",
                        "long": "Selanjutnya Allah menyampaikan kepada Nabi Muhammad agar tidak menyusahkan diri karena orang-orang Mekah itu berselisih pendapat tentang Al-Qur'an. Hal yang seperti itu telah dilakukan pula oleh umat-umat yang dahulu terhadap rasul-rasul yang diutus kepada mereka. Allah mengatakan bahwa Dia telah menurunkan Taurat kepada Musa, untuk disampaikan kepada Bani Israil. Mereka pun telah berselisih pendapat pula tentang Taurat itu. Ada yang membenarkan dan ada pula yang mendustakan. Ada yang beriman kepada Musa dan ada pula yang kafir kepadanya. Oleh karena itu, Nabi Muhammad diperintahkan untuk tidak berputus asa dalam menyampaikan agama Allah, dan bersabar menghadapi tindakan orang-orang kafir itu. Nabi saw juga diperintahkan untuk mengikuti jejak para rasul yang menyampaikan agama-Nya.\n\nKemudian Allah menyampaikan bahwa orang-orang kafir itu tidak segera menerima azab karena perbuatannya itu, karena azab itu ditangguhkan pelaksanaannya sampai kepada waktu yang ditentukan. Hal itu adalah sesuai dengan ketetapan-Nya bahwa Dia menangguhkan azab bagi orang-orang kafir sampai hari Kiamat. Seandainya tidak ada ketetapan yang demikian itu, tentu telah diputuskan Allah perselisihan mereka dengan orang-orang yang beriman.\n\nAllah berfirman:\n\nBahkan hari Kiamat itulah hari yang dijanjikan kepada mereka dan hari Kiamat itu lebih dahsyat dan lebih pahit. (al-Qamar/54: 46)\n\nDan firman Allah:\n\nDan janganlah engkau mengira, bahwa Allah lengah dari apa yang diperbuat oleh orang yang zalim. Sesungguhnya Allah menangguhkan mereka sampai hari yang pada waktu itu mata (mereka) terbelalak. (Ibrahim/14: 42)\n\nAllah menerangkan bahwa sebab-sebab kehancuran dan azab yang menimpa orang-orang musyrik adalah karena mereka sangat ragu-ragu dan bingung tentang Al-Qur'an. Karena bingung dan ragu, mereka mengingkarinya dan tidak mengindahkan dakwah Rasulullah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4264,
                    "inSurah": 46
                },
                "meta": {
                    "juz": 24,
                    "page": 481,
                    "manzil": 6,
                    "ruku": 418,
                    "hizbQuarter": 192,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مَّنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ ۖ وَمَنْ أَسَاءَ فَعَلَيْهَا ۗ وَمَا رَبُّكَ بِظَلَّامٍ لِّلْعَبِيدِ",
                    "transliteration": {
                        "en": "Man 'amila salihan falinafshihee wa man asaaa'a fa'alaihaa; wamaa rabbuka bizallaamil lil 'abeed"
                    }
                },
                "translation": {
                    "en": "Whoever does righteousness - it is for his [own] soul; and whoever does evil [does so] against it. And your Lord is not ever unjust to [His] servants.",
                    "id": "Barangsiapa mengerjakan kebajikan maka (pahalanya) untuk dirinya sendiri dan barangsiapa berbuat jahat maka (dosanya) menjadi tanggungan dirinya sendiri. Dan Tuhanmu sama sekali tidak menzalimi hamba-hamba(-Nya)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4264",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4264.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4264.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Oleh sebab itu, sadarilah apa yang telah diajarkan oleh Al-Qur’an itu bahwa barang siapa mengerjakan kebajikan maka pahalanya untuk dirinya sendiri, dan barang siapa berbuat jahat maka dosanya menjadi tanggungan dirinya sendiri, bukan dibebankan kepada orang lain. Dan Tuhanmu sama sekali tidak menzalimi hamba-hamba-Nya yang durhaka itu.",
                        "long": "Pada akhir ayat surah ini, Allah menerangkan balasan yang akan diberikan terhadap perbuatan-perbuatan yang dilakukan manusia. Barang siapa yang taat kepada Allah dan rasul-Nya dalam kehidupan dunia ini, melaksanakan perintah-perintah-Nya, dan menghentikan larangan-larangan-Nya, berarti ia telah berusaha berbuat kebaikan untuk dirinya sendiri dengan memperoleh pahala yang besar. Barang siapa yang ingkar kepada Allah berarti ia telah berusaha berbuat keburukan untuk dirinya dengan memperoleh siksa yang sangat pedih di akhirat nanti. Seseorang dihukum sesuai dengan perbuatan yang telah dilakukannya, mustahil Allah mengazab seseorang karena perbuatan orang lain.\n\nAllah berfirman:\n\nDan seseorang tidak akan memikul beban dosa orang lain. Kemudian kepada Tuhanmulah kamu kembali, dan akan diberitahukan-Nya kepadamu apa yang dahulu kamu perselisihkan. (al-An'am/6: 164)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4265,
                    "inSurah": 47
                },
                "meta": {
                    "juz": 25,
                    "page": 482,
                    "manzil": 6,
                    "ruku": 418,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ إِلَيْهِ يُرَدُّ عِلْمُ السَّاعَةِ ۚ وَمَا تَخْرُجُ مِن ثَمَرَاتٍ مِّنْ أَكْمَامِهَا وَمَا تَحْمِلُ مِنْ أُنثَىٰ وَلَا تَضَعُ إِلَّا بِعِلْمِهِ ۚ وَيَوْمَ يُنَادِيهِمْ أَيْنَ شُرَكَائِي قَالُوا آذَنَّاكَ مَا مِنَّا مِن شَهِيدٍ",
                    "transliteration": {
                        "en": "Ilaihi yuraddu 'ilmus Saaa'ah; wa maa takhruju min samaraatim min akmaamihaa wa maa tahmilu min unsaa wa laa tada'u illaa bi'ilmih; wa Yawma yunaadeehim aina shurakaaa'ee qaalooo aazannaaka maa minnaa min shaheed"
                    }
                },
                "translation": {
                    "en": "To him [alone] is attributed knowledge of the Hour. And fruits emerge not from their coverings nor does a female conceive or give birth except with His knowledge. And the Day He will call to them, \"Where are My 'partners'?\" they will say, \"We announce to You that there is [no longer] among us any witness [to that].\"",
                    "id": "Kepada-Nyalah ilmu tentang hari Kiamat itu dikembalikan. Tidak ada buah-buahan yang keluar dari kelopaknya dan tidak seorang perempuan pun yang mengandung dan yang melahirkan, melainkan semuanya dengan sepengetahuan-Nya. Pada hari ketika Dia (Allah) menyeru mereka, “Dimanakah sekutu-sekutu-Ku itu?” Mereka menjawab, “Kami nyatakan kepada Engkau bahwa tidak ada seorang pun di antara kami yang dapat memberi kesaksian (bahwa Engkau mempunyai sekutu).”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4265",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4265.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4265.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dalam ayat ini Allah menyatakan bahwa tidak seorang pun yang mampu mengetahui terjadinya Kiamat, hanya kepada-Nyalah ilmu tentang hari Kiamat itu dikembalikan. Hanya Dia Yang Maha Mengetahui kapan terjadinya dan perincian kejadiannya. Tidak ada buah-buahan yang keluar dari kelopaknya, dan tidak seorang perempuan pun yang mengandung dan yang melahirkan, melainkan semuanya dengan sepengetahuan-Nya. Dialah yang mengetahui secara pasti dan segala perinciannya. Pada hari Kiamat itu, Dia (Allah) menyeru mereka, yakni orang-orang musyrik, “Di manakah sekutu-sekutu-Ku itu, yaitu berhala-berhala yang di dunia dahulu kamu sembah dan kamu duga dapat menyelamatkanmu dari siksaan-Ku?” Mereka menjawab, “Kami nyatakan kepada Engkau bahwa tidak ada seorang pun di antara kami yang dapat menjadi saksi yang memberi kesaksian pada hari ini.”",
                        "long": "Pada ayat ini Allah menerangkan bahwa ilmu tentang hari Kiamat, waktu dan bagaimana peristiwanya hanya diketahui Allah. Demikian pula peristiwa-peristiwa gaib yang lain seperti keluarnya dengan baik atau rusaknya buah-buahan dari kelopaknya, dan janin yang dikandung oleh para ibu, apakah akan lahir dengan normal atau cacat anggota tubuhnya, semua itu hanya diketahui oleh Allah secara pasti. Beberapa hal memang ada yang diketahui oleh manusia seperti bulan apa buah-buahan akan masak, kapan kira-kira bayi akan lahir, tetapi pengetahuan itu masih sangat sederhana tidak serinci pengetahuan Allah dan tidak selengkap pernyataan-Nya.\n\nPada ayat lain Allah menegaskan bahwa hanya Dialah yang mengetahui dengan tepat hari Kiamat itu. Allah berfirman:\n\nMereka menanyakan kepadamu (Muhammad) tentang Kiamat, \"Kapan terjadi?\" Katakanlah, \"Sesungguhnya pengetahuan tentang Kiamat itu ada pada Tuhanku; tidak ada (seorang pun) yang dapat menjelaskan waktu terjadinya selain Dia.\" (al-A'raf/7: 187)\n\nNabi Muhammad saw sendiri dalam hadis yang diriwayatkan 'Umar bin al-Khaththab ketika ditanya Malaikat Jibril tentang kapan hari Kiamat, beliau menjawab:\n\nSesungguhnya Jibril bertanya kepada Rasulullah tentang hari Kiamat, Rasulullah menjawab: orang yang ditanya tidak lebih tahu daripada yang bertanya (Riwayat Muslim dari 'Umar bin al-Khaththab)\n\nDalam perkembangan ilmu pengetahuan sekarang ini memang banyak hal-hal baru yang diketahui manusia seperti waktu musim berbuahnya beberapa macam buah-buahan, kondisi tentang janin dalam kandungan seperti jenis kelamin, kesehatan, dan kapan waktu janin akan lahir. Tetapi pengetahuan manusia ini masih sedikit sekali dibanding pengetahuan Allah dan masih bersifat perkiraan sehingga tidak pasti. Berbeda dengan pengetahuan Allah yang rinci dan pasti. Firman Allah swt:\n\nAllah mengetahui apa yang dikandung oleh setiap perempuan, apa yang kurang sempurna dan apa yang bertambah dalam rahim. Dan segala sesuatu ada ukuran di sisi-Nya.(Allah) Yang mengetahui semua yang gaib dan yang nyata; Yang Mahabesar, Mahatinggi. (ar-Ra'd/13: 8-9)\n\nDi atas telah diterangkan bahwa hanya Allah yang mengetahui tentang hari Kiamat dan kapan terjadinya. Dia mengetahui semua wanita yang hamil dan yang melahirkan anak. Dari keterangan ini dapat dipahami bahwa pengetahuan Allah itu ada yang mustahil diketahui oleh manusia dan ada yang mungkin diketahuinya bila Dia memberikan izin-Nya kepada manusia. Tentu saja hal ini ada hikmah dan tujuannya, tetapi hanyalah Allah yang mengetahui dengan pasti hakikat dari hikmah dan tujuannya itu. Sekalipun manusia diberikan sebagian pengetahuan Allah, namun sifat dan bentuk pengetahuan itu tidak sama dan berbeda pada setiap orang.\n\nAllah mengetahui kandungan semua wanita yang sedang hamil dan yang melahirkan. Pengetahuan Allah tentang wanita yang mengandung dan yang melahirkan adalah pengetahuan yang lengkap dan pasti, menyeluruh sampai kepada yang sekecil-kecilnya. Pengetahuan itu ada hubungannya dengan proses kejadian alam seluruhnya, dari dahulu sampai sekarang dan sampai kepada masa yang akan datang.\n\nLain halnya dengan pengetahuan seorang dokter ahli kandungan terhadap kandungan seorang wanita. Ia hanya mengetahui secara umum saja, tidak secara rinci. Bahkan pengetahuannya itu terbatas dan bersifat dugaan semata, bukan pengetahuan yang pasti karena pengetahuan yang pasti dan menyeluruh itu hanya pada Allah.\n\nSelanjutnya Allah menerangkan peristiwa yang akan dialami oleh orang-orang musyrik pada hari Kiamat. Pada hari itu Allah akan menanyakan kepada mereka secara tegas dan jelas serta meminta pertanggungjawaban mereka tentang sekutu-sekutu-Nya yang mereka sembah di dunia; di mana mereka berada sekarang, mengapa mereka tidak bersama-sama dengan berhala-berhala itu. Akhirnya orang-orang musyrik itu menjawab dengan jawaban yang tegas, \"Wahai Tuhan kami, kami nyatakan kepada-Mu pada hari ini tidak seorang pun di antara kami yang mengakui bahwa Engkau mempunyai sekutu; hanya Engkau sajalah yang kami sembah, tidak ada yang lain.\"\n\nFirman Allah yang lain yang sama artinya dengan ayat ini:\n\nKemudian tidaklah ada jawaban bohong mereka, kecuali mengatakan, \"Demi Allah, ya Tuhan kami, tidaklah kami mempersekutukan Allah.\" (al-An'am/6: 23)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4266,
                    "inSurah": 48
                },
                "meta": {
                    "juz": 25,
                    "page": 482,
                    "manzil": 6,
                    "ruku": 418,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَضَلَّ عَنْهُم مَّا كَانُوا يَدْعُونَ مِن قَبْلُ ۖ وَظَنُّوا مَا لَهُم مِّن مَّحِيصٍ",
                    "transliteration": {
                        "en": "Wa dalla 'anhum maa kaanoo yad'oona min qablu wa zannoo maa lahum mim mahees"
                    }
                },
                "translation": {
                    "en": "And lost from them will be those they were invoking before, and they will be certain that they have no place of escape.",
                    "id": "Dan lenyaplah dari mereka apa yang dahulu selalu mereka sembah, dan mereka pun tahu bahwa tidak ada jalan keluar (dari azab Allah) bagi mereka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4266",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4266.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4266.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan dengan pernyataan mereka itu, lenyaplah dari hadapan mereka pada hari Kiamat itu apa yang di dunia dahulu selalu mereka sembah, dan mereka pun ketika itu juga tahu bahwa tidak ada jalan keluar bagi mereka yang dapat menghindarkan mereka dari azab Allah.",
                        "long": "Ayat ini menerangkan bahwa pada hari Kiamat orang-orang musyrik yang sesat itu tidak melihat adanya manfaat dari sembahan-sembahan yang mereka sembah di dunia dahulu, yaitu pada hari mereka merasakan tidak ada faedahnya semua yang telah mereka lakukan di dunia dahulu. Tidak ada seorang pun yang dapat menghindarkan mereka dari azab Allah. Ketika itu barulah mereka yakin akan keesaan dan kekuasaan Allah dan mereka juga yakin bahwa tidak ada satu jalan keluar pun untuk menghindarkan diri dari azab Allah itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4267,
                    "inSurah": 49
                },
                "meta": {
                    "juz": 25,
                    "page": 482,
                    "manzil": 6,
                    "ruku": 418,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَّا يَسْأَمُ الْإِنسَانُ مِن دُعَاءِ الْخَيْرِ وَإِن مَّسَّهُ الشَّرُّ فَيَئُوسٌ قَنُوطٌ",
                    "transliteration": {
                        "en": "Laa yas'amul insaanu min du'aaa'il khairi wa im massa hush sharru fa ya'oosun qanoot"
                    }
                },
                "translation": {
                    "en": "Man is not weary of supplication for good [things], but if evil touches him, he is hopeless and despairing.",
                    "id": "Manusia tidak jemu memohon kebaikan, dan jika ditimpa malapetaka, mereka berputus asa dan hilang harapannya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4267",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4267.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4267.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat-ayat yang lalu menggambarkan azab di akhirat yang diperoleh manusia yang menyekutukan Allah. Ayat-ayat berikut ini menggambarkan sifat-sifat buruk manusia ketika di dunia ini. Allah menyatakan bahwa manusia pada umumnya tidak jemu memohon kebaikan untuk mendapat kesenangan bagi kehidupan mereka di dunia ini, dan jika sesudah itu disentuh dan ditimpa malapetaka, walau sedikit, yang mengganggu kesenangan mereka, mereka berputus asa terhadap nikmat Allah dan hilang harapannya untuk dikabulkan doanya.",
                        "long": "Ayat ini menerangkan keinginan-keinginan manusia untuk mencapai hal-hal yang menyangkut kepentingan dirinya. Sebagian besar manusia adalah orang-orang yang tamak, suka mencari harta dan mencari kesenangan untuk dirinya sendiri.\n\nMereka menginginkan harta dan kekuasaan, karena menurut mereka dengan harta dan kekuasaan itu semua cita-cita dan keinginannya akan tercapai. Mereka ingin keturunan, karena dengan keturunan itu mereka dapat mewariskan semua harta yang mereka peroleh dan akan selalu ada orang yang mengenang jasa dan keberhasilan mereka selama hidup di dunia. Mereka ingin memperoleh harta benda dunia sebanyak-banyaknya, karena itu mereka berlomba-lomba mencapainya, seakan-akan hidup dan kehidupan mereka dihabiskan untuk itu.\n\nDalam ayat ini, yang selalu diinginkan dan dicari manusia itu disebut \"khair\" (kebaikan). Disebut \"khair\" karena yang diinginkan manusia itu adalah kebaikan yang merupakan rahmat dan karunia Allah. Rahmat dan karunia Allah itu mereka jadikan tujuan yang harus dicapai dalam hidup dan kehidupan mereka di dunia ini, bukan sebagai alat atau jalan yang dapat mereka pergunakan untuk mencapai sesuatu yang lebih mulia dan lebih tinggi nilainya, sehingga rahmat dan karunia Allah yang semula adalah baik, mereka jadikan sumber bencana dan malapetaka karena hawa nafsu mereka yang dapat menimpa diri mereka sendiri atau orang lain.\n\nYang dimaksud dengan \"mencari kebaikan\" dalam ayat ini ialah menginginkan, berusaha, mencari, menuntut dan menjadikan kebaikan itu sebagai alat dan jalan mencapai tujuan hidup di dunia dan akhirat, bukan untuk mencari kebaikan agar kebaikan itu dapat dijadikan alat dan jalan mencapai tujuan yang diinginkan hawa nafsu. Mencari kebaikan untuk memenuhi keinginan hawa nafsu dapat menimbulkan malapetaka bagi yang mencarinya. Tetapi, jika mencari kebaikan itu tujuannya agar kebaikan itu dapat dijadikan alat dan jalan untuk mencari keridaan Allah, maka mencari kebaikan yang demikian dianjurkan oleh agama Islam.\n\nMisalnya, seseorang berusaha mencari harta yang halal agar dengan harta itu ia dapat melaksanakan tugas dan kewajibannya sebagai hamba Allah, seperti memberi nafkah keluarganya, berinfak di jalan Allah, menolong fakir miskin, dan sebagainya. Demikian pula, orang yang ingin mencari pangkat dan kekuasaan, ia boleh mencarinya dengan maksud menegakkan keadilan, menegakkan hukum-hukum Allah, dan menolong orang-orang yang sengsara. Usaha yang demikian adalah usaha yang terpuji dan diridai Allah.\n\nJadi, mencari kebaikan itu pada hakikatnya baik jika kebaikan yang diperoleh itu dijadikan alat dan jalan untuk mencari keridaan Allah. Tetapi, mencari kebaikan itu akan merusak dirinya jika kebaikan itu digunakan untuk memenuhi hawa nafsusnya. \n\nSifat manusia yang lain ialah jika kebaikan yang dicarinya itu tidak diperolehnya atau mereka ditimpa suatu musibah, maka mereka menjadi putus asa, seakan-akan tidak ada harapan lagi bagi mereka, tidak ada lagi bumi tempat berpijak dan tidak ada lagi langit tempat berteduh, semua yang mereka inginkan itu seakan-akan sirna. Dalam keadaan yang demikian, mereka menjadi berputus asa dari rahmat Allah dan berprasangka buruk terhadap Allah seakan-akan Allah tidak mempunyai sifat kasih sayang dan bukan Maha Pemberi rahmat kepada hamba-hamba-Nya.\n\nSifat-sifat yang diterangkan oleh ayat ini adalah sifat-sifat orang yang tidak beriman dan tidak memurnikan ketaatan dan kepatuhannya kepada Allah. Mereka masih percaya kepada adanya kekuatan-kekuatan lain yang dapat menolong mereka selain dari kekuatan Allah. Seakan-akan mereka tidak percaya akan adanya rahmat dan karunia-Nya dan tidak percaya adanya kehidupan yang sebenarnya yaitu kehidupan akhirat nanti.\n\nAda pun orang-orang yang beriman kepada Allah, adalah orang-orang yang tunduk dan patuh kepada-Nya, merasakan keagungan dan kebesaran-Nya dan merasa dirinya bergantung kepada rahmat dan karunia-Nya. Mereka percaya akan adanya kehidupan yang hakiki yaitu kehidupan di akhirat, dan mereka percaya bahwa kehidupan dunia hanya bersifat sementara. Karenanya mereka berusaha dan bekerja semata-mata untuk mencari keridaan-Nya. Mereka juga percaya bahwa Allah selain menguji hamba-hamba-Nya yang beriman dan ujian itu selalu diberikan dalam bermacam-macam bentuk, ada yang berupa kesengsaraan dan penderitaan, dan ada pula yang berbentuk kesenangan dan kekayaan. Apa pun wujud ujian dan cobaan itu, dihadapinya dengan sabar dan tawakal. Jika mereka memperoleh kebaikan dan harta, ia bergembira dan bersyukur kepada-Nya dan jika ditimpa musibah, mereka tetap sabar dan tabah, bahkan semakin mendekatkan diri kepada-Nya. Mereka tetap mengharapkan rahmat dan karunia Allah karena benar-benar yakin akan sifat kasih sayang Allah yang melimpahkan rahmat dan karunia-Nya kepada setiap hamba yang beriman kepada-Nya. Allah swt berfirman:\n\nWahai anak-anakku! Pergilah kamu, carilah (berita) tentang Yusuf dan saudaranya dan jangan kamu berputus asa dari rahmat Allah. Sesungguhnya yang berputus asa dari rahmat Allah, hanyalah orang-orang yang kafir.\" (Yusuf/12: 87)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4268,
                    "inSurah": 50
                },
                "meta": {
                    "juz": 25,
                    "page": 482,
                    "manzil": 6,
                    "ruku": 418,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَئِنْ أَذَقْنَاهُ رَحْمَةً مِّنَّا مِن بَعْدِ ضَرَّاءَ مَسَّتْهُ لَيَقُولَنَّ هَٰذَا لِي وَمَا أَظُنُّ السَّاعَةَ قَائِمَةً وَلَئِن رُّجِعْتُ إِلَىٰ رَبِّي إِنَّ لِي عِندَهُ لَلْحُسْنَىٰ ۚ فَلَنُنَبِّئَنَّ الَّذِينَ كَفَرُوا بِمَا عَمِلُوا وَلَنُذِيقَنَّهُم مِّنْ عَذَابٍ غَلِيظٍ",
                    "transliteration": {
                        "en": "Wa la in azaqnaahu rahmatam minnaa mim ba'di dar raaa'a massat hu la yaqoolanna haazaa lee wa maaa azunnus Saa'ata qaaa'imatanw wa la'in ruji'tu ilaa Rabbeee inna lee 'indahoo lalhusnaa; falanu nabbi'annal lazeena kafaroo bimaa 'amiloo wa lanuzeeqan nahum min 'azaabin ghaleez"
                    }
                },
                "translation": {
                    "en": "And if We let him taste mercy from Us after an adversity which has touched him, he will surely say, \"This is [due] to me, and I do not think the Hour will occur; and [even] if I should be returned to my Lord, indeed, for me there will be with Him the best.\" But We will surely inform those who disbelieved about what they did, and We will surely make them taste a massive punishment.",
                    "id": "Dan jika Kami berikan kepadanya suatu rahmat dari Kami setelah ditimpa kesusahan, pastilah dia berkata, “Ini adalah hakku, dan aku tidak yakin bahwa hari Kiamat itu akan terjadi. Dan jika aku dikembalikan kepada Tuhanku, sesungguhnya aku akan memperoleh kebaikan di sisi-Nya.” Maka sungguh, akan Kami beritahukan kepada orang-orang kafir tentang apa yang telah mereka kerjakan, dan sungguh, akan Kami timpakan kepada mereka azab yang berat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4268",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4268.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4268.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sifat buruk manusia yang lain adalah jika Kami berikan kepada-nya suatu rahmat atau hal-hal yang menyenangkan mereka dari Kami setelah ditimpa kesusahan sebelumnya, pastilah dengan bangga dia berkata, “Ini adalah hakku yang aku dapatkan dari usahaku, dan aku tidak menduga atau yakin bahwa hari Kiamat itu akan terjadi. Dan jika hari Kiamat itu pun akan terjadi dan aku dikembalikan kepada Tuhanku untuk mempertanggungjawabkan segala amalku, sesungguhnya aku pasti akan memperoleh bagian yang sangat baik di sisi-Nya.” Apa yang mereka katakan itu tidak akan pernah didapatkannya, bahkan sebaliknya. Maka sungguh di hari akhirat nanti, akan Kami beritahukan kepada mereka orang-orang kafir tentang apa yang telah mereka kerjakan di dunia, dan sungguh, akan Kami timpakan kepada mereka azab yang berat akibat kekafiran dan kedurhakaan mereka.",
                        "long": "Pada ayat ini Allah menerangkan sifat-sifat kebanyakan manusia, yaitu jika mereka mendapat nikmat dan kesenangan mereka menjadi lupa dan sombong sehingga menyatakan, \"Ini adalah hasil kerjaku sendiri, sehingga aku tidak perlu memberikan sebagian hartaku ini kepada orang lain, dan tidak perlu bersyukur kepada siapapun. Aku juga tidak yakin apakah hari Kiamat itu akan datang?\"\n\nSelanjutnya orang-orang kafir itu juga menyatakan jika aku akan dikembalikan kepada Allah maka aku pasti akan memperoleh kebaikan pula pada sisinya. Demikian cara berfikir mereka yang tidak jelas dan hanya berdasarkan perkiraan-perkiraan saja. Maka ayat ini diakhiri dengan ketegasan bahwa Allah benar-benar akan memberitakan kepada orang-orang kafir apa yang mereka lakukan di dunia dan akan menimpakan azab yang pedih kepada mereka di akhirat.\n\nAdapun sifat-sifat orang yang putus asa dari rahmat Allah yaitu sebagai berikut:\n\n1. Jika kesengsaraan dan kesulitan yang sedang mereka derita tiba-tiba dihilangkan dari mereka, kemudian mereka dianugerahi rahmat dan karunia, mereka lupa kepada kesengsaraan dan penderitaan yang pernah mereka alami, mereka lupa kepada sumber rahmat dan karunia yang mereka terima itu, bahkan mereka mengatakan bahwa semua yang mereka peroleh itu semata-mata karena hasil usaha dan kepandaian mereka sendiri, bukan karena anugerah Allah. Yang dimaksud dengan perkataan hadha li dalam ayat ini ialah: Ini aku peroleh karena hasil usaha dan kepandaianku sendiri, karena itu semua yang aku peroleh benar-benar milikku dan tidak seorang pun yang bersamaku dalam kepemilikan ini. Karena itu, aku tidak perlu membagikannya kepada orang lain dan tidak perlu memanjatkan puja dan puji kepada Allah dan mengingat akan karunia dan kebaikan-Nya.\n\n2. Mereka tidak percaya adanya hari Kiamat. Ketidakpercayaan ini timbul karena sifat angkuh dan takabur yang ada pada diri mereka dan karena kesenangan hidup di dunia yang sedang mereka nikmati.\n\n3. Mereka mengatakan tidak ada hisab, tidak ada hari pembalasan. Menurut mereka jika mereka dikembalikan kepada Allah nanti, tentu mereka akan memperoleh kebaikan dan kesenangan yang banyak pula.\n\nPada akhir ayat ini Allah mengancam orang-orang kafir yang tidak percaya akan hari Kiamat, hari pembalasan, dan adanya surga dan neraka. Allah menegaskan bahwa orang-orang kafir itu benar-benar akan mengalami hari Kiamat. Mereka akan menyaksikan sendiri perbuatan-perbuatan jahat yang pernah mereka kerjakan. Kemudian Allah menimbang semua yang pernah mereka perbuat dan memberikan balasan yang setimpal bagi perbuatan jahat yang telah mereka kerjakan itu dengan azab yang berat di dalam neraka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4269,
                    "inSurah": 51
                },
                "meta": {
                    "juz": 25,
                    "page": 482,
                    "manzil": 6,
                    "ruku": 418,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِذَا أَنْعَمْنَا عَلَى الْإِنسَانِ أَعْرَضَ وَنَأَىٰ بِجَانِبِهِ وَإِذَا مَسَّهُ الشَّرُّ فَذُو دُعَاءٍ عَرِيضٍ",
                    "transliteration": {
                        "en": "Wa izaaa an'amnaa 'alal insaani a'rada wa na-aa bijaani bihee wa izaa massahush sharru fazoo du'aaa'in 'areed"
                    }
                },
                "translation": {
                    "en": "And when We bestow favor upon man, he turns away and distances himself; but when evil touches him, then he is full of extensive supplication.",
                    "id": "Dan apabila Kami berikan nikmat kepada manusia, dia berpaling dan menjauhkan diri (dengan sombong); tetapi apabila ditimpa malapetaka maka dia banyak berdoa."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4269",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4269.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4269.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan demikian pula halnya apabila Kami berikan nikmat dan berbagai kebajikan kepada manusia, dia berpaling dari Kami dengan mengingkari nikmat-nikmat itu dan menjauhkan diri dari ajaran-ajaran Kami dengan sombong. Akan tetapi, apabila ditimpa malapetaka sebagai peringatan atas keingkaran dan kesombongan mereka, maka dia banyak berdoa dengan doa yang panjang.",
                        "long": "Ayat ini menerangkan bahwa sifat tidak baik manusia yang lain ialah, jika mereka diberi rahmat dan karunia, mereka asyik dengan rahmat dan karunia itu, mereka terlalu senang dan bahagia sehingga mereka lupa akan sumber rahmat dan karunia itu. Bahkan kadang-kadang mereka bertindak lebih jauh dari itu. Mereka menggunakan rahmat dan karunia itu untuk menantang dan menghancurkan agama Allah: mereka membuat kerusakan di bumi, memutuskan silaturrahim dengan manusia yang lain yang diperintahkan Allah untuk menghubungkannya. Mereka merasa telah menjadi orang yang berkuasa sehingga orang lain yang berada di bawah kekuasaannya wajib hormat dan mengabdi kepadanya. Mereka telah lupa bahwa mereka adalah manusia yang harus bertindak sesuai dengan kodratnya, yaitu hanya dapat hidup dengan pertolongan manusia yang lain serta pertolongan Yang Maha Menolong yaitu Allah.\n\nSebaliknya, jika mereka ditimpa musibah atau malapetaka, mereka kembali mengingat Allah. Mereka berdoa kepada Allah dalam keadaan berbaring, duduk, berdiri, berjalan, dan dalam keadaan bagaimana pun. Bahkan mereka berjanji dan bersumpah dengan menyebut nama-Nya jika mereka dihindarkan dari musibah dan malapetaka itu, mereka menjadi orang-orang yang beriman. Sejalan dengan ayat ini, firman Allah:\n\nDan apabila manusia ditimpa bahaya dia berdoa kepada Kami dalam keadaan berbaring, duduk atau berdiri, tetapi setelah Kami hilangkan bahaya itu darinya, dia kembali (ke jalan yang sesat), seolah-olah dia tidak pernah berdoa kepada Kami untuk (menghilangkan) bahaya yang telah menimpanya. Demikianlah dijadikan terasa indah bagi orang-orang yang melampaui batas apa yang mereka kerjakan. (Yunus/10: 12)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4270,
                    "inSurah": 52
                },
                "meta": {
                    "juz": 25,
                    "page": 482,
                    "manzil": 6,
                    "ruku": 418,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قُلْ أَرَأَيْتُمْ إِن كَانَ مِنْ عِندِ اللَّهِ ثُمَّ كَفَرْتُم بِهِ مَنْ أَضَلُّ مِمَّنْ هُوَ فِي شِقَاقٍ بَعِيدٍ",
                    "transliteration": {
                        "en": "Qul araiaitum in kaana min 'indil laahi summa kafar tum bihee man adallu mimman huwa fee shiqaqim ba'eed"
                    }
                },
                "translation": {
                    "en": "Say, \"Have you considered: if the Qur'an is from Allah and you disbelieved in it, who would be more astray than one who is in extreme dissension?\"",
                    "id": "Katakanlah, “Bagaimana pendapatmu jika (Al-Qur'an) itu datang dari sisi Allah, kemudian kamu mengingkarinya. Siapakah yang lebih sesat daripada orang yang selalu berada dalam penyimpangan yang jauh (dari kebenaran)?”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4270",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4270.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4270.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat ini menggambarkan kesesatan orang-orang yang mengingkari Al-Qur’an. Katakanlah kepada mereka, wahai Nabi Muhammad, “Bagaimana pendapatmu jika dia, yakni Al-Qur’an, yang kamu tolak tuntunannya dan keberadaannya itu benar-benar datang dari sisi Allah, kemudian kamu mengingkarinya. Jika demikian halnya, maka siapakah yang lebih sesat daripada orang yang selalu berada dalam penyimpangan yang jauh dari kebenaran seperti keadaan kamu?” Pastilah tidak ada yang lebih sesat.",
                        "long": "Ayat ini menerangkan bahwa sebenarnya orang-orang musyrik itu dalam keadaan ragu-ragu terhadap kebenaran Al-Qur'an dan terhadap Muhammad saw sebagai utusan Allah. Keadaan mereka antara membenarkan dan mengingkari. Mereka mengakui Muhammad saw sebagai seorang terpercaya serta disegani dan pemimpin yang dapat menyelesaikan persoalan-persoalan yang timbul di kalangan suku Quraisy. Demikian pula, mereka mengagumi isi dan ketinggian gaya bahasa Al-Qur'an yang menurut mereka mustahil bagi seorang manusia dapat membuatnya. Tetapi, mereka masih dipengaruhi oleh kepercayaan nenek moyang mereka di samping khawatir akan timbulnya sikap antipati dari kaum mereka sendiri. Jika mereka menyatakan apa yang terkandung dalam hati mereka, tentu mereka tidak lagi dijadikan pemimpin oleh kaumnya; mereka akan kehilangan pengaruh. Sikap ragu-ragu inilah yang selalu berkecamuk dalam pikiran mereka.\n\nDalam keadaan yang demikian itulah, Allah memerintahkan Rasul-Nya menanyakan kepada orang-orang musyrik yang sesat itu. \"Wahai orang-orang musyrik, bagaimana pendapatmu seandainya Al-Qur'an itu benar-benar dari Allah, sedangkan kamu mengingkari kebenarannya? Jika demikian halnya, tentulah kamu semua termasuk orang-orang yang sesat dan menjauhkan diri dari kebenaran?\" Seakan-akan dengan pertanyaan itu Allah menyatakan dengan tegas bahwa sikap ragu-ragu itulah nanti yang akan membawa mereka ke dalam lembah kesesatan dan penyesalan yang tidak habis-habisnya di akhirat nanti."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4271,
                    "inSurah": 53
                },
                "meta": {
                    "juz": 25,
                    "page": 482,
                    "manzil": 6,
                    "ruku": 418,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "سَنُرِيهِمْ آيَاتِنَا فِي الْآفَاقِ وَفِي أَنفُسِهِمْ حَتَّىٰ يَتَبَيَّنَ لَهُمْ أَنَّهُ الْحَقُّ ۗ أَوَلَمْ يَكْفِ بِرَبِّكَ أَنَّهُ عَلَىٰ كُلِّ شَيْءٍ شَهِيدٌ",
                    "transliteration": {
                        "en": "Sanureehim Aayaatinaa fil aafaaqi wa feee anfusihim hattaa yatabaiyana lahum annahul haqq; awa lam yakfi bi Rabbika annahoo 'alaa kulli shai-in Shaheed"
                    }
                },
                "translation": {
                    "en": "We will show them Our signs in the horizons and within themselves until it becomes clear to them that it is the truth. But is it not sufficient concerning your Lord that He is, over all things, a Witness?",
                    "id": "Kami akan memperlihatkan kepada mereka tanda-tanda (kebesaran) Kami di segenap penjuru dan pada diri mereka sendiri, sehingga jelaslah bagi mereka bahwa Al-Qur'an itu adalah benar. Tidak cukupkah (bagi kamu) bahwa Tuhanmu menjadi saksi atas segala sesuatu?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4271",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4271.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4271.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Untuk mendukung kebenaran Al-Qur’an, Kami juga akan memperlihatkan kepada mereka tanda-tanda kebesaran Kami di segenap penjuru yang dapat mereka saksikan di luar diri mereka dan apa saja yang ada pada diri mereka sendiri yang dapat mereka rasakan, sehingga jelaslah bagi mereka bahwa Al-Qur’an itu adalah benar datang dari Allah. Tidak cukupkah bagi kamu, wahai Nabi Muhammad, bahwa Tuhanmu menjadi saksi atas segala sesuatu?",
                        "long": "Ayat ini menerangkan bahwa orang-orang musyrik yang ragu-ragu kepada Al-Qur'an dan Rasulullah itu akan melihat dengan mata kepala mereka bukti-bukti kebenaran ayat-ayat Allah di segenap penjuru dunia dan pada diri mereka sendiri. Mereka melihat dan menyaksikan sendiri kaum Muslimin dalam keadaan lemah dan tertindas selama berada di Mekah kemudian Rasulullah dan para sahabatnya hijrah ke Medinah meninggalkan kampung halaman yang mereka cintai. Rasulullah saw selama di Medinah bersama kaum Muhajirin dan Ansar membentuk dan membina masyarakat Islam. Masyarakat baru itu semakin lama semakin kuat dan berkembang. Hal ini dirasakan oleh orang-orang musyrik di Mekah, karena itu mereka pun selalu berusaha agar kekuatan baru itu dapat segera dipatahkan. Kekuatan Islam dan kaum Muslimin pertama kali dirasakan oleh orang musyrik Mekah adalah ketika Perang Badar dan kemudian ketika mereka dicerai-beraikan dalam Perang Khandak. Yang terakhir ialah di waktu Rasulullah saw dan kaum Muslimin menaklukkan kota Mekah tanpa perlawanan dari orang-orang musyrik. Akhirnya mereka menyaksikan manusia berbondong-bondong masuk Islam, termasuk orang-orang musyrik, keluarga, dan teman mereka sendiri. Semuanya itu merupakan bukti-bukti kebenaran ayat-ayat Allah. Allah berfirman:\n\nApabila telah datang pertolongan Allah dan kemenangan,dan engkau melihat manusia berbondong-bondong masuk agama Allah, maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampunan kepada-Nya. Sungguh, Dia Maha Penerima tobat. (an-Nasr/110: 1-3)\n\nPada akhir ayat ini, Allah menegaskan lagi bahwa Dia menyaksikan segala perilaku hamba-hamba-Nya, baik berupa perkataan, perbuatan atau tingkah laku, dan Dia Maha Mengetahui segala isi hati manusia. Dia menyatakan bahwa Muhammad saw adalah seorang yang benar, tidak pernah berbohong, semua yang disampaikannya sungguh benar, Allah berfirman:\n\nTetapi Allah menjadi saksi atas (Al-Qur'an) yang diturunkan-Nya kepadamu (Muhammad). Dia menurunkannya dengan ilmu-Nya. (an-Nisa'/4: 166)\n\nBanyak orang mengatakan bahwa dengan mempelajari alam, termasuk diri kita sendiri, dapat membawa kepada pemahaman tentang adanya Tuhan. Alam adalah buku yang menanti untuk dipelajari. Akan tetapi, harapan Tuhan dalam menurunkan ayat di atas tidak selalu dipahami manusia. Surah Yunus/10: 101 adalah salah satu di antara banyak ayat yang memberitahu kita bahwa hanya ilmuwan yang memiliki keimananlah yang dapat memahami Tuhan dengan mempelajari alam.\n\nKatakanlah, \"Perhatikanlah apa yang ada di langit dan di bumi!\" Tidaklah bermanfaat tanda-tanda (kebesaran Allah) dan rasul-rasul yang memberi peringatan bagi orang yang tidak beriman. (Yunus/10: 101)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4272,
                    "inSurah": 54
                },
                "meta": {
                    "juz": 25,
                    "page": 482,
                    "manzil": 6,
                    "ruku": 418,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَلَا إِنَّهُمْ فِي مِرْيَةٍ مِّن لِّقَاءِ رَبِّهِمْ ۗ أَلَا إِنَّهُ بِكُلِّ شَيْءٍ مُّحِيطٌ",
                    "transliteration": {
                        "en": "Alaaa innahum fee miryatim mil liqaaa'i Rabbihim; alaaa innahoo bikulli shai'im muheet"
                    }
                },
                "translation": {
                    "en": "Unquestionably, they are in doubt about the meeting with their Lord. Unquestionably He is, of all things, encompassing.",
                    "id": "Ingatlah, sesungguhnya mereka dalam keraguan tentang pertemuan dengan Tuhan mereka. Ingatlah, sesungguhnya Dia Maha Meliputi segala sesuatu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4272",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4272.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4272.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah lalu mengingatkan Nabi Muhammad dengan menyatakan, “Ingatlah, sesungguhnya mereka dalam keraguan, yakni tidak meyakini tentang pertemuan dengan Tuhan mereka kelak di hari Kiamat. Ingatlah pula, sesungguhnya Dia Maha Meliputi segala sesuatu dengan ilmu dan kekuasaan-Nya.”",
                        "long": "Ayat ini menerangkan keragu-raguan mereka tentang adanya hari kebangkitan dan hari pembalasan, karena menurut mereka, mustahil orang yang telah mati dapat hidup kembali dan mustahil pula tubuh-tubuh yang telah hancur-luluh bersama tanah itu dapat dikumpulkan, dikembalikan seperti semula dan dapat hidup kembali. Karena keragu-raguan itulah mereka menjadi tidak mampu memperhatikan kebenaran Al-Qur'an dan kerasulan Muhammad saw.\n\nPada akhir ayat ini Allah memperingatkan orang-orang musyrik dengan peringatan yang keras bahwa Dia Maha Mengetahui segala sesautu. Tidak ada satu pun yang luput dari pengetahuan-Nya. Karena itu Dia akan memberikan balasan dengan seadil-adilnya kepada hamba-hamba-Nya."
                    }
                }
            }
        ]
    }
}