{
    "code": 200,
    "status": "OK.",
    "message": "Success fetching surah.",
    "data": {
        "number": 42,
        "sequence": 62,
        "numberOfVerses": 53,
        "name": {
            "short": "الشورى",
            "long": "سورة الشورى",
            "transliteration": {
                "en": "Ash-Shura",
                "id": "Asy-Syura"
            },
            "translation": {
                "en": "Consultation",
                "id": "Musyawarah"
            }
        },
        "revelation": {
            "arab": "مكة",
            "en": "Meccan",
            "id": "Makkiyyah"
        },
        "tafsir": {
            "id": "Surat Asy Syuura terdiri atas 53 ayat, termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Fushshilat. Dinamai dengan Asy Syuura (musyawarat) diambil dari perkataan Syuura yang terdapat pada ayat 38 surat ini. Dalam ayat tersebut diletakkan salah satu dari dasar-dasar pemerintahan Islam ialah musyawarat. Dinamai juga Haa Miim 'Ain Siin Qaaf karena surat ini dimulai dengan huruf-huruf hijaiyah itu."
        },
        "preBismillah": {
            "text": {
                "arab": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
                "transliteration": {
                    "en": "Bismillaahir Rahmaanir Raheem"
                }
            },
            "translation": {
                "en": "In the name of Allah, the Entirely Merciful, the Especially Merciful.",
                "id": "Dengan nama Allah Yang Maha Pengasih, Maha Penyayang."
            },
            "audio": {
                "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1",
                "secondary": [
                    "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1.mp3",
                    "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1.mp3"
                ]
            }
        },
        "verses": [
            {
                "number": {
                    "inQuran": 4273,
                    "inSurah": 1
                },
                "meta": {
                    "juz": 25,
                    "page": 483,
                    "manzil": 6,
                    "ruku": 419,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "حم",
                    "transliteration": {
                        "en": "Haa Meeem"
                    }
                },
                "translation": {
                    "en": "Ha, Meem.",
                    "id": "Ha Mim"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4273",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4273.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4273.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Hanya Allah yang lebih tahu tentang makna Hà Mìm",
                        "long": "Kedua ayat ini terdiri dari huruf-huruf hijaiah, sebagaimana terdapat pada permulaan beberapa surah Al-Qur'an. Para ahli tafsir berbeda pendapat tentang maksud huruf-huruf itu. Selanjutnya dipersilakan menelaah masalah ini pada \"Al-Qur'an dan Tafsirnya\" jilid I yaitu tafsir ayat pertama Surah al-Baqarah.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4274,
                    "inSurah": 2
                },
                "meta": {
                    "juz": 25,
                    "page": 483,
                    "manzil": 6,
                    "ruku": 419,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "عسق",
                    "transliteration": {
                        "en": "'Ayyyn Seeen Qaaaf"
                    }
                },
                "translation": {
                    "en": "'Ayn, Seen, Qaf.",
                    "id": "Ain Sin Qaf"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4274",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4274.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4274.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Hanya Allah pula yang lebih tahu tentang makna ‘Aìn Sìn Qàf",
                        "long": "Kedua ayat ini terdiri dari huruf-huruf hijaiah, sebagaimana terdapat pada permulaan beberapa surah Al-Qur'an. Para ahli tafsir berbeda pendapat tentang maksud huruf-huruf itu. Selanjutnya dipersilakan menelaah masalah ini pada \"Al-Qur'an dan Tafsirnya\" jilid I yaitu tafsir ayat pertama Surah al-Baqarah.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4275,
                    "inSurah": 3
                },
                "meta": {
                    "juz": 25,
                    "page": 483,
                    "manzil": 6,
                    "ruku": 419,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "كَذَٰلِكَ يُوحِي إِلَيْكَ وَإِلَى الَّذِينَ مِن قَبْلِكَ اللَّهُ الْعَزِيزُ الْحَكِيمُ",
                    "transliteration": {
                        "en": "Kazaalika yooheee ilaika wa ilal lazeena min qablikal laahul 'Azeezul Hakeem"
                    }
                },
                "translation": {
                    "en": "Thus has He revealed to you, [O Muhammad], and to those before you - Allah, the Exalted in Might, the Wise.",
                    "id": "Demikianlah Allah Yang Mahaperkasa, Mahabijaksana mewahyukan kepadamu (Muhammad) dan kepada orang-orang yang sebelummu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4275",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4275.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4275.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Demikianlah Allah Yang Mahaperkasa dalam menyampaikan kehendak-Nya, dan Mahabijaksana dalam keputusan-Nya, mewahyukan pesan-pesan-Nya kepadamu, wahai Nabi Muhammad, dan kepada orang-orang, yakni para rasul, yang diutus sebelummu.",
                        "long": "Pada ayat ini, Allah Yang Mahaperkasa lagi Mahabijaksana menjelaskan bahwa apa yang diwahyukan kepada Nabi Muhammad saw antara lain supaya ia berdakwah mengenai tauhid mengesakan Allah, juga mengenai kenabian, beriman kepada hari akhir, memperbaiki diri dengan akhlak karimah dan menjauhkannya dari hal-hal yang rendah dan hina, beramal untuk kebahagiaan pribadi dan masyarakat semuanya itu, hal ini telah diwahyukan pula kepada nabi-nabi sebelumnya. Firman Allah: \n\nDan Kami tidak mengutus seorang rasul pun sebelum engkau (Muhammad), melainkan Kami wahyukan kepadanya, bahwa tidak ada tuhan (yang berhak disembah) selain Aku, maka sembahlah Aku. (al-Anbiya'/21: 25)\n\nDalam ayat lain Allah berfirman:\n\nSesungguhnya Kami mewahyukan kepadamu (Muhammad) sebagaimana Kami telah mewahyukan kepada Nuh dan nabi-nabi setelahnya, dan Kami telah mewahyukan (pula) kepada Ibrahim, Ismail, Ishak, Yakub dan anak cucunya; Isa, Ayyub, Yunus, Harun dan Sulaiman. Dan Kami telah memberikan Kitab Zabur kepada Daud. (an-Nisa'/4: 163)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4276,
                    "inSurah": 4
                },
                "meta": {
                    "juz": 25,
                    "page": 483,
                    "manzil": 6,
                    "ruku": 419,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۖ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
                    "transliteration": {
                        "en": "Lahoo maa fis samaa waati wa maa fil ardi wa Huwal 'Aliyul 'Azeem"
                    }
                },
                "translation": {
                    "en": "To Him belongs whatever is in the heavens and whatever is in the earth, and He is the Most High, the Most Great.",
                    "id": "Milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Dan Dialah Yang Mahaagung, Mahabesar."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4276",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4276.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4276.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Menjadi milik-Nya lah, dan di bawah kekuasaan, pengaturan, dan kewenangan-Nya lah segala apa yang ada di langit dan apa yang ada di bumi. Dan Dia lah, Yang Mahaagung dalam kedudukan-Nya, Mahabesar dalam kekuasaan-Nya.",
                        "long": "Pada ayat ini Allah menerangkan bahwa Dia-lah yang menguasai dan memiliki semua yang ada di langit dan semua yang ada di bumi. Ini menunjukkan kekuasaan-Nya yang tidak terbatas. Dia bisa saja berbuat sekehendaknya sesuai dengan iradat-Nya. Semua yang ada, harus tunduk kepada-Nya. Dia-lah yang mengatur segala yang ada, Dia Mahatinggi, tiada suatu kerajaan atau kekuasaan yang lebih tinggi daripada-Nya. Dia Mahabesar. \n\nKepunyaan-Nyalah apa yang ada di langit dan apa yang ada di bumi, ciptaan dan pemilikan Allah tanpa terbatas pada makhluk-Nya. Dia Mahaagung akan segala urusan, hukum, dan pemeliharaan-Nya. Mahasuci Allah, tiada Tuhan selain Dia."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4277,
                    "inSurah": 5
                },
                "meta": {
                    "juz": 25,
                    "page": 483,
                    "manzil": 6,
                    "ruku": 419,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "تَكَادُ السَّمَاوَاتُ يَتَفَطَّرْنَ مِن فَوْقِهِنَّ ۚ وَالْمَلَائِكَةُ يُسَبِّحُونَ بِحَمْدِ رَبِّهِمْ وَيَسْتَغْفِرُونَ لِمَن فِي الْأَرْضِ ۗ أَلَا إِنَّ اللَّهَ هُوَ الْغَفُورُ الرَّحِيمُ",
                    "transliteration": {
                        "en": "Takaadus samaawaatu yatafattarna min fawqihinn; walmalaaa'ikatu yusabbihoona bihamdi Rabbihim wa yastaghfiroona liman fil ard; alaaa innal laaha huwal Ghafoorur Raheem"
                    }
                },
                "translation": {
                    "en": "The heavens almost break from above them, and the angels exalt [Allah] with praise of their Lord and ask forgiveness for those on earth. Unquestionably, it is Allah who is the Forgiving, the Merciful.",
                    "id": "Hampir saja langit itu pecah dari sebelah atasnya (karena kebesaran Allah) dan malaikat-malaikat bertasbih memuji Tuhannya dan memohonkan ampunan untuk orang yang ada di bumi. Ingatlah, sesungguhnya Allah Dialah Yang Maha Pengampun, Maha Penyayang."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4277",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4277.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4277.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Hampir saja Langit-langit yang menjadi milik-Nya itu, yang telah diciptakan-Nya dengan sangat kuat dan kukuh, pecah dari sebelah atas-nya karena kebesaran dan keagungan Allah. Dan malaikat-malaikat di mana pun berada selalu bertasbih menyucikan-Nya dari segala kekurangan dengan memuji keagungan dan kebesaran Tuhan-nya dan memohonkan ampunan untuk orang-orang beriman yang ada di bumi atas dosa-dosa mereka. Ingatlah, sesungguhnya Allah Dialah Yang Maha Pengampun dengan mengampuni dosa hamba-hamba-Nya, Maha Penyayang dengan memberikan rahmat-Nya kepada mereka.",
                        "long": "Dalam ayat ini, Allah menerangkan bahwa karena kemahabesaran dan kemahatinggian serta kehebatan-Nya, maka hampir saja langit retak, pecah berantakan, dan berguguran. Para malaikat senantiasa bertasbih menyucikan Allah dari segala sifat kekurangan, memuji dan mensyukuri-Nya atas segala nikmat yang telah diberikan kepada mereka, taat dan patuh kepada perintah-Nya, tak pernah berbuat maksiat dan durhaka kepada-Nya, sebagaimana firman Allah:\n\nMereka (malaikat-malaikat) bertasbih tidak henti-hentinya malam dan siang. (al-Anbiya'/21: 20)\n\nDan firman-Nya:\n\nYang tidak durhaka kepada Allah terhadap apa yang Dia perintahkan kepada mereka dan selalu mengerjakan apa yang diperintahkan. (at-Tahrim/66: 6)\n\nPara malaikat juga selalu memohon kepada Allah supaya mengampuni dosa orang-orang yang beriman di atas bumi ini, dan mengilhami mereka sehingga mereka itu senantiasa melalui jalan-jalan kebaikan yang membawa kepada kebahagiaan.\n\nMalaikat itu diumpamakan laksana cahaya yang memberi kehidupan dengan panas yang ada padanya, dan memberi petunjuk dengan cahayanya.\n\nSejalan dengan apa yang tersebut di atas firman Allah:\n\n(Malaikat-malaikat) yang memikul 'Arsy dan (malaikat) yang berada di sekelilingnya bertasbih dengan memuji Tuhannya dan mereka beriman kepada-Nya serta memohonkan ampunan untuk orang-orang yang beriman (seraya berkata), \"Ya Tuhan kami, rahmat dan ilmu yang ada pada-Mu meliputi segala sesuatu, maka berilah ampunan kepada orang-orang yang bertobat dan mengikuti jalan (agama)-Mu dan peliharalah mereka dari azab neraka yang menyala-nyala. (Gafir/40: 7)\n\nAyat kelima ini menegaskan bahwa Allah itu Maha Pengampun, mengampuni dosa setiap orang yang kembali dan tobat kepada-Nya dengan tobat nasuha. Setiap makhluk berhak memperoleh rahmat dan kasih sayang daripada-Nya. Ditunda dan ditangguhkannya azab dan siksaan terhadap orang-orang kafir dan orang-orang yang durhaka, adalah satu rahmat dan tanda kasih sayang-Nya terhadap mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4278,
                    "inSurah": 6
                },
                "meta": {
                    "juz": 25,
                    "page": 483,
                    "manzil": 6,
                    "ruku": 419,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِينَ اتَّخَذُوا مِن دُونِهِ أَوْلِيَاءَ اللَّهُ حَفِيظٌ عَلَيْهِمْ وَمَا أَنتَ عَلَيْهِم بِوَكِيلٍ",
                    "transliteration": {
                        "en": "Wallazeenat takhazoo min dooniheee awliyaaa'al laahu hafeezun 'alaihim wa maaa anta 'alaihim biwakeel"
                    }
                },
                "translation": {
                    "en": "And those who take as allies other than Him - Allah is [yet] Guardian over them; and you, [O Muhammad], are not over them a manager.",
                    "id": "Dan orang-orang yang mengambil pelindung-pelindung selain Allah, Allah mengawasi (perbuatan) mereka; adapun engkau (Muhammad) bukanlah orang yang diserahi mengawasi mereka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4278",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4278.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4278.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan orang-orang yang menentang tuntunan-Nya dan menyekutukan-Nya dengan mengambil pelindung-pelindung dan menyembah sesuatu selain Allah, Allah mengawasi dan memperhatikan segala amal dan perbuatan mereka. Adapun engkau, wahai Muhammad, bukanlah orang yang diserahi tanggung jawab untuk mengawasi mereka dan tidak pula mempertanggungjawabkan amal mereka. Tugas engkau hanya menyampaikan kebenaran kepada mereka.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa orang-orang yang menyekutukan Allah dan mengambil pelindung-pelindung selain Dia, Allah sendirilah yang mengawasi amal perbuatan mereka, dan Dia pulalah yang akan memberi balasan yang setimpal di akhirat nanti atas segala perbuatan mereka di dunia. Muhammad saw tidak dibebani dan tidak ditugasi mengawasi perbuatan mereka. Ia hanya ditugasi menyampaikan apa yang diperintahkan Allah kepadanya, sebagaimana firman-Nya:\n\nMaka sesungguhnya tugasmu hanya menyampaikan saja, dan Kamilah yang memperhitungkan (amal mereka). (ar-Ra'd/13: 40)\n\nOleh karena itu, dia tidak perlu gusar dan merasa sesak dada kalau mereka itu masih tetap ingkar dan tidak mau beriman, karena bagaimana pun juga dia tidak memaksa mereka untuk beriman dan memperoleh hidayat, kecuali hal itu dikehendaki Allah sebagaimana firman-Nya:\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allah-lah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah/2: 272)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4279,
                    "inSurah": 7
                },
                "meta": {
                    "juz": 25,
                    "page": 483,
                    "manzil": 6,
                    "ruku": 419,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَكَذَٰلِكَ أَوْحَيْنَا إِلَيْكَ قُرْآنًا عَرَبِيًّا لِّتُنذِرَ أُمَّ الْقُرَىٰ وَمَنْ حَوْلَهَا وَتُنذِرَ يَوْمَ الْجَمْعِ لَا رَيْبَ فِيهِ ۚ فَرِيقٌ فِي الْجَنَّةِ وَفَرِيقٌ فِي السَّعِيرِ",
                    "transliteration": {
                        "en": "Wa kazaalika awhainaaa llaika Qur-aanan 'Arabiyyal litunzir aUmmal Quraa wa man hawlahaa wa tunzira Yawmal Jam'ilaa raiba feeh; fareequn fil jannati wa fareequn fissa'eer"
                    }
                },
                "translation": {
                    "en": "And thus We have revealed to you an Arabic Qur'an that you may warn the Mother of Cities [Makkah] and those around it and warn of the Day of Assembly, about which there is no doubt. A party will be in Paradise and a party in the Blaze.",
                    "id": "Dan demikianlah Kami wahyukan Al-Qur'an kepadamu dalam bahasa Arab, agar engkau memberi peringatan kepada penduduk ibukota (Mekah) dan penduduk (negeri-negeri) di sekelilingnya serta memberi peringatan tentang hari berkumpul (Kiamat) yang tidak diragukan adanya. Segolongan masuk surga dan segolongan masuk neraka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4279",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4279.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4279.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan demikianlah Kami wahyukan Al-Qur’an kepadamu, wahai Nabi Muhammad dalam bahasa Arab, yaitu bahasa yang engkau gunakan bersama kaummu agar engkau memberi peringatan kepada penduduk ibukota, yaitu kota Mekah, dan penduduk negeri-negeri di sekelilingnya serta memberi peringatan tentang hari berkumpul, hari Kiamat, yang tidak diragukan adanya oleh orang-orang beriman. Pada hari itu nanti segolongan di antara manusia masuk surga karena keimanan dan amal saleh yang mereka lakukan dan segolongan yang lain masuk neraka karena kekafiran dan kedurhakaan mereka terhadap Allah.",
                        "long": "Pada ayat ini Allah menerangkan bahwa wahyu yang diturunkan Allah kepada Nabi Muhammad saw adalah dalam bahasa Arab, sesuai dengan bahasa penduduk negeri Mekah dan sekitarnya, untuk memudahkan mereka mengerti dakwah dan seruan serta peringatan yang ditujukan Muhammad saw kepada mereka, sebagaimana halnya setiap rasul yang diutus ia menggunakan bahasa kaumnya agar mudah memberikan penjelasan kepada mereka sebagaimana firman Allah:\n\nDan Kami tidak mengutus seorang rasul pun, melainkan dengan bahasa kaumnya, agar dia dapat memberi penjelasan kepada mereka. (Ibrahim/14: 4)\n\nSekalipun hanya penduduk Mekah dan sekitarnya disebut pada ayat ini yang menjadi sasaran dakwah dan peringatan Nabi Muhammad saw, tetapi itu tidaklah berarti bahwa Muhammad saw diutus terbatas hanya kepada orang Arab saja. Hanya penduduk Mekah dan sekitarnya yang disebut, karena sesuai dengan posisi Nabi yang berdomisili di Mekah pada waktu itu, sedangkan pada hakikatnya Muhammad saw itu adalah rasul bagi segenap manusia, sebagaimana firman Allah:\n\nDan Kami tidak mengutus engkau (Muhammad), melainkan kepada semua umat manusia sebagai pembawa berita gembira dan sebagai pemberi peringatan, tetapi kebanyakan manusia tidak mengetahui. (Saba'/34: 28)\n\nSabda Rasulullah:\n\nAbu Hurairah meriwayatkan bahwa Nabi saw bersabda, \"Demi jiwaku yang berada dalam kekuasaan-Nya, tidaklah seorang pun dari umatku baik Yahudi maupun Nasrani yang mendengarkan tentang aku, lalu mati namun tidak beriman dengan (risalah) yang ditugaskan kepadaku, melainkan ia menjadi penghuni neraka.\" (Riwayat Muslim)\n\nNabi Muhammad selain ditugasi untuk memberi peringatan kepada penduduk Mekah dan penduduk negeri-negeri sekelilingnya, juga ditugasi memberi peringatan tentang hari Kiamat. Hari Kiamat itu merupakan hari yang pasti dan tidak diragukan datangnya, di mana pada hari itu segenap makhluk akan dikumpulkan untuk mempertanggungjawabkan perbuatan mereka di dunia dan mendapat ganjaran sesuai dengan perbuatan mereka.\n\nAyat 7 ini diakhiri dengan satu penegasan bahwa sesudah diadakan pemeriksaan yang amat teliti dan perhitungan yang sangat cermat pada tiap-tiap makhluk atas segala perbuatannya di dunia ini, maka mereka itu dibagi menjadi dua golongan. Segolongan dari mereka termasuk yang berbahagia dan dimasukkan ke dalam surga, kekal di dalamnya. Karena mereka itu beriman kepada Allah dan Rasul-Nya serta berbuat amal saleh di dunia, maka wajarlah kalau mereka itu mendapat karunia dari Allah menikmati kesenangan yang abadi di dalam surga, sebagaimana firman Allah:\n\nDan adapun orang-orang yang berbahagia, maka (tempatnya) di dalam surga; mereka kekal di dalamnya. (Hud/11: 108)\n\nSedangkan golongan yang kedua, termasuk golongan yang celaka; mereka dimasukkan ke dalam api neraka yang menyala-nyala, kekal di dalamnya karena mereka itu pada waktu berada di dunia tetap ingkar kepada Allah, menentang apa yang didakwakan oleh junjungan kita Nabi Muhammad saw sebagaimana firman Allah:\n\nMaka adapun orang-orang yang sengsara, maka (tempatnya) di dalam neraka, di sana mereka mengeluarkan dan menarik nafas dengan merintih, mereka kekal di dalamnya. (Hud/11: 106-107)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4280,
                    "inSurah": 8
                },
                "meta": {
                    "juz": 25,
                    "page": 483,
                    "manzil": 6,
                    "ruku": 419,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَوْ شَاءَ اللَّهُ لَجَعَلَهُمْ أُمَّةً وَاحِدَةً وَلَٰكِن يُدْخِلُ مَن يَشَاءُ فِي رَحْمَتِهِ ۚ وَالظَّالِمُونَ مَا لَهُم مِّن وَلِيٍّ وَلَا نَصِيرٍ",
                    "transliteration": {
                        "en": "Wa law shaaa'al laahu laja'alahum ummatanw waahi datanw walaakiny yudkhilumany yashaaa'u fee rahmatih; waz zaalimoona maa lahum minw waliyyinw wa laa naseer"
                    }
                },
                "translation": {
                    "en": "And if Allah willed, He could have made them [of] one religion, but He admits whom He wills into His mercy. And the wrongdoers have not any protector or helper.",
                    "id": "Dan sekiranya Allah menghendaki niscaya Dia jadikan mereka satu umat, tetapi Dia memasukkan orang-orang yang Dia kehendaki ke dalam rahmat-Nya. Dan orang-orang yang zalim tidak ada bagi mereka pelindung dan penolong."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4280",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4280.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4280.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sekiranya Allah menghendaki niscaya Dia jadikan mereka satu umat saja, dengan menjadikan mereka semua beriman atau kafir seluruhnya dan tidak memberi mereka kesempatan untuk memilih. Tetapi Dia memasukkan orang-orang yang Dia kehendaki ke dalam rahmat-Nya, yaitu surga-Nya atas dasar anugerah-Nya dan memasukkan mereka yang kafir ke dalam neraka lantaran kekafiran mereka. Dan orang-orang yang zalim, yang telah melanggar tuntunan dan menyekutukan-Nya tidak ada bagi mereka seorang pelindung-pun yang dapat melindungi mereka dari azab Allah dan seorang penolong pun yang dapat menolong mereka dari siksaan api neraka.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa jika Dia menghendaki, maka semua manusia itu akan beriman sehingga menjadi umat yang satu, tetapi kebijaksanaan yang diambil-Nya adalah dengan menyerahkan urusan iman dan kufur kepada pribadi manusia masing-masing. Dia tidak mau memaksakan agar semua manusia itu beriman, namun memberikan kepada mereka hak memilih dan menentukan nasibnya menurut kemauan mereka sendiri. Berbahagialah orang-orang yang mengikuti petunjuk rasul. Mereka selalu bersyukur memuji Allah dan akan dimasukkan ke dalam rahmat-Nya dan celakalah orang-orang yang selalu menentang dan tidak mau mengikuti petunjuk rasul, mereka akan disiksa di hari kemudian dan tidak seorang pun yang akan menolong dan melindungi mereka. Mereka tidak dapat menyesali siapa-siapa kecuali diri mereka sendiri sebagaimana sabda Rasulullah saw: \n\nSiapa memperoleh kebaikan hendaklah memuji Allah dan siapa memperoleh selain daripada itu janganlah ia menyalahkan melainkan terhadap dirinya sendiri. (Riwayat Muslim dari Abu dzarr al-Giffari)\n\nTidak sedikit ayat yang senada dengan ayat 8 ini. Antara lain firman Allah:\n\nDan sekiranya Allah menghendaki, tentu Dia jadikan mereka semua mengikuti petunjuk. (al-An'am/6: 35)\n\nDan firman-Nya:\n\nDan jika Kami menghendaki niscaya Kami berikan kepada setiap jiwa petunjuk (bagi)nya. (as-Sajdah/32: 13)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4281,
                    "inSurah": 9
                },
                "meta": {
                    "juz": 25,
                    "page": 483,
                    "manzil": 6,
                    "ruku": 419,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمِ اتَّخَذُوا مِن دُونِهِ أَوْلِيَاءَ ۖ فَاللَّهُ هُوَ الْوَلِيُّ وَهُوَ يُحْيِي الْمَوْتَىٰ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ",
                    "transliteration": {
                        "en": "Amit takhazoo min dooniheee awliyaaa'a fallaahu Huwal Waliyyu wa Huwa yuhyil mawtaa wa Huwa 'alaa kulli shai'in Qadeer"
                    }
                },
                "translation": {
                    "en": "Or have they taken protectors [or allies] besides him? But Allah - He is the Protector, and He gives life to the dead, and He is over all things competent.",
                    "id": "Atau mereka mengambil pelindung-pelindung selain Dia? Padahal Allah, Dialah pelindung (yang sebenarnya). Dan Dia menghidupkan orang yang mati, dan Dia Mahakuasa atas segala sesuatu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4281",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4281.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4281.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Atau apakah mereka mengambil pelindung-pelindung yang mereka sembah selain Dia, yang dapat melindungi dan menolong mereka dari azab-Nya dan siksaan api neraka? Padahal Allah, Dialah satu-satunya yang menjadi pelindung yang sebenarnya. Dan Dia, satu-satunya yang menghidupkan orang yang mati, dan Dia pula yang Mahakuasa atas segala sesuatu.",
                        "long": "Pada ayat ini, Allah menerangkan bahwa orang-orang musyrik Mekah telah mengambil pelindung selain Allah untuk menolong mereka dalam hal-hal yang memerlukan pertolongan. Mereka telah sesat, karena mereka mengambil makhluk sebagai pelindung yang tak dapat mendatangkan manfaat atau menolak bencana bagi dirinya apalagi bagi yang lain. Kalau mereka menghendaki pelindung yang benar dan sesungguhnya, yang dapat mendatangkan manfaat dan menolak bencana, tentunya mereka akan memilih Allah sebagai pelindung mereka, Tuhan Yang Mahakuasa atas yang demikian itu, Tuhan yang menghidupkan dan mematikan. Tuhan yang akan membangkitkan mereka kelak di akhirat, dan mestinya mereka tidak akan memilih makhluk yang lemah dan tidak berdaya sebagai pelindung mereka, sebagaimana firman Allah:\n\nSesungguhnya segala yang kamu seru selain Allah tidak dapat menciptakan seekor lalat pun, walaupun mereka bersatu untuk menciptakannya. Dan jika lalat itu merampas sesuatu dari mereka, mereka tidak akan dapat merebutnya kembali dari lalat itu. Sama lemahnya yang menyembah dan yang disembah. (al-hajj/22: 73)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4282,
                    "inSurah": 10
                },
                "meta": {
                    "juz": 25,
                    "page": 483,
                    "manzil": 6,
                    "ruku": 420,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا اخْتَلَفْتُمْ فِيهِ مِن شَيْءٍ فَحُكْمُهُ إِلَى اللَّهِ ۚ ذَٰلِكُمُ اللَّهُ رَبِّي عَلَيْهِ تَوَكَّلْتُ وَإِلَيْهِ أُنِيبُ",
                    "transliteration": {
                        "en": "Wa makh-talaftum feehi min shai'in fahukmuhooo ilallaah; zaalikumul laahu Rabbee 'alaihi tawakkaltu wa ilaihi uneeb"
                    }
                },
                "translation": {
                    "en": "And in anything over which you disagree - its ruling is [to be referred] to Allah. [Say], \"That is Allah, my Lord; upon Him I have relied, and to Him I turn back.\"",
                    "id": "Dan apa pun yang kamu perselisihkan padanya tentang sesuatu, keputusannya (terserah) kepada Allah. (Yang memiliki sifat-sifat demikian) itulah Allah Tuhanku. Kepada-Nya aku bertawakal dan kepada-Nya aku kembali."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4282",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4282.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4282.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah menyatakan kepada seluruh manusia, “Dan apa pun yang kamu perselisihkan padanya tentang sesuatu, termasuk di dalamnya tentang terjadinya Kiamat itu, keputusannya terserah kepada Allah karena yang mengetahui tentang semua itu hanyalah Dia. Lalu Allah memerintahkan kepada Nabi Muhammad untuk menyatakan bahwa yang memiliki sifat-sifat demikian itulah Allah, Yang Maha Esa, tidak ada sekutu bagi-Nya, Maha Mengetahui tentang segala sesuatu, Mahaagung, dan Mahakuasa. Dialah Tuhanku, pemelihara, pembimbing dan pelindung-ku. Kepada-Nya aku terus-menerus bertawakal dan berserah diri dan kepada-Nya aku terus-menerus kembali untuk bertobat.",
                        "long": "Allah menerangkan bahwa apa saja yang diperselisihkan mengenai urusan agama, keputusannya supaya dikembalikan kepada Allah, artinya hanya Allah yang menentukan mana yang benar dan mana yang salah. Manusia dalam kehidupan dunia harus mengikuti petunjuk Allah dalam Al-Qur'an dan petunjuk sunah Rasul, sebagaimana firman Allah: \n\nKemudian, jika kamu berbeda pendapat tentang sesuatu, maka kembalikanlah kepada Allah (Al-Qur'an) dan Rasul (sunnahnya), jika kamu beriman kepada Allah dan hari kemudian. (an-Nisa'/4: 59)\n\nSedangkan yang memutuskan perselisihan manusia di akhirat nanti sepenuhnya hanya Allah saja, karena semua makhluk tidak ada yang memiliki kekuasaan, dan hanya Allah saja yang berkuasa, sebagaimana firman:\n\nPemilik hari pembalasan. (al-Fatihah/1: 4)\n\nDia-lah yang akan menetapkan hukumnya di hari Kiamat, menangani persoalan antara orang-orang yang berselisih. Di sanalah baru dapat diketahui dengan jelas siapa yang benar dan siapa yang salah, siapa yang layak masuk surga dan siapa yang menjadi penghuni neraka.\n\nYang memiliki sifat-sifat menghidupkan dan mematikan, menetapkan hukum antara dua orang yang berselisih tiada lain hanyalah Allah, Tuhan Yang Maha Esa, bukanlah tuhan-tuhan selain Allah yang dianggap dan diakui mereka. Kepada-Nyalah manusia bertawakal dan berserah diri agar terhindar dari segala usaha jahat musuh-musuh mereka dan berhasil tidaknya urusan mereka hanya kepada Allah-lah segala sesuatunya dikembalikan, dan kepada-Nya-lah kita bertobat atas segala dosa dan maksiat yang telah kita lakukan. Sebagaimana firman-Nya:\n\nDan kepada Allah-lah segala perkara dikembalikan. (al-Baqarah/2: 210)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4283,
                    "inSurah": 11
                },
                "meta": {
                    "juz": 25,
                    "page": 484,
                    "manzil": 6,
                    "ruku": 420,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَاطِرُ السَّمَاوَاتِ وَالْأَرْضِ ۚ جَعَلَ لَكُم مِّنْ أَنفُسِكُمْ أَزْوَاجًا وَمِنَ الْأَنْعَامِ أَزْوَاجًا ۖ يَذْرَؤُكُمْ فِيهِ ۚ لَيْسَ كَمِثْلِهِ شَيْءٌ ۖ وَهُوَ السَّمِيعُ الْبَصِيرُ",
                    "transliteration": {
                        "en": "Faatirus samaawaati wal ard; ja'ala lakum min anfusikum azwaajanw wa minal an'aami azwaajany yazra'ukum feeh; laisa kamislihee shai'unw wa Huwas Samee'ul Baseer"
                    }
                },
                "translation": {
                    "en": "[He is] Creator of the heavens and the earth. He has made for you from yourselves, mates, and among the cattle, mates; He multiplies you thereby. There is nothing like unto Him, and He is the Hearing, the Seeing.",
                    "id": "(Allah) Pencipta langit dan bumi. Dia menjadikan bagi kamu pasangan-pasangan dari jenis kamu sendiri, dan dari jenis hewan ternak pasangan-pasangan (juga). Dijadikan-Nya kamu berkembang biak dengan jalan itu. Tidak ada sesuatu pun yang serupa dengan Dia. Dan Dia Yang Maha Mendengar, Maha Melihat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4283",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4283.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4283.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dialah, Allah, Pencipta langit dengan segala keindahannya dan Pencipta bumi tanpa ada contoh sebelumnya dan Dia pula yang menciptakan segala isi yang ada pada keduanya, termasuk makhluk-makhluk yang menghuninya. Dia menjadikan bagi kamu pasangan-pasangan dari jenis kamu sendiri, yaitu pasangan laki-laki sebagai suami dan perempuan sebagai istri dan menjadikan pula dari jenis hewan ternak pasangan-pasangan bagi masing-masing binatang, ada jantan dan ada betina dan dengan berpasangan itu mereka dapat melanjutkan keturunannya. Dijadikan-Nya kamu berkembang biak dan dapat melanjutkan keturunanmu dengan jalan berpasang-pasangan itu. Tidak ada sesuatu pun dari semua makhluk yang telah diciptakan-Nya itu yang serupa dengan Dia dalam zat dan segala sifat dan perbuatan-Nya. Dia suci dari pasangan. Dan Dia Yang Maha Mendengar segala yang kamu katakan, maupun yang terlintas dalam pikiranmu, Maha Melihat segala yang kamu lakukan, baik secara terangan-terangan maupun sembunyi-sembunyi.",
                        "long": "Allah menerangkan bahwa Dia-lah yang menciptakan langit dan bumi serta segala isinya, begitu juga hal-hal aneh dan ajaib yang mengherankan yang kita saksikan seperti luasnya cakrawala yang membentang luas di atas kita tanpa ada tiang yang menunjangnya; karenanya. Dia-lah yang pantas dan layak dijadikan sandaran dalam segala hal dan dimintai bantuan dan pertolongan-Nya; bukan tuhan-tuhan mereka yang tidak berdaya dan yang tidak dapat berbuat apa-apa. Dia-lah yang menjadikan bagi manusia dari jenisnya sendiri jodohnya masing-masing; yang satu dijodohkan kepada yang lain sehingga lahirlah keturunan turun-temurun memakmurkan dunia ini. Demikian itu berlaku pula pada binatang ternak yang akhirnya berkembang biak memenuhi kehidupan di bumi.\n\nDengan demikian, kehidupan makhluk yang berada di atas bumi ini menjadi teratur dan terjamin bagi mereka. Makanan yang cukup bergizi, minuman yang menyegarkan dan nikmat-nikmat lain yang wajib disyukuri untuk mencapai kebahagiaan dunia dan akhirat. Semuanya itu menunjukkan kebenaran dan kekuasaan Allah. Tidak ada satu pun yang menyamai-Nya dalam segala hal. Dia Maha Mendengar, Dia mendengar segala apa yang diucapkan setiap makhluk, Dia Maha Melihat. Tidak ada sesuatu pun yang tersembunyi bagi-Nya. Dia melihat segala amal perbuatan makhluk-Nya, yang baik maupun yang jahat. Tidak ada sesuatu pun yang menyamai kekuasaan, kebesaran, dan kebijaksanaan-Nya.\n\nAllah menciptakan segala sesuatu berpasang-pasangan. Ayat ini secara jelas menyatakan demikian. Demikian pula beberapa ayat berikut:\n\nMahasuci (Allah) yang telah menciptakan semuanya berpasang-pasangan, baik dari apa yang ditumbuhkan oleh bumi dan dari diri mereka sendiri, maupun dari apa yang tidak mereka ketahui. (Yasin/36: 36)\n\nFirman Allah:\n\nDan Dia yang menghamparkan bumi dan menjadikan gunung-gunung dan sungai-sungai di atasnya. Dan padanya Dia menjadikan semua buah-buahan berpasang-pasangan; Dia menutupkan malam kepada siang. Sungguh, pada yang demikian itu terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang berpikir (ar-Ra'd/13: 3)\n\nDan firman-Nya\n\nDan segala sesuatu Kami ciptakan berpasang-pasangan agar kamu mengingat (kebesaran Allah). (adh-dzariyat/51: 49)\n\nMenurut kajian ilmiah, bukan hanya makhluk hidup yang berpasang-pasangan namun benda-benda mati juga berpasang-pasangan. Dengan menggunakan ilmu dan peralatan canggih yang ada saat ini, sudah dapat diketahui mengenai adanya pasangan-pasangan dari atom sampai ke awan. Atom, yang tadinya diduga merupakan wujud yang terkecil dan tidak dapat dibagi, ternyata iapun berpasangan. Atom terdiri dari elektron dan proton. Proton yang bermuatan listrik positif dikelilingi oleh beberapa partikel elektron yang bermuatan listrik negatif. Muatan listrik di kedua kelompok partikel ini sangat seimbang.\n\nTumbuh-tumbuhan pun memiliki pasangan-pasangan guna pertumbuhan dan perkembangannya. Sebelumnya, manusia tidak mengetahui bahwa tumbuh-tumbuhan juga memiliki perbedaan kelamin jantan dan betina. Buah adalah produk akhir dari reproduksi tumbuhan tinggi. Tahap yang mendahului buah adalah bunga, yang memiliki organ jantan dan betina yaitu benangsari dan putik. Bila tepungsari dihantarkan ke putik, akan menghasilkan buah, yang kemudian tumbuh, hingga akhirnya matang dan melepaskan bijinya. Oleh sebab itu seluruh buah mencerminkan keberadaan organ-organ jantan dan betina, suatu fakta yang disebut dalam Al-Qur'an. \n\nAda tumbuhan yang memiliki benangsari dan putik sehingga menyatu dalam diri pasangannya; dan dalam penyerbukannya ia tidak membutuhkan pejantan dari bunga lain. Namun, ada juga yang hanya memiliki salah satunya saja sehingga untuk berproduksi ia membutuhkan pasangannya dari bunga lain. Hanya Allah yang tidak berpasangan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4284,
                    "inSurah": 12
                },
                "meta": {
                    "juz": 25,
                    "page": 484,
                    "manzil": 6,
                    "ruku": 420,
                    "hizbQuarter": 193,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَهُ مَقَالِيدُ السَّمَاوَاتِ وَالْأَرْضِ ۖ يَبْسُطُ الرِّزْقَ لِمَن يَشَاءُ وَيَقْدِرُ ۚ إِنَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ",
                    "transliteration": {
                        "en": "Lahoo maqaaleedus samaawaati wal ardi yabsutur rizqa limany yashaaa'u wa yaqdir; innahoo bikulli shai'unw wa Huwas Samee'ul Baseer"
                    }
                },
                "translation": {
                    "en": "To Him belong the keys of the heavens and the earth. He extends provision for whom He wills and restricts [it]. Indeed He is, of all things, Knowing.",
                    "id": "Milik-Nyalah perbendaharaan langit dan bumi; Dia melapangkan rezeki dan membatasinya bagi siapa yang Dia kehendaki. Sungguh, Dia Maha Mengetahui segala sesuatu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4284",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4284.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4284.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dia tidak hanya menciptakan semua yang ada di langit dan bumi, tetapi juga menguasai seluruhnya. Karena itu, milik-Nyalah dan di bawah kekuasaan-Nya semua perbendaharaan langit dan bumi; Dia melapangkan rezeki bagi siapa yang Dia kehendaki, yaitu kepada siapa pun tanpa melihat kepada iman dan amal yang dilakukannya, tetapi berdasarkan hukum-hukum yang telah ditetapkannya dalam memperoleh rezeki dan membatasinya bagi siapa pun, bukan karena kekafirannya dan kemaksiatannya, tetapi karena dia tidak memenuhi hukum-hukum itu. Sungguh, Dia, satu-satunya, Maha Mengetahui segala sesuatu yang ada di langit dan bumi, termasuk yang dilapangkan dan dibatasi rezekinya.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa Dia-lah yang memiliki perbendaharaan langit dan bumi. Baik buruknya sesuatu ada di tangan Dia. Siapa saja yang dianugerahi rahmat, tidak ada seorang pun yang dapat menghalangi-Nya. Sebaliknya, siapa yang tidak diberi rahmat, tidak seorang pun yang dapat mendatangkan kepadanya. Dialah yang melapangkan rezeki kepada siapa yang dikehendaki-Nya, dan Dia pula yang membatasi rezeki kepada yang dikehendaki-Nya. Semua itu terjadi sesuai dengan hikmat kebijaksanaan-Nya berdasarkan kekuasaan-Nya yang luas dan ilmu-Nya yang meliputi segala sesuatu.\n\nAgama Islam memerintahkan kepada para pemeluknya supaya bekerja dan berusaha mencari nafkah untuk kehidupannya di dunia. Adapun hasilnya sesuai dengan kebijaksanaan Allah, ada yang berhasil memperoleh harta yang banyak sebagai ujian, tetapi ada yang hanya memperoleh rezeki hanya sedikit sebagai cobaan bagi hidupnya. Sebagaimana Abu Bakar al-Jazairi dalam kitab Tafsirnya Aisar at-Tafasir menyatakan:\n\nAllah meluaskan rezeki bagi siapa saja sebagai ujian, dan menyempitkannya sebagai cobaan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4285,
                    "inSurah": 13
                },
                "meta": {
                    "juz": 25,
                    "page": 484,
                    "manzil": 6,
                    "ruku": 420,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ شَرَعَ لَكُم مِّنَ الدِّينِ مَا وَصَّىٰ بِهِ نُوحًا وَالَّذِي أَوْحَيْنَا إِلَيْكَ وَمَا وَصَّيْنَا بِهِ إِبْرَاهِيمَ وَمُوسَىٰ وَعِيسَىٰ ۖ أَنْ أَقِيمُوا الدِّينَ وَلَا تَتَفَرَّقُوا فِيهِ ۚ كَبُرَ عَلَى الْمُشْرِكِينَ مَا تَدْعُوهُمْ إِلَيْهِ ۚ اللَّهُ يَجْتَبِي إِلَيْهِ مَن يَشَاءُ وَيَهْدِي إِلَيْهِ مَن يُنِيبُ",
                    "transliteration": {
                        "en": "Shara'a lakum minad deeni maa wassaa bihee Noohanw wallazeee awhainaaa ilaika wa maa wassainaa biheee Ibraaheema wa Moosa wa 'Eesaaa an aqeemud adeena wa laa tatafarraqoo feeh; kabura 'alal mushrikeena maa tad'oohum ilaih; Allaahu yajtabee ilaihi many yashaaa'u wa yahdeee ilaihi mai yuneeb"
                    }
                },
                "translation": {
                    "en": "He has ordained for you of religion what He enjoined upon Noah and that which We have revealed to you, [O Muhammad], and what We enjoined upon Abraham and Moses and Jesus - to establish the religion and not be divided therein. Difficult for those who associate others with Allah is that to which you invite them. Allah chooses for Himself whom He wills and guides to Himself whoever turns back [to Him].",
                    "id": "diwasiatkan-Nya kepada Nuh dan apa yang telah Kami wahyukan kepadamu (Muhammad) dan apa yang telah Kami wasiatkan kepada Ibrahim, Musa dan Isa yaitu tegakkanlah agama (keimanan dan ketakwaan) dan janganlah kamu berpecah belah di dalamnya. Sangat berat bagi orang-orang musyrik (untuk mengikuti) agama yang kamu serukan kepada mereka. Allah memilih orang yang Dia kehendaki kepada agama tauhid dan memberi petunjuk kepada (agama)-Nya bagi orang yang kembali (kepada-Nya)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4285",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4285.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4285.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat-ayat yang lalu menjelaskan bahwa Allah yang telah menciptakan langit dan bumi dan segala perbendaharaannya adalah milik-Nya. Ayat ini menjelaskan bahwa Dia, Allah, telah mensyariatkan atau menetapkan kepadamu, wahai umat Nabi Muhammad, dari agama, yaitu prinsip-prinsip serupa yang telah diwasiatkan-Nya, yaitu diwahyukan kepada Nuh dan serupa pula dengan apa yang telah Kami wahyukan kepadamu, wahai Nabi Muhammad, dan apa yang telah Kami wasiatkan kepada nabi-nabi sebelummu, yaitu Ibrahim, Musa, dan Isa. Syariat yang telah diwasiatkan dan diwahyukan itu adalah tegakkanlah tuntunan dan ajaran agama, berupa keimanan dan ketakwaan dengan baik, konsisten, dan terus-menerus, dan janganlah kamu berselisih paham dan berbeda pendapat tentang suatu persoalan yang dapat menimbulkan kamu berpecah belah di dalamnya, yakni di dalam prinsip dan ajaran agama itu. Sangat berat, besar, dan sulit bagi orang-orang musyrik untuk mengikuti prinsip-prinsip dan tuntunan-tuntunan agama dari Tuhanmu yang kamu serukan kepada mereka untuk mengikutinya karena mereka menolaknya. Allah meyakinkan Nabi Muhammad dengan mengatakan bahwa Allah memilih orang-orang yang Dia kehendaki untuk mengikuti dan meyakini prinsip-prinsip dan tuntunan-tuntunan agama tauhid yang diajarkan dan disampaikannya. Dia pula memberi petunjuk untuk kembali kepada agama-Nya bagi orang yang kembali kepada-Nya setelah bertobat atas kekafiran dan kesalahan mereka.",
                        "long": "Pada ayat ini Allah menerangkan bahwa Dia telah mensyariatkan agama kepada Muhammad saw dan kaumnya sebagaimana Dia telah mewasiatkan pula kepada Nuh dan nabi-nabi yang datang sesudahnya yaitu Ibrahim, Musa dan Isa.\n\nSyariat yang diwasiatkan kepada Nabi Muhammad saw dan nabi-nabi sebelumnya memiliki kesamaan dalam pokok-pokok akidah seperti keimanan kepada Allah swt, risalah kenabian dan keyakinan adanya hari pembalasan atau hari Kiamat.\n\nSedangkan landasan agama yang menjadi misi utama para rasul tersebut adalah beribadah kepada Allah swt dan tidak menyekutukan-Nya. Allah berfirman:\n\nDan Kami tidak mengutus seorang rasul pun sebelum engkau (Muhammad), melainkan Kami wahyukan kepadanya, bahwa tidak ada tuhan (yang berhak disembah) selain Aku, maka sembahlah Aku. (al-Anbiya'/21: 25)\n\nSedangkan perbedaan yang tidak mendasar di antara risalah para nabi adalah dalam bidang syariat yang bersifat furu'iyyah. Beberapa bentuk ibadah dan rinciannya, sesuai dengan perkembangan masa, kebutuhan, dan kemaslahatan umat manusia. Allah berfirman:\n\nUntuk setiap umat di antara kamu, Kami berikan aturan dan jalan yang terang. (al-Ma'idah/5: 48)\n\n\n\nHadis Nabi yang diriwayatkan Abu Hurairah berbunyi:\n\nRasulullah saw bersabda, \"Aku adalah manusia yang lebih utama daripada Isa bin Maryam di dunia dan akhirat.\" Para sahabat bertanya, \"Mengapa wahai Rasulullah?\"Nabi menjawab, \"Para Nabi merupakan bersaudara dari berbagai keturunan. Ibu mereka banyak, namun agama mereka hanya satu. Dan tidak ada antara kami (Nabi Muhammad dan Isa) seorang nabi pun.\" (Riwayat Ahmad dan Muslim)\n\nAllah hanya menyebut nama-nama nabi tersebut di atas karena posisi mereka yang lebih tinggi dibandingkan dengan nabi-nabi lain yang tidak disebutkan, mempunyai tanggung jawab yang besar dan berat, dan karena ketabahan mereka menghadapi cobaan dan kesulitan-kesulitan yang ditimbulkan oleh kaum mereka sehingga mereka itu mendapat julukan Ulul Azmi dari Allah. Dengan disebutkan nama Musa dan Isa diharapkan orang-orang Yahudi dan Nasrani bisa sadar dan tertarik kepada agama yang dibawa oleh Muhammad saw, agama Samawi yang banyak persamaannya dengan agama mereka, yang tertera jelas di dalam Kitab Taurat dan Injil terutama mengenai tauhid, salat, zakat, puasa, haji dan akhlak yang baik seperti menepati janji, jujur, menghubungkan silaturahmi, dan lain-lain.\n\nAllah memerintahkan agar agama Islam yang dibawa Muhammad saw itu dipelihara dan ditegakkan sepenuhnya; pengikutnya dilarang berselisih sesamanya yang dapat mengakibatkan perpecahan dan merusak persatuan. Firman Allah:\n\nSesungguhnya orang-orang Mukmin itu bersaudara, karena itu damaikanlah antara kedua saudaramu (yang berselisih) dan bertakwalah kepada Allah agar kamu mendapat rahmat. (al-hujurat/49: 10)\n\nDan firman-Nya:\n\nDan berpegangteguhlah kamu semuanya pada tali (agama) Allah, dan janganlah kamu bercerai berai. (Ali 'Imran/3: 103)\n\nNampaknya berat bagi orang-orang musyrik untuk memeluk agama tauhid yaitu agama Islam yang dibawa oleh Muhammad saw dan melepaskan agama syirik dan menyembah berhala mereka yang telah diwarisi turun-temurun dari nenek moyang mereka; kekuatan mereka telah diabadikan di dalam Al-Qur'an.\n\nSesungguhnya kami mendapati nenek moyang kami menganut suatu agama, dan kami mendapat petunjuk untuk mengikuti jejak mereka. (az-Zukhruf/43: 22)\n\nMemang tidak semua orang dapat memenuhi seruan untuk memeluk agama Islam yang dibawa Muhammad saw itu, tetapi Allah menentukan hamba-Nya yang dikehendaki-Nya dan memberi petunjuk kepada mereka sehingga mereka memeluk agama Islam."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4286,
                    "inSurah": 14
                },
                "meta": {
                    "juz": 25,
                    "page": 484,
                    "manzil": 6,
                    "ruku": 420,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا تَفَرَّقُوا إِلَّا مِن بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۚ وَلَوْلَا كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ إِلَىٰ أَجَلٍ مُّسَمًّى لَّقُضِيَ بَيْنَهُمْ ۚ وَإِنَّ الَّذِينَ أُورِثُوا الْكِتَابَ مِن بَعْدِهِمْ لَفِي شَكٍّ مِّنْهُ مُرِيبٍ",
                    "transliteration": {
                        "en": "Wa maa tafarraqooo illaa mim ba'di maa jaaa'ahumul 'ilmu baghyam bainahum; wa law laa Kalimatun sabaqat mir Rabbika ilaaa ajalim musammal laqudiya bainahum; wa innal lazeena oorisul Kitaaba mim ba'dihim lafee shakkim minhu mureeb"
                    }
                },
                "translation": {
                    "en": "And they did not become divided until after knowledge had come to them - out of jealous animosity between themselves. And if not for a word that preceded from your Lord [postponing the penalty] until a specified time, it would have been concluded between them. And indeed, those who were granted inheritance of the Scripture after them are, concerning it, in disquieting doubt.",
                    "id": "Dan mereka (Ahli Kitab) tidak berpecah belah kecuali setelah datang kepada mereka ilmu (kebenaran yang disampaikan oleh para nabi) karena kedengkian antara sesama mereka. Jika tidaklah karena suatu ketetapan yang telah ada dahulunya dari Tuhanmu (untuk menangguhkan azab) sampai batas waktu yang ditentukan, pastilah hukuman bagi mereka telah dilaksanakan. Dan sesungguhnya orang-orang yang mewarisi Kitab (Taurat dan Injil) setelah mereka (pada zaman Muhammad), benar-benar berada dalam keraguan yang mendalam tentang Kitab (Al-Qur'an) itu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4286",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4286.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4286.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan mereka, kaum musyrik dan ahli Kitab dari umat-umat terdahulu tidak berselisih, berpecah belah, dan berkelompok-kelompok kecuali setelah datang kepada mereka ilmu, yakni pengetahuan tentang prinsip-prinsip, tuntunan-tuntunan, dan petunjuk-petunjuk kepada kebenaran yang disampaikan oleh para nabi. Perselisihan dan perpecahan di antara mereka disebabkan karena kedengkian yang terjadi antara sesama mereka. Jika tidaklah karena suatu ketetapan yang telah ada dahulunya dari Tuhanmu untuk menangguhkan azab bagi mereka sampai batas waktu yang ditentukan, pastilah hukuman yang berat yang datang dari Tuhanmu bagi mereka telah dilaksanakan dan mereka menjadi binasa dengan hukuman itu. Dan sesungguhnya orang-orang yang mewarisi kepada mereka Kitab, yaitu Taurat dan Injil, setelah mereka yang berselisih dan berpecah-belah itu dan mereka hidup hingga pada zaman Nabi Muhammad, benar-benar berada dalam keraguan yang mendalam tentang kitab Taurat dan Injil yang mereka warisi itu atau Kitab Al-Qur’an dengan ajaran-ajaran Islam yang dibawa oleh Nabi Muhammad.",
                        "long": "Pada ayat ini Allah menerangkan bahwa Ahli Kitab baik Yahudi maupun Nasrani sesudah mengetahui kebenaran rasul-rasul yang diutus kepada mereka, lalu berpecah-belah menjadi beberapa golongan, sebagaimana digambarkan Allah dalam firman-Nya:\n\nSesungguhnya orang-orang yang memecah belah agamanya dan mereka menjadi (terpecah) dalam golongan-golongan, sedikit pun bukan tanggung jawabmu (Muhammad) atas mereka. (al-An'am/6: 159)\n\nMereka melakukan yang demikian itu karena kedengkian dan kebencian antara mereka sehingga timbullah pertentangan antar sekte di kalangan mereka yang sukar untuk diatasi dan diselesaikan. Mereka saling menuduh, orang-orang Yahudi meyakinkan kebenaran pendirian dan pegangan mereka, sedangkan anggapan orang Nasrani meyakini bahwa orang Yahudi itu tidak mempunyai pendirian dan pegangan. Begitu pula sebaliknya, orang-orang Yahudi menganggap bahwa orang-orang Nasrani itu tidak mempunyai pendirian, sebagaimana firman Allah:\n\nDan orang Yahudi berkata, \"Orang Nasrani itu tidak memiliki sesuatu (pegangan),\" dan orang-orang Nasrani (juga) berkata, \"Orang-orang Yahudi tidak memiliki sesuatu (pegangan),\" (al-Baqarah/2: 113)\n\nSekiranya belum ada ketentuan lebih dahulu dari Allah mengenai ditangguhkannya pembalasan dan siksa bagi orang-orang yang menentang dan menyalahi perintah Allah itu sampai kepada waktu yang telah ditentukan-Nya (hari Kiamat), niscaya mereka telah dibinasakan di dunia ini dan tidak perlu lagi ditunda sampai di akhirat nanti.\n\nPerpecahan di antara umat manusia berlaku umum, bukan hanya terjadi pada Ahli Kitab saja, tetapi juga ada di kalangan Muslimin sendiri. Kalau perpecahan dalam bidang akidah banyak dialami Ahli Kitab, kelompok Islam banyak mengalami perselisihan dalam bidang fiqh, muamalat, dan pernikahan, yang menyebabkan perpecahan di kalangan umat Islam. Perintah untuk bersatu harus benar-benar disadari oleh umat Islam, karena dampak buruk perpecahan ini adalah lemahnya persatuan dan kesatuan umat sehingga posisi tawar kita dalam berbagai posisi dan bidang di dunia internasional menjadi lemah.\n\nAyat 14 ini ditutup dengan satu penegasan bahwa orang-orang Yahudi dan Nasrani yang mewarisi Kitab Taurat dan Injil dari nenek moyang mereka, yang pada masa Rasulullah saw menyaksikan dakwah Islamiyah, mereka itu menjadi ragu tentang kebenaran Kitab mereka dan benar-benar mengguncangkan kepercayaan mereka. Hal ini tidak mengherankan karena di samping kepercayaan mereka kepada Kitab Samawi memang tidak mendalam, mereka memeluk agama hanya karena ikut-ikutan kepada nenek moyang mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4287,
                    "inSurah": 15
                },
                "meta": {
                    "juz": 25,
                    "page": 484,
                    "manzil": 6,
                    "ruku": 420,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَلِذَٰلِكَ فَادْعُ ۖ وَاسْتَقِمْ كَمَا أُمِرْتَ ۖ وَلَا تَتَّبِعْ أَهْوَاءَهُمْ ۖ وَقُلْ آمَنتُ بِمَا أَنزَلَ اللَّهُ مِن كِتَابٍ ۖ وَأُمِرْتُ لِأَعْدِلَ بَيْنَكُمُ ۖ اللَّهُ رَبُّنَا وَرَبُّكُمْ ۖ لَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ ۖ لَا حُجَّةَ بَيْنَنَا وَبَيْنَكُمُ ۖ اللَّهُ يَجْمَعُ بَيْنَنَا ۖ وَإِلَيْهِ الْمَصِيرُ",
                    "transliteration": {
                        "en": "Falizaalika fad'u wastaqim kamaaa umirta wa laa tattabi' ahwaaa'ahum wa qul aamantu bimaaa anzalal laahu min Kitaab, wa umirtu li a'dila bainakum Allaahu Rabbunaa wa Rabbukum lanaaa a'maa lunaa wa lakum a'maalukim laa hujjata bainanaa wa baina kumul laahu yajma'u bainanaa wa ilaihil maseer"
                    }
                },
                "translation": {
                    "en": "So to that [religion of Allah] invite, [O Muhammad], and remain on a right course as you are commanded and do not follow their inclinations but say, \"I have believed in what Allah has revealed of the Qur'an, and I have been commanded to do justice among you. Allah is our Lord and your Lord. For us are our deeds, and for you your deeds. There is no [need for] argument between us and you. Allah will bring us together, and to Him is the [final] destination.\"",
                    "id": "Karena itu, serulah (mereka beriman) dan tetaplah (beriman dan berdakwah) sebagaimana diperintahkan kepadamu (Muhammad) dan janganlah mengikuti keinginan mereka dan katakanlah, “Aku beriman kepada Kitab yang diturunkan Allah dan aku diperintahkan agar berlaku adil di antara kamu. Allah Tuhan kami dan Tuhan kamu. Bagi kami perbuatan kami dan bagi kamu perbuatan kamu. Tidak (perlu) ada pertengkaran antara kami dan kamu, Allah mengumpulkan antara kita dan kepada-Nyalah  (kita) kembali.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4287",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4287.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4287.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Karena itu, apa pun sikap mereka terhadap kamu, termasuk keraguan mereka yang mendalam terhadap ajaran-ajaran yang kamu sampaikan, serulah mereka dengan penuh kesabaran untuk beriman kepada Tuhanmu dan tetaplah beriman dan berdakwah sebagaimana diperintahkan Tuhanmu kepadamu Muhammad dan janganlah mengikuti keinginan mereka dalam hal apa pun dan katakanlah kepada mereka yang kafir dan ragu itu dengan tegas, “Aku beriman kepada Kitab yang diturunkan Allah dan apa yang diturunkan-Nya di dalam kitab suci-Nya dan aku diperintahkan agar berlaku adil di antara kamu sekalian. Allah adalah Tuhan kami dan juga Tuhan kamu, yang menciptakan, memelihara, mendidik, dan membimbing ke jalan yang benar, dan memberi balasan atas apa yang kita kerjakan. Bagi kami perbuatan kami dan kami akan mempertanggungjawabkannya dan bagi kamu perbuatan kamu dan kamu akan mempertanggungjawabkannya di hadapan-Nya. Tidak perlu lagi ada pertengkaran antara kami dan kamu, Allah mengumpulkan antara kita di hari Kiamat nanti dan memutuskan perbedaan di antara kita dan kepada-Nyalah kita semua kembali.”",
                        "long": "Pada ayat ini Allah memerintahkan kepada Nabi Muhammad saw agar menyeru kaumnya supaya jangan berpecah-belah seperti Ahli Kitab, supaya bersatu memeluk agama tauhid yang telah dirintis oleh para nabi, yaitu agama Islam yang dibawanya dan agar beliau tetap tabah menghadapi mereka. Jangan sekali-kali terpengaruh oleh keraguan mereka terhadap agama yang benar yang telah disyariatkan kepadanya. Ia harus selalu menandaskan pendiriannya bahwa dia tetap percaya kepada semua yang telah diturunkan Allah dari langit seperti Kitab Taurat, Injil dan Zabur, dan tidak didustakannya sedikit pun. Nabi Muhammad juga diperintahkan berlaku adil di antara mereka di dalam menetapkan hukum dan sebagainya, dengan tidak akan mengurangi dan menambah apa yang telah disyariatkan Allah kepadanya, serta akan menyampaikan apa yang telah diperintahkan kepadanya untuk disampaikan.\n\nAyat ini juga menjelaskan bahwa Allah adalah Tuhan kamu dan Tuhan kami sekalian. Dia-lah satu-satunya yang wajib disembah, yang wajib dipercaya dengan penuh pengertian. Tiada Tuhan selain Allah. Bagi kami amalan kami, baik buruknya adalah tanggung jawab kami, diberi pahala atau diazab, dan bagi kamu sekalian amalan kamu. Kami tidak akan berbahagia karena amal baikmu dan tidak akan celaka karena amalan burukmu. Masing-masing bertanggung jawab atas amal perbuatannya. Sejalan dengan ayat ini firman Allah:\n\nDan jika mereka (tetap) mendustakanmu (Muhammad), maka katakanlah, \"Bagiku pekerjaanku dan bagimu pekerjaanmu. Kamu tidak bertanggung jawab terhadap apa yang aku kerjakan dan aku pun tidak bertanggung jawab terhadap apa yang kamu kerjakan.\" (Yunus/10: 41)\n\nDengan demikian tidak boleh lagi ada pertengkaran di antara kaum Muslimin dan orang-orang musyrikin, yang hak dan yang benar telah nyata. Barang siapa yang masih saja membangkang dan tidak mau percaya berarti dia ingkar. Pada waktunya nanti akan jelas dan tampak siapa yang benar di antara pemeluk agama karena Allah akan mengumpulkan seluruh manusia nanti di hari kemudian, dan di sanalah Dia akan menjatuhkan keputusan yang seadil-adilnya atas apa yang dipersengketakan, sebagaimana firman Allah:\n\nKatakanlah, \"Tuhan kita akan mengumpulkan kita semua, kemudian Dia memberi keputusan antara kita dengan benar. Dan Dia Yang Maha Pemberi keputusan, Maha Mengetahui.\" (Saba'/34: 26)\n\nKepada-Nyalah semua manusia akan kembali sesudah mati dan mempertanggungjawabkan semua amal di dunia. Seluruh manusia akan menerima balasan sesuai dengan amal masing-masing, sebagaimana firman Allah:\n\nMaka barang siapa mengerjakan kebaikan seberat zarrah, niscaya dia akan melihat (balasan)nya, dan barang siapa mengerjakan kejahatan seberat zarrah, niscaya dia akan melihat (balasan)nya. (az-Zalzalah/99: 7-9)\n\nWahbah Zuhaili dalam tafsirnya al-Munir menyimpulkan sepuluh perintah Allah dan larangannya bukan hanya bagi Rasulullah tapi juga bagi seluruh umat Islam. Sepuluh perintah dan larangan tersebut adalah:\n\n1.Perintah kepada Nabi untuk terus berdakwah menyampaikan risalahnya. \n\n2.Istiqamah dalam penyampaiannya.\n\n3.Larangan bagi rasul untuk tidak mengikuti keinginan orang-orang musyrikin Mekah atau Ahli Kitab, untuk mengikuti ibadah mereka.\n\n4.Perintah untuk beriman dan menyatakan iman kepada kitab-kitab samawi yang diturunkan Allah.\n\n5.Perintah untuk berlaku adil di antara Muhajirin dan ketika menghadapi perselisihan yang terjadi di antara mereka.\n\n6.Perintah berikrar bahwa hanya Allah yang pantas disembah, tidak ada Tuhan selainnya.\n\n7.Perintah untuk menyatakan kepada Ahli Kitab bahwa masing-masing bertanggung jawab terhadap amal perbuatannya dan balasan baik dan buruk dari amalan tersebut.\n\n8.Perintah untuk menyatakan bahwa tidak ada permusuhan di antara nabi dan Ahli Kitab, karena kebenaran Allah tampak dengan jelas.\n\n9.Perintah untuk menyatakan bahwa Allah kelak akan mengumpulkan umat Islam dan Ahli Kitab di Padang Mahsyar untuk menghadapi pengadilan Allah.\n\n10.Hanya kepada Allah semua makhluk akan kembali."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4288,
                    "inSurah": 16
                },
                "meta": {
                    "juz": 25,
                    "page": 485,
                    "manzil": 6,
                    "ruku": 420,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِينَ يُحَاجُّونَ فِي اللَّهِ مِن بَعْدِ مَا اسْتُجِيبَ لَهُ حُجَّتُهُمْ دَاحِضَةٌ عِندَ رَبِّهِمْ وَعَلَيْهِمْ غَضَبٌ وَلَهُمْ عَذَابٌ شَدِيدٌ",
                    "transliteration": {
                        "en": "Wallazeena yuhaaajjoona fil laahi mim ba'di mastujeeba lahoo hujjatuhum daahidatun 'inda Rabbihim wa 'alaihim ghadabunw wa lahum 'azaabun shadeed"
                    }
                },
                "translation": {
                    "en": "And those who argue concerning Allah after He has been responded to - their argument is invalid with their Lord, and upon them is [His] wrath, and for them is a severe punishment.",
                    "id": "Dan orang-orang yang berbantah-bantah tentang (agama) Allah setelah (agama itu) diterima, perbantahan mereka itu sia-sia di sisi Tuhan mereka. Mereka mendapat kemurkaan (Allah) dan mereka mendapat azab yang sangat keras."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4288",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4288.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4288.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat yang lalu menegaskan bahwa tidak ada lagi bantahan yang terjadi antara orang-orang beriman dan orang-orang kafir. Dalam ayat ini Allah menyatakan bahwa orang-orang yang berbantah-bantah tentang agama Allah dan berusaha memalingkan orang-orang yang beriman dari agama-Nya setelah agama itu diterima dan diimani oleh mereka, perbantahan mereka itu menjadi sia-sia di sisi Tuhan mereka. Mereka mendapat kemurkaan Allah dengan dijauhkannya mereka dari rahmat-Nya sebagai akibat dari perbuatan mereka dan mereka mendapat azab yang sangat keras di akhirat kelak.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa orang-orang yang masih membantah kebenaran agama Allah, sekalipun agama itu telah diterima baik oleh masyarakat, akan sia-sia usaha dan bantahan mereka. Mereka itu dimurkai Allah karena keberanian mereka mengingkari kebenaran agama Islam, mereka akan diazab di hari kemudian karena keangkuhan mereka meninggalkan agama yang hak yang dapat dibuktikan kebenarannya.\n\nDiriwayatkan bahwa orang-orang Yahudi berkata kepada orang-orang Mukmin, \"Wahai orang-orang Mukmin! Kamu sekalian telah mengatakan bahwa mengambil dan menerima yang sudah disepakati, lebih baik daripada mengambil dan menerima yang sudah diperselisihkan. Kenabian Musa dan kitab Taurat-nya telah diterima dan disepakati kebenarannya sedangkan kenabian Muhammad masih diperselisihkan dan dipersengketakan. Jadi agama Yahudilah yang pantas dan layak diambil dan diterima.\" Untuk melumpuhkan alasan mereka itu, Allah mengemukakan hujjah bahwa kewajiban beriman dan mempercayai kebenaran Musa adalah karena adanya mukjizat yang diberikan Allah kepadanya yang menunjukkan dan membuktikan kebenarannya. Beberapa mukjizat yang diberikan kepada Nabi Muhammad saw bisa disaksikan sendiri oleh orang-orang Yahudi. Maka wajiblah atas kita semua mengakui dan mempercayai kenabian Muhammad saw itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4289,
                    "inSurah": 17
                },
                "meta": {
                    "juz": 25,
                    "page": 485,
                    "manzil": 6,
                    "ruku": 420,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "اللَّهُ الَّذِي أَنزَلَ الْكِتَابَ بِالْحَقِّ وَالْمِيزَانَ ۗ وَمَا يُدْرِيكَ لَعَلَّ السَّاعَةَ قَرِيبٌ",
                    "transliteration": {
                        "en": "Allahul lazeee anzalal Kitaaba bilhaqqi wal Meezaan; wa ma yudreeka la'allas Saa'ata qareeb"
                    }
                },
                "translation": {
                    "en": "It is Allah who has sent down the Book in truth and [also] the balance. And what will make you perceive? Perhaps the Hour is near.",
                    "id": "Allah yang menurunkan Kitab (Al-Qur'an) dengan (membawa) kebenaran dan neraca (keadilan). Dan tahukah kamu, boleh jadi hari Kiamat itu sudah dekat?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4289",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4289.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4289.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Bantahan-bantahan yang dilakukan orang-orang kafir, seperti yang digambarkan di dalam ayat sebelumnya, didasarkan pada pemikiran mereka. Ayat ini menjelaskan bahwa ajaran Ilahi didasarkan pada kitab suci yang hak. Allah menegaskan bahwa Allah yang telah menurunkan Kitab suci Al-Qur’an kepada Nabi Muhammad, dan kitab-kitab suci yang lain kepada para rasul sebelum beliau dengan membawa kebenaran yang bersumber dari Yang Mahabenar dan kitab suci itu juga menjadi neraca keadilan untuk menetapkan hukum di antara manusia. Dan tahukah kamu, wahai manusia, tentang waktu kedatangan hari Kiamat, dan bersiap-siaplah untuk menghadapinya karena boleh jadi hari Kiamat itu sudah dekat waktu kedatangannya?",
                        "long": "Dalam ayat ini Allah menerangkan bahwa Dia telah menurunkan kitab-kitab-Nya kepada nabi-nabi-Nya, yang memuat kebenaran yang tak diragukan, jauh dari kebatilan dan semuanya mengandung kebaikan. Dia memberikan perintah untuk berbuat adil untuk menjadi acuan menentukan hukuman dalam mengadili orang-orang yang dituduh bersalah dan menghukum mereka dengan hukuman yang telah ditetapkan di dalam Kitab-Nya. Firman Allah:\n\nSungguh, Kami telah mengutus rasul-rasul Kami dengan bukti-bukti yang nyata dan kami turunkan bersama mereka kitab dan neraca (keadilan) agar manusia dapat berlaku adil. (al-hadid/57: 25)\n\nPenutup ayat ini mendorong kita berbuat baik dan adil untuk kebahagiaan ukhrawi dan menjauhi godaan duniawi. Karena tidak diketahui kapan dunia ini kiamat, maka tentunya kita harus patuh dan taat mengikuti petunjuk Al- Qur'an, selalu berbuat adil di antara sesama manusia, mengamalkan apa-apa yang diperintahkan, selalu waspada terhadap kemungkinan panggilan Allah yang datang dengan tiba-tiba, lalu tidak ada lagi kesempatan untuk berbuat baik, merugilah dia, dan di hari Kiamat nanti dia akan menyesal karena menyia-nyiakan kesempatan yang ada untuk beramal baik. Sabda Nabi saw:\n\nRasulullah saw bersabda,\"Tidak seorang pun yang meninggal dunia melainkan ia menyesal.\"Para sahabat bertanya, Apakah penyesalan mereka wahai Rasulullah?\" Nabi menjawab,\"Jika ia seorang yang berbuat baik maka ia menyesal karena kebaikannya tidak bertambah lagi. Jika ia seorang yang tidak baik maka ia menyesal karena tidak sempat melepaskan dirinya dari kejahatan itu. (Riwayat at-Tirmidhi)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4290,
                    "inSurah": 18
                },
                "meta": {
                    "juz": 25,
                    "page": 485,
                    "manzil": 6,
                    "ruku": 420,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "يَسْتَعْجِلُ بِهَا الَّذِينَ لَا يُؤْمِنُونَ بِهَا ۖ وَالَّذِينَ آمَنُوا مُشْفِقُونَ مِنْهَا وَيَعْلَمُونَ أَنَّهَا الْحَقُّ ۗ أَلَا إِنَّ الَّذِينَ يُمَارُونَ فِي السَّاعَةِ لَفِي ضَلَالٍ بَعِيدٍ",
                    "transliteration": {
                        "en": "Yasta'jilu bihal lazeena laa yu'minoona bihaa wallazeena aamanoo mushfiqoona minhaa wa ya'lamoona annahal haqq; alaaa innal lazeena yumaaroona fis Saa'ati lafee dalaalim ba'eed"
                    }
                },
                "translation": {
                    "en": "Those who do not believe in it are impatient for it, but those who believe are fearful of it and know that it is the truth. Unquestionably, those who dispute concerning the Hour are in extreme error.",
                    "id": "Orang-orang yang tidak percaya adanya hari Kiamat meminta agar hari itu segera terjadi, dan orang-orang yang beriman merasa takut kepadanya dan mereka yakin bahwa Kiamat itu adalah benar (akan terjadi). Ketahuilah bahwa sesungguhnya orang-orang yang membantah tentang terjadinya Kiamat itu benar-benar telah tersesat jauh."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4290",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4290.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4290.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Orang-orang yang tidak percaya akan adanya hari Kiamat meminta dengan mengolok-olok agar hari itu segera terjadi jika memang betul ada dan akan datang, sedangkan orang-orang yang beriman kepada keniscayaan adanya hari akhir itu merasa takut kepadanya karena aneka ragam siksanya dan mereka yakin bahwa Kiamat itu adalah akan terjadi dan kedatangannya merupakan satu hal yang pasti. Ketahuilah bahwa sesungguhnya orang-orang yang membantah tentang terjadinya Kiamat itu dan meragukan kedatangannya benar-benar telah tersesat jauh dari kebenaran.",
                        "long": "Diriwayatkan bahwa pernah di dalam suatu kesempatan Nabi Muhammad saw menyebut-nyebut hari Kiamat dan pada waktu itu ada orang-orang musyrik. Maka mereka bertanya dengan nada mengejek dan mendustakan kedatangan hari Kiamat itu, \"Kapankah hari Kiamat itu?\" Maka turunlah ayat ini, riwayat di atas menceritakan bahwa orang-orang yang tidak percaya akan terjadinya hari Kiamat itu mengejek nabi dan ingkar kepadanya. Mereka menginginkan supaya hari Kiamat itu segera datang untuk membuktikan siapakah yang benar, mereka atau Muhammad dan sahabatnya yang benar? \n\nBerbeda halnya dengan orang-orang Mukmin. Orang-orang Mukmin merasa takut dan cemas akan kedatangan hari Kiamat. Mereka belum tahu bagaimana nasibnya pada hari itu nanti. Mereka harus mempertanggungjawabkan amal perbuatan mereka di dunia dan menerima balasan baik dan buruk dari perbuatan mereka. Sejalan dengan ayat ini firman Allah:\n\nDan mereka yang memberikan apa yang mereka berikan (sedekah) dengan hati penuh rasa takut (karena mereka tahu) bahwa sesungguhnya mereka akan kembali kepada Tuhannya. (al-Mu'minun/23: 60)\n\nAyat ini ditutup dengan satu ketegasan bahwa orang-orang yang membantah dan menolak akan adanya hari Kiamat adalah orang-orang yang sesat, salah jalan, jauh dari kebenaran.\n\nKarena percaya pada hari Kiamat merupakan salah satu rukun iman maka menafikan hari Kiamat berarti menafikan kebenaran Allah sebab keadilan yang hak hanya diperoleh manusia pada hari Kiamat, banyak sekali terjadi ketidakadilan di muka bumi ini, dimana lagi mereka yang terzalimi akan memperoleh hak-haknya kalau bukan di pengadilan Allah.\n\nOrang yang menginginkan hari akhirat dalam arti mempercayainya dan bersiap-siap menghadapinya adalah orang-orang yang memiliki visi jauh ke depan, sedangkan orang-orang yang mengingkari hari Kiamat yang menganggap kehidupannya berakhir dengan kematiannya adalah orang-orang yang visi hidupnya sempit. Mereka tidak akan pernah merasakan kepuasan rohani, karena sibuk mengejar kenikmatan duniawi.\n\nSalah satu ciri yang membedakan antara ajaran agama dan pemikiran manusia yang pernah diterapkan manusia di dunia ini adalah adanya kepercayaan pada hari akhirat atau hari Kiamat, karena bisa dikatakan inti dari iman kepada Allah, adalah iman kepada hari akhirat, tempat dan waktu dimana manusia harus mempertanggungjawabkan semua amal perbuatannya di dunia. Berita tentang hari Kiamat dan dibangkitkannya kembali orang-orang yang sudah mati itu pasti menjadi kenyataan.\n\nAllah merupakan pencipta langit dan bumi, Dia mampu dan kuasa pula menghancurkannya serta menghidupkan kembali orang-orang yang telah mati. Sebagaimana firman Allah:\n\nDan Dialah yang memulai penciptaan, kemudian mengulanginya kembali, dan itu lebih mudah bagi-Nya. (ar-Rum/30: 27)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4291,
                    "inSurah": 19
                },
                "meta": {
                    "juz": 25,
                    "page": 485,
                    "manzil": 6,
                    "ruku": 420,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "اللَّهُ لَطِيفٌ بِعِبَادِهِ يَرْزُقُ مَن يَشَاءُ ۖ وَهُوَ الْقَوِيُّ الْعَزِيزُ",
                    "transliteration": {
                        "en": "Allahu lateefum bi'ibaadihee yarzuqu mai yashaaa'u wa Huwal Qawiyyul 'Azeez"
                    }
                },
                "translation": {
                    "en": "Allah is Subtle with His servants; He gives provisions to whom He wills. And He is the Powerful, the Exalted in Might.",
                    "id": "Allah Mahalembut terhadap hamba-hamba-Nya; Dia memberi rezeki kepada siapa yang Dia kehendaki dan Dia Mahakuat, Mahaperkasa."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4291",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4291.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4291.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat ini menggambarkan beberapa sifat Allah. Sifat-sifat itu adalah bahwa Allah Mahalembut terhadap hamba-hamba-Nya dengan melimpahkan banyak rahmat dan kebaikan kepada mereka dengan sangat mudah; Dia memberi rezeki, yakni berbagai anugerah kenikmatan kepada siapa yang Dia kehendaki tanpa diskriminasi sesuai dengan upaya dan kemaslahatan mereka tanpa Dia memperhitungkan sejauh mana kebaikan hamba itu terhadap-Nya dan Dia Mahakuat terhadap segala anugerah-Nya sehingga tidak ada yang dapat menahan pemberian-Nya, Mahaperkasa terhadap segala keinginannya sehingga tidak ada yang dapat menghalanginya.",
                        "long": "Allah menerangkan bahwa Dia sendiri selalu berbuat baik kepada hamba-Nya. Dia memberi mereka hal-hal yang bermanfaat, menjauhkan mereka dari bencana yang mengancam, menganugerahkan rezeki kepada hamba-Nya yang mukmin dan yang kafir tanpa perbedaan di antara mereka. Allah juga melapangkan dan menyempitkan rezeki kepada hamba-Nya yang dikehendaki-Nya sebagai ujian bagi orang kaya dalam sikapnya terhadap orang fakir dan ujian bagi orang fakir dalam hubungannya dengan orang kaya, agar supaya hubungan antara seseorang dengan yang lain menjadi baik karena mereka saling membutuhkan. Sebagaimana firman Allah:\n\nApakah mereka yang membagi-bagi rahmat Tuhanmu? Kamilah yang menentukan penghidupan mereka dalam kehidupan dunia, dan Kami telah meninggikan sebagian mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat memanfaatkan sebagian yang lain. Dan rahmat Tuhanmu lebih baik dari apa yang mereka kumpulkan. (az-Zukhruf/43: 32)\n\nSelanjutnya dijelaskan bahwa Allah Mahakuasa dan Mahaperkasa, Dia berbuat menurut kehendak-Nya, tidak seorang pun yang dapat mencegah dan menghalangi apa yang dikehendaki-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4292,
                    "inSurah": 20
                },
                "meta": {
                    "juz": 25,
                    "page": 485,
                    "manzil": 6,
                    "ruku": 421,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مَن كَانَ يُرِيدُ حَرْثَ الْآخِرَةِ نَزِدْ لَهُ فِي حَرْثِهِ ۖ وَمَن كَانَ يُرِيدُ حَرْثَ الدُّنْيَا نُؤْتِهِ مِنْهَا وَمَا لَهُ فِي الْآخِرَةِ مِن نَّصِيبٍ",
                    "transliteration": {
                        "en": "Man kaana yureedu harsal Aakhirati nazid lahoo fee harsihee wa man kaana yureedu harsad dunyaa nu'tihee mnhaa wa maa lahoo fil Aakhirati min naseeb"
                    }
                },
                "translation": {
                    "en": "Whoever desires the harvest of the Hereafter - We increase for him in his harvest. And whoever desires the harvest of this world - We give him thereof, but there is not for him in the Hereafter any share.",
                    "id": "Barangsiapa menghendaki keuntungan di akhirat akan Kami tambahkan keuntungan itu baginya dan barangsiapa menghendaki keuntungan di dunia Kami berikan kepadanya sebagian darinya (keuntungan dunia), tetapi dia tidak akan mendapat bagian di akhirat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4292",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4292.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4292.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Pada ayat yang lalu, Allah menggambarkan orang-orang yang membantah terjadinya Kiamat, sedangkan dalam ayat ini Allah menggambarkan keuntungan di akhirat bagi orang-orang yang beriman. Barang siapa menghendaki keuntungan di akhirat melalui amal-amal yang dilakukannya di dunia ini dengan niat yang ikhlas, akan Kami tambahkan keuntungan itu baginya dengan melipatgandakan keuntungannya, dan barang siapa menghendaki keuntungan di dunia melalui usaha dan kegiatan yang hanya semata-semata ingin mendapatkan keuntungan dunia, Kami berikan kepadanya sebagian dari hasil usaha-Nya itu berupa keuntungan dunia sesuai dengan kehendak Kami, tetapi dia tidak akan mendapat bagian di akhirat kelak.",
                        "long": "Dalam ayat ini dijelaskan bahwa barang siapa yang menghendaki pahala dengan amal dan usahanya, Allah akan memudahkan baginya untuk beramal saleh, kemudian Dia mengganjar amalnya itu, satu kebaikan dengan sepuluh kebaikan sampai berlipatganda menurut kehendak Allah. Begitu pula sebaliknya, barang siapa mengharapkan dari amal usahanya kemewahan dunia dengan segala bentuknya dan tidak sedikit pun mengharapkan amalan dan pahala akhirat, maka Allah akan memberikan sebanyak apa yang telah ditentukan baginya, tetapi ia tidak akan memperoleh sedikit pun pahala akhirat karena amal itu sesuai dengan niatnya, dan bagi setiap orang balasan amalnya sesuai dengan niatnya, sebagaimana sabda Nabi saw:\n\nBahwasanya amal itu menurut niatnya, dan bahwasanya bagi setiap orang mendapat balasan sesuai dengan apa yang diniatkannya. (Riwayat al-Bukhari dan Muslim)\n\nQatadah berkata, \"Sesungguhnya Allah memberikan pahala kepada orang-orang yang amalnya diniatkan untuk akhirat selain untuk kesenangan dunia menurut kehendaknya. Allah tidak memberikan pahala di akhirat kepada orang yang beramal dengan niat memperoleh kenikmatan dunia saja.\" Hal ini sejalan dengan firman Allah:\n\nBarang siapa menghendaki kehidupan sekarang (duniawi), maka Kami segerakan baginya di (dunia) ini apa yang Kami kehendaki bagi orang yang Kami kehendaki. Kemudian Kami sediakan baginya (di akhirat) neraka Jahanam; dia akan memasukinya dalam keadaan tercela dan terusir.Dan barangsiapa menghendaki kehidupan akhirat dan berusaha ke arah itu dengan sungguh-sungguh, sedangkan dia beriman, maka mereka itulah orang yang usahanya dibalas dengan baik. (al-Isra'/17: 18-19)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4293,
                    "inSurah": 21
                },
                "meta": {
                    "juz": 25,
                    "page": 485,
                    "manzil": 6,
                    "ruku": 421,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمْ لَهُمْ شُرَكَاءُ شَرَعُوا لَهُم مِّنَ الدِّينِ مَا لَمْ يَأْذَن بِهِ اللَّهُ ۚ وَلَوْلَا كَلِمَةُ الْفَصْلِ لَقُضِيَ بَيْنَهُمْ ۗ وَإِنَّ الظَّالِمِينَ لَهُمْ عَذَابٌ أَلِيمٌ",
                    "transliteration": {
                        "en": "Am lahum shurakaaa'u shara'oo lahum minad deeni maa lam yaazam bihil laah; wa law laa kalimatul fasli laqudiya bainahum; wa innaz zaalimeena lahum 'azaabun aleem"
                    }
                },
                "translation": {
                    "en": "Or have they other deities who have ordained for them a religion to which Allah has not consented? But if not for the decisive word, it would have been concluded between them. And indeed, the wrongdoers will have a painful punishment.",
                    "id": "Apakah mereka mempunyai sesembahan selain Allah yang menetapkan aturan agama bagi mereka yang tidak diizinkan (diridai) Allah? Dan sekiranya tidak ada ketetapan yang menunda (hukuman dari Allah) tentulah hukuman di antara mereka telah dilaksanakan. Dan sungguh, orang-orang zalim itu akan mendapat azab yang sangat pedih."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4293",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4293.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4293.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Apakah mereka yang melakukan usaha untuk kepentingan dunia semata dan melupakan akhiratnya mempunyai sesembahan selain Allah yang menetapkan aturan agama bagi mereka, sehingga mereka mengikuti apa yang mereka anggap telah ditetapkan sesembahan itu yang sesungguhnya tidak di izinkan atau di ridai Allah? Dan sekiranya tidak ada ketetapan yang pasti dari Allah yang menunda datangnya hukuman itu akibat perbuatan syirik, maksiat, dan keingkaran mereka terhadap hari Kiamat itu, tentulah hukuman di antara mereka telah dilaksanakan. Dan sungguh, orang-orang zalim, yaitu orang-orang kafir itu akan mendapat azab yang sangat pedih di akhirat kelak.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa orang-orang musyrik tidak mengikuti agama Islam yang disyariatkan Allah, tetapi mengikuti apa yang digariskan oleh setan-setan mereka, baik yang berupa jin maupun berupa manusia. Mereka mengharamkan sesuatu menurut nafsu mereka seperti mengharamkan unta yang terpotong telinganya, dan menghalalkan bangkai, darah, judi, dan lain-lain. Begitu pula hal-hal yang menunjukkan kesesatan mereka yang telah dilakukan pada zaman Jahiliah. Sekalipun demikian mereka masih diberi kesempatan untuk bertobat, karena Allah telah menggariskan satu ketentuan yaitu penangguhan azab bagi mereka sampai hari Kiamat. Kalau tidak niscaya mereka itu sudah dibinasakan, sebagaimana firman Allah:\n\nBahkan hari Kiamat itulah hari yang dijanjikan kepada mereka dan hari Kiamat itu lebih dahsyat dan lebih pahit. (al-Qamar/54: 46)\n\nMereka itu telah berbuat zalim terhadap diri mereka sendiri karena telah mengada-adakan hal-hal yang tidak disyariatkan Allah. Mereka itu akan dimasukkan ke dalam neraka, satu tempat yang penuh siksa yang pedih dan seburuk-buruk tempat kembali."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4294,
                    "inSurah": 22
                },
                "meta": {
                    "juz": 25,
                    "page": 485,
                    "manzil": 6,
                    "ruku": 421,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "تَرَى الظَّالِمِينَ مُشْفِقِينَ مِمَّا كَسَبُوا وَهُوَ وَاقِعٌ بِهِمْ ۗ وَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فِي رَوْضَاتِ الْجَنَّاتِ ۖ لَهُم مَّا يَشَاءُونَ عِندَ رَبِّهِمْ ۚ ذَٰلِكَ هُوَ الْفَضْلُ الْكَبِيرُ",
                    "transliteration": {
                        "en": "Taraz zaalimeena mushfiqeena mimmaa kasaboo wa huwa waaqi'um bihim; wallazeena aamanoo wa 'amilus saalihaati fee rawdaatil jannaati lahum maa yashaaa'oona 'inda Rabbihim; zaalika huwal fadlul kabeer"
                    }
                },
                "translation": {
                    "en": "You will see the wrongdoers fearful of what they have earned, and it will [certainly] befall them. And those who have believed and done righteous deeds will be in lush regions of the gardens [in Paradise] having whatever they will in the presence of their Lord. That is what is the great bounty.",
                    "id": "Kamu akan melihat orang-orang zalim itu sangat ketakutan karena (kejahatan-kejahatan) yang telah mereka lakukan, dan (azab) menimpa mereka. Dan orang-orang yang beriman dan mengerjakan kebajikan (berada) di dalam taman-taman surga, mereka memperoleh apa yang mereka kehendaki di sisi Tuhan. Yang demikian itu adalah karunia yang besar."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4294",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4294.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4294.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kamu, wahai Nabi Muhammad dan siapa pun juga, akan melihat orang-orang zalim itu di hari Kiamat kelak sangat ketakutan atas segala sesuatu, karena perbuatan dosa dan kejahatan, yang telah mereka lakukan di dunia, dan azab Allah pasti menimpa mereka. Ini adalah kerugian yang amat besar yang di peroleh oleh orang-orang kafir. Dan engkau juga dapat melihat orang-orang yang beriman kepada Allah dan keniscayaan Kiamat itu dan mewujudkan keimanan mereka dengan mengerjakan kebajikan akan berada di dalam taman-taman surga dengan segala kenikmatannya. Mereka memperoleh apa yang mereka kehendaki di sisi Tuhan sebagai balasan atas ketaatan mereka. Yang demikian itu adalah karunia yang besar yang di anugerahkan Allah kepada mereka.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa orang-orang yang zalim itu kelihatan takut, dibayang-bayangi oleh akibat dari berbagai perbuatan jahat yang pernah dilakukannya di dunia, dan siksa yang merupakan balasan dari perbuatan jahatnya yang pasti akan menimpa mereka. Sedangkan orang-orang yang beriman kepada Allah serta taat kepada apa yang diperintahkan dan dilarang-Nya akan dimasukkan ke dalam surga, satu tempat yang penuh dengan taman-taman yang indah, menikmati segala keindahan dan kesenangan yang ada di dalamnya sesuai dengan keinginannya baik yang berupa makanan, minuman, maupun yang berupa pemandangan yang belum pernah dilihat mata, didengar telinga, dan terlintas dalam hati seorang manusia. Semuanya itu adalah suatu kenikmatan besar yang dikaruniakan Allah kepada mereka, yang jauh lebih besar dari kemewahan yang pernah ada di dunia, sebagaimana firman Allah:\n\nItulah karunia Allah, yang diberikan kepada siapa yang Dia kehendaki. Dan Allah mempunyai karunia yang besar. (al-hadid/57: 21)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4295,
                    "inSurah": 23
                },
                "meta": {
                    "juz": 25,
                    "page": 486,
                    "manzil": 6,
                    "ruku": 421,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "ذَٰلِكَ الَّذِي يُبَشِّرُ اللَّهُ عِبَادَهُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ ۗ قُل لَّا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا إِلَّا الْمَوَدَّةَ فِي الْقُرْبَىٰ ۗ وَمَن يَقْتَرِفْ حَسَنَةً نَّزِدْ لَهُ فِيهَا حُسْنًا ۚ إِنَّ اللَّهَ غَفُورٌ شَكُورٌ",
                    "transliteration": {
                        "en": "Zaalikal lazee yubash shirul laahu 'ibaadahul lazeena aamanoo wa 'amilus saalihaat; qul laaa as'alukum 'alaihi ajran illal mawaddata fil qurbaa; wa mai yaqtarif hasanatan nazid lahoo feehaa husnaa; innal laaha Ghafoorun Shakoor"
                    }
                },
                "translation": {
                    "en": "It is that of which Allah gives good tidings to His servants who believe and do righteous deeds. Say, [O Muhammad], \"I do not ask you for this message any payment [but] only good will through kinship.\" And whoever commits a good deed - We will increase for him good therein. Indeed, Allah is Forgiving and Appreciative.",
                    "id": "Itulah (karunia) yang diberitahukan Allah untuk menggembirakan hamba-hamba-Nya yang beriman dan mengerjakan kebajikan. Katakanlah (Muhammad), “Aku tidak meminta kepadamu sesuatu imbalan pun atas seruanku kecuali kasih sayang dalam kekeluargaan.” Dan barangsiapa mengerjakan kebaikan akan Kami tambahkan kebaikan baginya. Sungguh, Allah Maha Pengampun, Maha Mensyukuri."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4295",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4295.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4295.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Itulah karunia besar yang di beritahukan Allah untuk menggembirakan hamba-hamba-Nya yang beriman dan mengerjakan kebajikan yang telah di perintahkan oleh Allah dan meninggalkan larangan-larangan-Nya. Katakanlah kepada mereka yang kafir itu, wahai Nabi Muhammad, “Aku tidak akan pernah meminta kepadamu sesuatu imbalan apa pun walau sedikit atas seruanku kepadamu untuk beriman kecuali jalinan kasih sayang di antara aku dan kalian dalam kekeluargaan.” Dan barang siapa mengerjakan kebaikan dengan penuh keimanan dan ketulusan akan Kami tambahkan dengan melipat gandakan kebaikan baginya. Sungguh, Allah Maha Pengampun kepada siapa pun yang memohon ampun atas dosa-dosa yang mereka lakukan, Maha Mensyukuri kepada siapa pun dari hamba-hamba-Nya atas perbuatan baik yang telah di lakukannya sehingga Allah menambahkan pahalanya.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa apa yang telah diberitakan mengenai pemberian karunia dan kesenangan serta kemuliaan di akhirat bagi hamba-Nya yang beriman dan beramal saleh adalah satu berita gembira yang disampaikan di dunia agar jelas bagi mereka bahwa hal ini pasti menjadi kenyataan. Selanjutnya Allah memerintahkan Muhammad saw menyampaikan kepada kaumnya bahwa di dalam menjalankan tugas menyeru dan menyampaikan agama yang benar, ia tidak meminta balasan apa pun, tetapi ia hanya mengharapkan kasih sayang kaum Muslimin terhadap dirinya, kerabatnya dan kaum Muslimin lainnya.\n\nBarang siapa berbuat baik, taat, dan patuh kepada perintah Allah dan Rasul-Nya, Allah akan melipatgandakan kebaikan kepadanya. Satu kebaikan dibalas sekurang-kurangnya dengan sepuluh kebaikan, sampai tujuh ratus kebaikan bahkan lebih banyak lagi, sebagai rahmat dan karunia dari Allah, sebagaimana firman Allah:\n\nSungguh, Allah tidak akan menzalimi seseorang walaupun sebesar dharrah, dan jika ada kebajikan (sekecil dharrah), niscaya Allah akan melipatgandakannya dan memberikan pahala yang besar dari sisi-Nya. (an-Nisa'/4: 40)\n\nFirman Allah:\n\nBarang siapa berbuat kebaikan mendapat balasan sepuluh kali lipat amalnya.(al-An'am/6: 160)\n\nAllah berfirman:\n\nPerumpamaan orang yang menginfakkan hartanya di jalan Allah seperti sebutir biji yang menumbuhkan tujuh tangkai, pada setiap tangkai ada seratus biji. Allah melipatgandakan bagi siapa yang Dia kehendaki, dan Allah Mahaluas, Maha Mengetahui. (al-Baqarah/2: 261)\n\nSelanjutnya ayat 23 ini ditutup dengan satu penjelasan bahwa Allah mengampuni kesalahan hamba-Nya bagaimana pun banyaknya dan melipatgandakan pahala amal kebaikan meskipun sedikit, karena Dia adalah Tuhan Maha Pengampun lagi Maha Mensyukuri."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4296,
                    "inSurah": 24
                },
                "meta": {
                    "juz": 25,
                    "page": 486,
                    "manzil": 6,
                    "ruku": 421,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمْ يَقُولُونَ افْتَرَىٰ عَلَى اللَّهِ كَذِبًا ۖ فَإِن يَشَإِ اللَّهُ يَخْتِمْ عَلَىٰ قَلْبِكَ ۗ وَيَمْحُ اللَّهُ الْبَاطِلَ وَيُحِقُّ الْحَقَّ بِكَلِمَاتِهِ ۚ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ",
                    "transliteration": {
                        "en": "Am yaqooloonaf tara 'alal laahi kaziban fa-iny yasha il laahu yakhtim 'alaa qalbik; wa yamhul laahul baatila wa yuhiqqul haqqa bi Kalimaatih; innahoo 'Aleemum bizaatis sudoor"
                    }
                },
                "translation": {
                    "en": "Or do they say, \"He has invented about Allah a lie\"? But if Allah willed, He could seal over your heart. And Allah eliminates falsehood and establishes the truth by His words. Indeed, He is Knowing of that within the breasts.",
                    "id": "Ataukah mereka mengatakan, “Dia (Muhammad) telah mengada-adakan kebohongan tentang Allah.” Sekiranya Allah menghendaki niscaya Dia kunci hatimu. Dan Allah menghapus yang batil dan membenarkan yang benar dengan firman-Nya (Al-Qur'an). Sungguh, Dia Maha Mengetahui segala isi hati."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4296",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4296.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4296.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ataukah mereka, orang-orang kafir itu masih terus mengatakan, “Dia, Muhammad, telah mengada-adakan kebohongan tentang Allah dengan mengatakan bahwa Al-Qur’an itu adalah firman-Nya, padahal dia bukan firman-Nya.” Lalu sekiranya Allah menghendaki dengan izin dan kekuasaan-Nya niscaya Dia kunci hatimu. Dan Allah menghapus yang batil dengan cara menimbulkan sebab-sebab yang dapat menghancurkannya dan membenarkan yang benar yang di tunjukkan-Nya dengan firman-Nya, yaitu wahyu-wahyu yang di turunkannya melalui Al-Qur’an. Sungguh, Dia Maha Mengetahui segala isi hati, baik yang di nyatakan maupun yang di sembunyikan.",
                        "long": "Dalam ayat ini Allah menolak tuduhan kaum musyrik Mekah bahwa Muhammad saw itu mengada-adakan dusta terhadap Allah. Ini adalah perbuatan yang amat buruk. Seandainya Allah menghendaki, tentu Dia dapat mengunci mati hatimu karena perbuatan semacam itu, tidak dilakukan kecuali oleh orang musyrikin.\n\nTetapi sunah Allah telah berlaku dan akan terus berlaku bahwa Dia selalu menghancurkan dan menghapuskan yang batil serta menguatkan yang hak dan menanamkan hakikat yang hak itu di kalangan manusia sesuai dengan ketentuan yang telah ditetapkan-Nya. Itulah sebabnya agama yang dibawa oleh Muhammad saw hari demi hari makin bertambah kuat dan mantap, makin tersebar luas, serta semakin bertambah banyak penganutnya.\n\nAllah Maha Mengetahui semua yang tersimpan dalam hati, tidak ada yang tersembunyi bagi-Nya, maka segala sesuatu terjadi berdasarkan ilmu Allah yang amat luas, meliputi segala sesuatu. Oleh sebab itu tuduhan mereka terhadap Nabi Muhammad yang dianggap telah mengada-adakan kebohongan tentang Allah diketahui oleh-Nya dan telah dibuktikan ketidakbenarannya dalam ayat ini."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4297,
                    "inSurah": 25
                },
                "meta": {
                    "juz": 25,
                    "page": 486,
                    "manzil": 6,
                    "ruku": 421,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَهُوَ الَّذِي يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَعْفُو عَنِ السَّيِّئَاتِ وَيَعْلَمُ مَا تَفْعَلُونَ",
                    "transliteration": {
                        "en": "Wa Huwal lazee yaqbalut tawbata 'an 'ibaadihee wa ya'foo 'anis saiyiaati wa ya'lamu maa taf'aloon"
                    }
                },
                "translation": {
                    "en": "And it is He who accepts repentance from his servants and pardons misdeeds, and He knows what you do.",
                    "id": "Dan Dialah yang menerima tobat dari hamba-hamba-Nya dan memaafkan kesalahan-kesalahan dan mengetahui apa yang kamu kerjakan,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4297",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4297.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4297.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Orang-orang kafir itu harus meminta ampun kepada Allah Yang Maha Pemurah atas keyakinan mereka yang sesat dan perbuatan dosa yang telah mereka lakukan. Dan di antara kemurahan Allah adalah bahwa Dialah yang menerima tobat dari hamba-hamba-Nya yang mengakui dan meminta ampun atas kesalahannya itu dan memaafkan keburukan-keburukan yang telah di lakukan dan mengetahui apa yang kamu kerjakan, baik yang besar maupun yang kecil.",
                        "long": "Pada ayat ini Allah menerangkan bahwa Dia-lah yang menerima tobat hamba-Nya, memaafkan perbuatan dosa dan kejahatan. Sayyidina 'Ali pernah ditanya tentang tobat. Beliau menjawab, \"Tobat itu ada enam syarat.\"\n\n1. Menyesali perbuatan maksiat yang telah dikerjakan pada masa yang lalu.\n\n2. Mengerjakan ibadah wajib yang telah ditinggalkan.\n\n3. Mengembalikan hak orang yang telah diambilnya secara zalim.\n\n4. Memaksakan diri merasakan pahitnya ketaatan sebagaimana dia merasakan manisnya maksiat.\n\n5. Menundukkan hawa nafsunya dalam ketaatan sebagaimana ia telah memanjakannya dengan berbuat kemaksiatan.\n\n6. Menangis sebagai ganti gelak tawa yang pernah dilakukannya.\n\nAyat ini ditutup dengan penjelasan bahwa Allah itu Maha Mengampuni segala dosa dan mengetahui segala apa yang dikerjakan hamba-Nya baik berupa kebaikan maupun berupa kejahatan, lalu mereka dibalas dengan pahala dan siksa."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4298,
                    "inSurah": 26
                },
                "meta": {
                    "juz": 25,
                    "page": 486,
                    "manzil": 6,
                    "ruku": 421,
                    "hizbQuarter": 194,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَيَسْتَجِيبُ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ وَيَزِيدُهُم مِّن فَضْلِهِ ۚ وَالْكَافِرُونَ لَهُمْ عَذَابٌ شَدِيدٌ",
                    "transliteration": {
                        "en": "Wa yastajeebul lazeena aamanoo wa 'amilu saalihaati wa yazeeduhum min fadlih; wal kaafiroona lahum 'azaabun shadeed"
                    }
                },
                "translation": {
                    "en": "And He answers [the supplication of] those who have believed and done righteous deeds and increases [for] them from His bounty. But the disbelievers will have a severe punishment.",
                    "id": "dan Dia memperkenankan (doa) orang-orang yang beriman dan mengerjakan kebajikan serta menambah (pahala) kepada mereka dari karunia-Nya. Orang-orang yang ingkar akan mendapat azab yang sangat keras."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4298",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4298.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4298.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan di samping itu, kemurahan Allah yang lain bahwa Dia pula memperkenankan doa dan permohonan orang-orang yang beriman dan mengerjakan kebajikan yang di perintahkan Allah sebagai perwujudan imannya serta menambah pahala, kebaikan, dan ganjaran-Nya kepada mereka dari karunia-Nya lebih besar dari apa yang mereka kerjakan. Orang-orang yang ingkar, yang melanggar apa yang di perintahkan dan mengerjakan apa yang di larang akan mendapat azab yang sangat keras di hari akhirat kelak sebagai balasan atas ke ingkaran mereka.",
                        "long": "Pada ayat ini Allah menerangkan bahwa Dia senantiasa memperkenankan (doa) orang-orang yang beriman dan beramal saleh dan menambah bagi mereka pahala dan karunia, sebagaimana firman Allah:\n\nDan Tuhanmu berfirman, \"Berdoalah kepada-Ku, niscaya akan Aku perkenankan bagimu. (Gafir/40: 60)\n\nAllah berfirman:\n\nDan apabila hamba-hamba-Ku bertanya kepadamu (Muhammad) tentang Aku, maka sesungguhnya Aku dekat. Aku Kabulkan permohonan orang yang berdoa apabila dia berdoa kepada-Ku. (al-Baqarah/2: 186)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4299,
                    "inSurah": 27
                },
                "meta": {
                    "juz": 25,
                    "page": 486,
                    "manzil": 6,
                    "ruku": 421,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ وَلَوْ بَسَطَ اللَّهُ الرِّزْقَ لِعِبَادِهِ لَبَغَوْا فِي الْأَرْضِ وَلَٰكِن يُنَزِّلُ بِقَدَرٍ مَّا يَشَاءُ ۚ إِنَّهُ بِعِبَادِهِ خَبِيرٌ بَصِيرٌ",
                    "transliteration": {
                        "en": "Wa law basatal laahur rizqa li'ibaadihee labaghaw fil ardi wa laakiny yunazzilu biqadarim maa yashaaa'; innahoo bi'ibaadihee Khabeerum Baseer"
                    }
                },
                "translation": {
                    "en": "And if Allah had extended [excessively] provision for His servants, they would have committed tyranny throughout the earth. But He sends [it] down in an amount which He wills. Indeed He is, of His servants, Acquainted and Seeing.",
                    "id": "Dan sekiranya Allah melapangkan rezeki kepada hamba-hamba-Nya niscaya mereka akan berbuat melampaui batas di bumi, tetapi Dia menurunkan dengan ukuran yang Dia kehendaki. Sungguh, Dia Mahateliti terhadap (keadaan) hamba-hamba-Nya, Maha Melihat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4299",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4299.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4299.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Selain itu, kemurahan Allah adalah di bentangkannya rezeki bagi hamba-hamba-Nya. Allah menyatakan bahwa sekiranya Allah melapangkan rezeki kepada hamba-hamba-Nya dengan berbagai kenikmatan dan anugerah, baik yang bersifat materi maupun non-materi niscaya mereka akan berbuat melampaui batas di muka bumi dengan melakukan perbuatan-perbuatan yang menyimpang dari ajaran Allah dan tidak mensyukuri nikmat-nikmat-Nya. Ini sudah menjadi tabiat manusia pada umumnya. Dan tetapi Dia menurunkan rezeki-rezeki-Nya dengan ukuran tertentu yang Dia kehendaki. Sungguh, Dia Mahateliti tentang hal-hal yang mendetail terhadap semua keadaan hamba-hamba-Nya, Maha Melihat terhadap apa yang mereka lakukan dan terima.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa Dia tidak akan memberi hamba-Nya rezeki yang berlimpah-limpah, jika pemberian itu bisa membawa mereka kepada keangkuhan dan ketakaburan, sebagaimana firman Allah:\n\nSekali-kali tidak! Sungguh, manusia itu benar-benar melampaui batas, apabila melihat dirinya serba cukup. (al-'Alaq/96: 6-7)\n\nAllah memberikan rezeki kepada hamba-hamba-Nya dengan kadar tertentu, sesuai dengan kehendak dan selaras dengan kebijaksanaan-Nya. Dengan sifat rahman Allah, Dia tetap memberikan rezeki meskipun orang itu tidak beriman bahkan ketika manusia melupakan Tuhannya, saat itulah Allah melimpahkan lebih banyak lagi rezekinya. Apabila mereka tetap tidak bersyukur, dan larut dalam kesenangan, barulah Allah menjatuhkan azabnya sebagaimana firman Allah:\n\nMaka ketika mereka melupakan peringatan yang telah diberikan kepada mereka, Kami pun membukakan semua pintu (kesenangan) untuk mereka. Sehingga ketika mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka secara tiba-tiba, maka ketika itu mereka terdiam putus asa. (al-An'am/6: 44)\n\nBerdasarkan penjelasan di atas, dapat dikatakan bahwa kekayaan seseorang bukan indikator bahwa Allah sayang kepadanya, tetapi kekayaan justru menjadi batu ujian bagi keimanan seseorang. Contoh bagaimana sikap seseorang terhadap kekayaannya, dapat dilihat apakah dia menggunakannya untuk memberi manfaat bagi dirinya dan orang lain, karena keterlibatan hak orang lain pada kekayaannya dan sebagai tanda bersyukur kepada sang pemberi kekayaan, atau dia menggunakan kekayaan itu hanya untuk kesenangan dirinya dan mengklaim bahwa kekayaannya diperoleh melalui usahanya sendiri, sehingga lupa kepada Allah yang memberi kekayaan. Allah berfirman:\n\nDan ketahuilah bahwa hartamu dan anak-anakmu itu hanyalah sebagai cobaan dan sesungguhnya di sisi Allah ada pahala yang besar. (al-Anfal/8: 28)\n\nDalam hal ini, Karun dan Fir'aun menjadi contoh nyata, karena kekayaan dan kejayaannya menyebabkan keduanya sombong kepada Allah. \n\nAbu Hani' al-Khaulani berkata, \"Saya mendengar 'Amr bin Khurait dan lainnya mengatakan bahwasanya ayat ini (ayat 27 ini) diturunkan kepada ahlusuffah (penghuni beranda masjid Nabi di Medinah); mereka berangan-angan memiliki harta benda (yang bertumpuk-tumpuk), mereka mengangankan kemegahan dunia."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4300,
                    "inSurah": 28
                },
                "meta": {
                    "juz": 25,
                    "page": 486,
                    "manzil": 6,
                    "ruku": 421,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَهُوَ الَّذِي يُنَزِّلُ الْغَيْثَ مِن بَعْدِ مَا قَنَطُوا وَيَنشُرُ رَحْمَتَهُ ۚ وَهُوَ الْوَلِيُّ الْحَمِيدُ",
                    "transliteration": {
                        "en": "Wa Huwal lazee yunazzilul ghaisa mim ba'di maa qanatoo wa yanshuru rahmatah; wa Huwal Waliyyul Hameed"
                    }
                },
                "translation": {
                    "en": "And it is He who sends down the rain after they had despaired and spreads His mercy. And He is the Protector, the Praiseworthy.",
                    "id": "Dan Dialah yang menurunkan hujan setelah mereka berputus asa dan menyebarkan rahmat-Nya. Dan Dialah Maha Pelindung, Maha Terpuji."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4300",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4300.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4300.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Hal lain yang menunjukkan kemurahan Allah adalah Dialah yang menurunkan hujan dari langit setelah mereka berputus asa untuk mendapatkan air bagi kebutuhan mereka dan untuk menghadapi ke keringan yang berkepanjangan, dan Dia juga menyebarkan rahmat-Nya itu kepada semua makhluk-Nya sehingga semuanya dapat menikmati dan memperoleh manfaatnya. Dan Dialah Maha Pelindung bagi semua makhluk-Nya dari segala yang membahayakan mereka, Maha Terpuji atas segala rahmat, tindakan, dan kebijaksanaan-Nya.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa Dia-lah yang menurunkan hujan dari langit, membantu mereka yang telah berputus asa karena air yang diharapkan datang dari langit tak kunjung datang. Dia-lah yang memberi berkah hujan itu dan mendatangkan manfaat yang banyak serta menjadikan tanah subur. Dia-lah yang menguasai urusan hamba-Nya, memberikan mereka maslahat. Dia-lah yang wajib dipuji atas rahmat yang telah dikaruniakan kepada mereka.\n\nQatadah berkata, \"Diriwayatkan bahwa seorang laki-laki berkata kepada 'Umar bin al-Khaththab, \"Hujan tidak turun, manusia sudah putus asa wahai Amirul Mukminin.\" Umar menjawab, \"Engkau sekalian akan dikaruniai hujan,\" lalu beliau membaca ayat ini."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4301,
                    "inSurah": 29
                },
                "meta": {
                    "juz": 25,
                    "page": 486,
                    "manzil": 6,
                    "ruku": 421,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمِنْ آيَاتِهِ خَلْقُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَثَّ فِيهِمَا مِن دَابَّةٍ ۚ وَهُوَ عَلَىٰ جَمْعِهِمْ إِذَا يَشَاءُ قَدِيرٌ",
                    "transliteration": {
                        "en": "Wa min Aayaatihee khalqus samaawaati wal ardi wa maa bassa feehimaa min daaabbah; wa Huwa 'alaa jam'ihim izaa yashaaa'u Qadeer"
                    }
                },
                "translation": {
                    "en": "And of his signs is the creation of the heavens and earth and what He has dispersed throughout them of creatures. And He, for gathering them when He wills, is competent.",
                    "id": "Dan di antara tanda-tanda (kebesaran)-Nya adalah penciptaan langit dan bumi dan makhluk-makhluk yang melata yang Dia sebarkan pada keduanya. Dan Dia Mahakuasa mengumpulkan semuanya apabila Dia kehendaki."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4301",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4301.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4301.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ketahuilah wahai seluruh manusia bahwa di antara tanda-tanda kebesaran dan kekuasaan-Nya adalah penciptaan langit dengan segala perhiasannya dan bumi yang terhampar dengan aneka macam isinya, yang kesemuanya di ciptakan dengan bentuk dan sistem yang sangat teliti. Dan juga menjadi tanda kekuasaan-Nya adalah penciptaan makhluk-makhluk yang melata yang Dia sebarkan pada keduanya. Dan Dia Mahakuasa untuk mengumpulkan mereka semuanya apabila Dia kehendaki, di mana pun atau kapan pun.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa sebagian dari tanda-tanda kekuasaan dan kebesaran-Nya ialah diciptakan-Nya langit dan bumi serta apa yang tersebar pada keduanya seperti binatang yang melata dan bergerak termasuk manusia, jin, dan semua hewan dengan berbagai bentuk dan corak serta warnanya. \n\nAllah kuasa mengumpulkan manusia di hari kemudian, baik yang datang lebih dulu maupun yang datang kemudian, begitu juga makhluk yang lain; di Padang Mahsyar kemudian Dia akan memberikan balasan kepada mereka dengan seadil-adilnya. Sebagaimana firman Allah:\n\nDan (ingatlah) pada hari (ketika) Kami perjalankan gunung-gunung dan engkau akan melihat bumi itu rata dan Kami kumpulkan mereka (seluruh manusia), dan tidak Kami tinggalkan seorang pun dari mereka. (al-Kahf/18: 47)\n\nApabila diperhatikan ayat di atas, kita merasa bahwa Allah sedang menjelaskan mengenai adanya makhluk hidup lain di luar angkasa. Sebelum membahas ayat di atas, perlu disimak terlebih dahulu ayat terkait di bawah:\n\nDan Dia menundukkan apa yang ada di langit dan apa yang ada di bumi untukmu semuanya (sebagai rahmat) dari-Nya. Sungguh, dalam hal yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang bepikir. (al-Jatsiyah/45: 13)\n\nAyat di atas menyebutkan kata \"menundukkan\". Kata tersebut dapat diinterpretasikan bahwa manusia dapat memanfaatkan benda-benda langit, seperti planet dan bintang. Contohnya adalah bulan dan matahari yang mempunyai orbit yang teratur. Keteraturan orbit ini digunakan manusia untuk membuat penanda waktu atau penanggalan dan hal-hal lain untuk keperluan hidupnya. Contoh lain adalah mengenai datangnya besi dari luar angkasa yang secara jelas dinyatakan pada Surah al-hadid/57: 25. \n\nSecara jelas disebutkan bahwa Allah telah menciptakan galaksi, planet dan bintang dan benda langit lainnya, dan menyebarkan padanya, di antaranya, makhluk hidup sebagai hasil ciptaan-Nya. Artinya, sangatlah memungkinkan bahwa Dia mengirimkan ciptaan dari satu planet ke planet lainnya. Demikian pula halnya dengan dua ayat lain yang membahas mengenai binatang ternak yang diturunkan dari ruang angkasa (al-An'am/6:143 dan az-Zumar/39: 6)\n\nDari sudut ilmu pengetahuan, banyak pembuktian mengarah pada apa yang dijelaskan Al-Qur'an. Pada tanggal 7 Agustus 1996, para peneliti NASA (badan antariksa Amerika Serikat) mengumumkan akan adanya temuan kehidupan mikroskopis di planet Mars tiga miliar tahun yang lalu. Walaupun banyak yang menentang teori ini, namun temuan pesawat ruang angkasa Galileo akan adanya laut yang berwarna merah di bawah lapisan es di satelit planet Jupiter, Europe, sangat menjanjikan. Dalam waktu dekat akan terjawab pertanyaan tertua yang selalu tertanam dalam benak manusia: \"Apakah ada makhluk hidup di atas sana? Ataukah kita yang ada di dunia ini adalah satu-satunya makhluk hidup di alam raya?\"\n\nApabila memang ada kehidupan di atas sana, maka di manakah mereka dapat ditemukan. Tebakan kita pertama adalah di planet-planet yang ada di sana. Di \"bumi-bumi\" yang ada pada galaksi-galaksi yang ada di alam semesta. Ini dicerminkan secara Quranik pada Surah ath-thalaq/65: 12 yang menyatakan, \"Allah yang menciptakan tujuh langit dan bumi seperti mereka ......\" Dengan demikian, karena terdapat jutaan galaksi, maka Allah juga menciptakan miliaran bumi, tersebar di alam semesta. Sedangkan kata \"bumi\" yang digunakan di sini menunjukkan planet yang mempunyai kehidupan. Dengan berpegang pada pernyataan Al-Qur'an dan sedikit bukti yang diperoleh ilmu pengetahuan, kita sampai pada satu kesimpulan bahwa makhluk di luar angkasa memang ada.\n\nPertanyaan selanjutnya, apakah kita akan dapat menemukannya? Allah memberikan indikasinya pada Surah Fussilat/41: 53 \"Kami akan memperlihatkan kepada mereka tanda-tanda (ayat-ayat) Kami di segenap ufuk ....\". Indikasi ini memberikan harapan bahwa pada suatu waktu kita akan dapat bertemu dengan kehidupan extraterestrial, termasuk di dalamnya makhluk yang cerdas."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4302,
                    "inSurah": 30
                },
                "meta": {
                    "juz": 25,
                    "page": 486,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا أَصَابَكُم مِّن مُّصِيبَةٍ فَبِمَا كَسَبَتْ أَيْدِيكُمْ وَيَعْفُو عَن كَثِيرٍ",
                    "transliteration": {
                        "en": "Wa maaa asaabakum mim museebatin fabimaa kasabat aydeekum wa ya'foo 'an kaseer"
                    }
                },
                "translation": {
                    "en": "And whatever strikes you of disaster - it is for what your hands have earned; but He pardons much.",
                    "id": "Dan musibah apa pun yang menimpa kamu adalah disebabkan oleh perbuatan tanganmu sendiri, dan Allah memaafkan banyak (dari kesalahan-kesalahanmu)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4302",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4302.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4302.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Pada ayat yang lalu, Allah telah menunjukkan beberapa kebaikan sebagai anugerah yang bersumber dari-Nya. Pada ayat ini, Allah menyatakan bahwa musibah yang kamu peroleh adalah akibat perbuatanmu sendiri. Allah berfirman, “Dan musibah apa pun yang menimpa kamu, kapan dan di manapun, adalah di sebabkan oleh perbuatan tanganmu sendiri. Itu semua karena kecerobohan, kesalahan, dan kemaksiatan yang kamu lakukan sendiri, dan walaupun begitu, Allah tetap memaafkan banyak dari kesalahan-kesalahanmu itu.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa apa yang menimpa manusia di dunia berupa bencana penyakit dan lain-lainnya adalah akibat perbuatan mereka sendiri, perbuatan maksiat yang telah dilakukannya dan dosa yang telah dikerjakannya sebagaimana sabda Nabi saw:\n\n'Ali berkata, \"Maukah kalian aku beritahukan mengenai ayat yang sangat utama dalam Al-Qur'an sebagaimana Nabi saw sampaikan kepada kami.(Nabi saw membacakan firman Allah)\"Dan musibah apa pun yang menimpa kamu adalah disebabkan oleh perbuatan tanganmu sendiri, dan Allah memaafkan banyak(dari kesalahan-kesalahannya).\"Wahai 'Ali , aku akan menjelaskan ayat ini kepadamu, \"Musibah apa pun yang menimpa kamu\" yaitu dari penyakit dan siksaan atau bencana di dunia, \"disebabkan oleh perbuatan tanganmu sendiri\" (Riwayat Ahmad)\n\nTidaklah suatu keletihan, penyakit, kesusahan, kesedihan, kezaliman, kesempitan, bahkan sepotong duri pun yang menusuk seorang muslim, melainkan dengan hal itu Allah menghapus dosa-dosanya. (Riwayat al-Bukhari)\n\nDatangnya penyakit atau musibah adalah disebabkan ulah manusia itu sendiri. Tetapi di sisi lain penyakit atau musibah itu dapat menghapus dosa seperti hadis di atas. Hal itu tergantung kepada cara manusia menyikapi, apakah dengan bersabar atau berputus asa. \n\nAyat ini ditutup dengan satu ketegasan bahwa Allah mengampuni sebagian besar dari kesalahan-kesalahan yang telah diperbuat hamba-Nya sebagai satu rahmat besar yang dikaruniakan Allah kepada hamba-Nya, karena kalau tidak, niscaya manusia akan dihancurkan sesuai dengan timbunan dosa yang telah diperbuat mereka, sebagaimana firman Allah:\n\nDan kalau Allah menghukum manusia karena kezalimannya, niscaya tidak akan ada yang ditinggalkan-Nya (di bumi) dari makhluk yang melata sekalipun, tetapi Allah menangguhkan mereka sampai waktu yang sudah ditentukan. (an-Nahl/16: 61)\n\nDan firman-Nya:\n\nDan sekiranya Allah menghukum manusia disebabkan apa yang telah mereka perbuat, niscaya Dia tidak akan menyisakan satu pun makhluk bergerak yang bernyawa di bumi ini, tetapi Dia menangguhkan (hukuman)nya, sampai waktu yang sudah ditentukan. (Fathir/35: 45)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4303,
                    "inSurah": 31
                },
                "meta": {
                    "juz": 25,
                    "page": 486,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا أَنتُم بِمُعْجِزِينَ فِي الْأَرْضِ ۖ وَمَا لَكُم مِّن دُونِ اللَّهِ مِن وَلِيٍّ وَلَا نَصِيرٍ",
                    "transliteration": {
                        "en": "Wa maaa antum bimu'jizeena fil ardi wa maa lakum min doonil laahi minw wa liyyinw wa laa naseer"
                    }
                },
                "translation": {
                    "en": "And you will not cause failure [to Allah] upon the earth. And you have not besides Allah any protector or helper.",
                    "id": "Dan kamu tidak dapat melepaskan diri (dari siksaan Allah) di bumi, dan kamu tidak memperoleh pelindung atau penolong selain Allah."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4303",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4303.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4303.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan meskipun kamu memiliki kekuatan yang sangat besar, kamu tidak akan dapat melepaskan diri dari siksaan Allah, jika Allah menurunkannya untuk kalian di bumi, dan kamu tidak akan pernah memperoleh pelindung yang dapat melindungi kamu dari azab itu atau penolong yang dapat menolong kamu dari bahaya apa pun yang akan menimpamu selain Allah.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa manusia itu tidak akan dapat melepaskan diri dan tidak akan dapat mengelak dari azab Allah di dunia ini dan di mana pun mereka berada. Mereka tidak akan memperoleh pelindung, karena hanya Allah yang akan dapat melindungi mereka dari azab yang akan menimpa mereka akibat maksiat yang telah diperbuatnya. Mereka tidak akan mendapat penolong selain dari Allah apabila mereka mendapat azab. Oleh karena itu, selayaknya manusia menjauhkan diri dari maksiat dan tidak menyalahi perintah-Nya karena tidak ada seorang pun yang dapat menolak azab Allah, apabila Dia telah menjatuhkan azab kepada hamba-Nya. Kalau manusia yang bergelimang dosa itu tidak diazab di dunia, jangan dikira bahwa itu adalah karena kekuasaan atau keperkasaan seseorang, tetapi adalah karena Allah menghendaki yang demikian itu agar mereka mendapat siksaan lebih keras dan lebih pedih di akhirat, sebagaimana firman Allah:\n\nDan jangan sekali-kali orang-orang kafir itu mengira bahwa tenggang waktu yang Kami berikan kepada mereka lebih baik baginya. Sesungguhnya tenggang waktu yang Kami berikan kepada mereka hanyalah agar dosa mereka semakin bertambah; dan mereka akan mendapat azab yang menghinakan. (Ali 'Imran/3: 178)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4304,
                    "inSurah": 32
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمِنْ آيَاتِهِ الْجَوَارِ فِي الْبَحْرِ كَالْأَعْلَامِ",
                    "transliteration": {
                        "en": "Wa min Aayaatihil ja waarifil bahri kal a'lam"
                    }
                },
                "translation": {
                    "en": "And of His signs are the ships in the sea, like mountains.",
                    "id": "Dan di antara tanda-tanda (kebesaran)-Nya ialah kapal-kapal (yang berlayar) di laut seperti gunung-gunung."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4304",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4304.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4304.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan di antara tanda-tanda kebesaran dan kekuasaan-Nya ialah kapal-kapal yang beraneka macam yang berlayar di laut dengan aneka muatan dan penumpang di dalamnya, bagaikan gunung-gunung yang menjulang tinggi.",
                        "long": "Pada ayat ini Allah menerangkan bahwa sebagian dari tanda-tanda kekuasaan, kebesaran dan keperkasaan-Nya ialah ditundukkan-Nya laut bagi manusia hingga kapal bisa berlayar di laut laksana gunung besar atau satu perkampungan di atas air.\n\nAyat ini mengibaratkan kapal-kapal berlayar seperti gunung-gunung. Ayat ini mengisyaratkan pula, bahwa sesungguhnya gunung-gunung itu juga bergerak, sesuatu yang sulit dicerna bagi orang awam, namun sesuatu yang sudah diterima dalam ilmu geologi. Seperti sering dikatakan oleh para ahli geologi bahwa gunung-gunung sesungguhnya mengapung seperti laiknya kapal-kapal mengapung di samudra. Dalam ayat ini, Allah justru memperlihatkan bahwa kapal yang berlayar itu ibarat gunung, yang bagi orang awam tentu sulit memahaminya. Bagi orang awam gunung-gunung itu tampak diam. Gunung-gunung (dalam hal ini sebagai bagian kontinen/benua) pada kenyataannya memang mengapung di atas astenosfer dan bergerak seperti halnya kapal yang berlayar (lihat penjelasan pada Juz 20, An-Naml/27: 88). Seperti diketahui baru pada dekade tahun enampuluhan abad ke-20 teori apungan benua, yang cikal bakalnya sudah dimulai pada awal abad 20, bersama teori pemekaran tengah samudra melandasi teori tektonik lempeng ditemukan para ilmuwan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4305,
                    "inSurah": 33
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِن يَشَأْ يُسْكِنِ الرِّيحَ فَيَظْلَلْنَ رَوَاكِدَ عَلَىٰ ظَهْرِهِ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّكُلِّ صَبَّارٍ شَكُورٍ",
                    "transliteration": {
                        "en": "Iny yashaaa yuskinir reeha fa yazlalna rawaakida 'alaa zahirh; inna fee zaalika la Aayaatil likulli sabbaarin shakoor"
                    }
                },
                "translation": {
                    "en": "If He willed, He could still the wind, and they would remain motionless on its surface. Indeed in that are signs for everyone patient and grateful.",
                    "id": "Jika Dia menghendaki, Dia akan menghentikan angin, sehingga jadilah (kapal-kapal) itu terhenti di permukaan laut. Sungguh, pada yang demikian itu terdapat tanda-tanda (kekuasaan Allah) bagi orang yang selalu bersabar dan banyak bersyukur,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4305",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4305.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4305.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Jika Dia, Allah, menghendaki, Dia akan menghentikan angin yang mendorong kapal-kapal itu dalam pelayarannya, sehingga jadilah kapal-kapal itu terhenti, tidak akan bergerak, dan tidak pula akan dapat berlayar di permukaan laut hingga sampai ke tempat tujuannya. Sungguh, pada yang demikian itu, yaitu berhenti dan berlayarnya kapal itu, terdapat tanda-tanda ke kuasaan Allah bagi orang yang selalu bersabar menerima musibah dan kesulitan dan banyak bersyukur menerima ke nikmatan dan ke senangan yang di anugerahkan Allah,",
                        "long": "Seandainya Allah menghendaki kapal yang berlayar tadi tidak dapat berlayar lagi, maka Dia akan menahan angin yang mendorong kapal tadi bergerak dan berlayar, dan tinggallah kapal itu tetap di permukaan air tidak dapat maju atau mundur. \n\nOrang-orang yang dapat mengerti dan menyadari hal ini ialah orang-orang yang mempunyai pandangan luas, sabar dan patuh kepada perintah Allah senantiasa mensyukuri nikmat yang dikaruniakan Allah kepadanya. Adanya bencana yang terjadi pada suatu tempat berupa gempa bumi, tanah longsor, ombak yang menghanyutkan dan membinasakan, dan lain-lain dianggap oleh sebagian orang hanya kejadian alam yang tidak ada hubungan sedikit pun dengan kekuasaan Allah. Firman Allah:\n\nDan berapa banyak tanda-tanda (kebesaran Allah) di langit dan di bumi yang mereka lalui, namun mereka berpaling daripadanya. (Yusuf/12: 105)\n\nAyat ini merupakan kelanjutan ayat sebelumnya (asy-Syura/42: 32), bahwa setelah berhasil mengapung di atas air, kapal tradisional memerlukan energi angin sebagai penggerak. Dengan adanya angin kapal layar dapat terdorong dan dengannya dapat pula dikendalikan melalui penggunaan layar dan kemudi. Apabila hembusan angin terhenti maka praktis kapal tidak dapat bergerak. Dengan tidak adanya angin gelombang laut pun akan terhenti pula."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4306,
                    "inSurah": 34
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَوْ يُوبِقْهُنَّ بِمَا كَسَبُوا وَيَعْفُ عَن كَثِيرٍ",
                    "transliteration": {
                        "en": "Aw yoobiqhunna bimaa kasaboo wa ya'fu 'an kaseer"
                    }
                },
                "translation": {
                    "en": "Or He could destroy them for what they earned; but He pardons much.",
                    "id": "atau (Dia akan) menghancurkan kapal-kapal itu karena perbuatan (dosa) mereka, dan Dia memaafkan banyak (dari mereka),"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4306",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4306.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4306.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "atau Dia akan menghancurkan kapal-kapal itu bersama dengan muatan dan penumpang yang ada di dalamnya dengan cara mengirimkan badai yang sangat besar karena pelanggaran dan perbuatan dosa yang mereka lakukan. Dan Dia memaafkan banyak dari mereka dan dosa-dosa mereka.",
                        "long": "Pada ayat ini diterangkan bahwa selain Allah kuasa menahan angin sehingga kapal itu tidak dapat beranjak dari tempatnya, Dia juga kuasa menghancurkan kapal itu dengan mengirimkan angin topan yang menjadikan kapal yang berlayar itu oleng, tak menentu arah yang ditempuh, tak akan sampai ke sasaran yang dituju, akhirnya tenggelam ke dasar laut akibat penumpangnya yang bergelimang dosa. Tetapi, yang demikian itu jarang terjadi karena Allah telah memberi maaf dan mengampuni sebagian besar dari mereka, sehingga mereka selamat dalam perjalanannya mengarungi laut yang luas ke tempat yang dituju."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4307,
                    "inSurah": 35
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَيَعْلَمَ الَّذِينَ يُجَادِلُونَ فِي آيَاتِنَا مَا لَهُم مِّن مَّحِيصٍ",
                    "transliteration": {
                        "en": "Wa ya'lamal lazeena yujaadiloona feee Aayaatinaa maa lahum mim mahees"
                    }
                },
                "translation": {
                    "en": "And [that is so] those who dispute concerning Our signs may know that for them there is no place of escape.",
                    "id": "dan agar orang-orang yang membantah tanda-tanda (kekuasaan) Kami mengetahui bahwa mereka tidak akan memperoleh jalan keluar (dari siksaan)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4307",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4307.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4307.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "“Semua kebesaran dan kekuasaan Kami itu,” kata Allah, “Ditunjukkan kepada mereka agar orang-orang yang selalu membantah tanda-tanda kekuasaan Kami mengetahui dan menyadari bahwa mereka berada di bawah kekuasaan Kami dan tidak akan memperoleh jalan keluar dan menghindarkan diri dari siksaan Kami.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa hal-hal yang telah digambarkan di atas itu menunjukkan kekuasaan dan keperkasaan-Nya; kiranya orang-orang yang selalu membantah dan tidak mau mengakui kekuasaan Allah dapat menyadari bahwa yang dapat memberikan manfaat dan mendatangkan mudarat tidak lain hanyalah Allah dan kalau Dia menghendaki, maka tidak seorang pun yang dapat menghindar atau luput dari azab yang telah ditetapkannya itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4308,
                    "inSurah": 36
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَمَا أُوتِيتُم مِّن شَيْءٍ فَمَتَاعُ الْحَيَاةِ الدُّنْيَا ۖ وَمَا عِندَ اللَّهِ خَيْرٌ وَأَبْقَىٰ لِلَّذِينَ آمَنُوا وَعَلَىٰ رَبِّهِمْ يَتَوَكَّلُونَ",
                    "transliteration": {
                        "en": "Famaa ooteetum min shai'in famataa'ul hayaatid dunyaa wa maa 'indal laahi khairunw wa abqaa lillazeena aamanoo wa 'alaa Rabbihim yatawakkaloon"
                    }
                },
                "translation": {
                    "en": "So whatever thing you have been given - it is but [for] enjoyment of the worldly life. But what is with Allah is better and more lasting for those who have believed and upon their Lord rely",
                    "id": "Apa pun (kenikmatan) yang diberikan kepadamu, maka itu adalah kesenangan hidup di dunia. Sedangkan apa (kenikmatan) yang ada di sisi Allah lebih baik dan lebih kekal bagi orang-orang yang beriman, dan hanya kepada Tuhan mereka bertawakal,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4308",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4308.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4308.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sesuatu apa pun yang di berikan kepadamu dari ke nikmatan lahiriah, seperti rezeki harta atau ke nikmatan lain yang di peroleh di dunia ini, maka itu adalah ke senangan hidup di dunia yang di nikmati buat sementara, tidak kekal abadi. Sedangkan apa, yaitu ke nikmatan, yang ada di sisi Allah, yang di anugerahkan kepadamu sebagai balasan atas segala kebaikan yang telah di lakukan di dunia lebih baik dari semua ke nikmatan lahiriah duniawi itu dan lebih kekal di nikmati bagi orang-orang yang beriman. Ke nikmatan duniawi akan berakhir karena kematian dan hanya kepada Tuhan mereka, mereka bertawakal, yaitu berserah diri dan menyerahkan segala urusannya setelah mengusahakannya dengan segala kemampuannya.",
                        "long": "Pada ayat ini Allah menerangkan bahwa kesenangan hidup manusia baik berupa kekayaan, rezeki harta yang bertumpuk, maupun keturunan dan lain-lain adalah kesenangan yang tidak berarti dan kurang bernilai karena bagaimana pun menumpuknya harta, waktu untuk memilikinya terbatas. Pada waktunya nanti akan berpisah karena kalau bukan manusia yang meninggalkannya, maka benda-benda itu sendiri yang akan meninggalkan manusia, sedangkan pahala dan nikmat yang ada pada sisi Allah jauh lebih baik dibandingkan dengan kesenangan dan kemegahan dunia itu, karena apa yang ada di sisi Allah kekal dan abadi, sedangkan kesenangan dunia semuanya fana dan akan lenyap. Ayat ini ditutup dengan satu ketegasan bahwa kesenangan yang kekal dan abadi itu hanya untuk orang-orang yang beriman kepada Allah dan Rasul-Nya, orang-orang yang bertawakal dan berserah diri kepada Tuhan yang telah memelihara dan berbuat baik kepada mereka.\n\nAl-Qurthubi dalam tafsirnya menukil riwayat dari 'Ali yang mengatakan bahwa ketika Abu Bakar mengumpulkan harta dari Bani Murrah beliau mendermakan seluruh uang tersebut untuk kebaikan karena mengharapkan keridaan Allah. Perbuatannya tersebut dicela oleh orang-orang musyrikin sedangkan orang-orang kafir menyalahkan tindakannya, maka turunlah ayat 36 dan 37 surah ini."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4309,
                    "inSurah": 37
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِينَ يَجْتَنِبُونَ كَبَائِرَ الْإِثْمِ وَالْفَوَاحِشَ وَإِذَا مَا غَضِبُوا هُمْ يَغْفِرُونَ",
                    "transliteration": {
                        "en": "Wallazeena yajtaniboona kabaaa'iral ismi wal fawaa hisha wa izaa maa ghadiboo hum yaghfiroon"
                    }
                },
                "translation": {
                    "en": "And those who avoid the major sins and immoralities, and when they are angry, they forgive,",
                    "id": "dan juga (bagi) orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji, dan apabila mereka marah segera memberi maaf,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4309",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4309.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4309.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan juga kenikmatan-kenikmatan ukhrawi itu lebih baik dan lebih kekal bagi orang-orang yang menjauhi dosa-dosa besar dan perbuatan-perbuatan keji, dan apabila mereka marah yang disebabkan oleh karena perbuatan buruk yang di lakukan oleh orang lain terhadap mereka, segera memberi maaf atas kesalahannya itu.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa yang akan memperoleh kesenangan yang abadi di akhirat nanti ialah orang-orang yang menjauhi dosa-dosa besar seperti membunuh, berzina dan mencuri, serta menghindarkan hal-hal yang tidak dibenarkan syarak, akal sehat, dan akhlak mulia baik berupa ucapan maupun berupa perbuatan. Begitu juga orang-orang yang apabila amarahnya timbul, mereka diam menahan amarahnya, memaafkan orang yang menyebabkan kemarahannya dan tidak ada dalam batinnya sedikit pun rasa dendam. Diriwayatkan bahwa Rasulullah saw tidak pernah membela kepentingan dirinya kecuali apabila hukum-hukum Allah dilanggar dan dihinakan. \n\nSifat pemaaf adalah sifat yang dekat kepada takwa dan memang diperintah Allah, sebagaimana firman-Nya:\n\nPembebasan itu lebih dekat kepada takwa. (al-Baqarah/2: 237)\n\nDan firman-Nya:\n\nJadilah pemaaf dan suruhlah orang mengerjakan yang makruf, serta jangan pedulikan orang-orang yang bodoh. (al-A'raf/7: 199)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4310,
                    "inSurah": 38
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِينَ اسْتَجَابُوا لِرَبِّهِمْ وَأَقَامُوا الصَّلَاةَ وَأَمْرُهُمْ شُورَىٰ بَيْنَهُمْ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ",
                    "transliteration": {
                        "en": "Wallazeenas tajaaboo li Rabbhim wa aqaamus Salaata wa amruhum shooraa bainahum wa mimmaa razaqnaahum yunfiqoon"
                    }
                },
                "translation": {
                    "en": "And those who have responded to their lord and established prayer and whose affair is [determined by] consultation among themselves, and from what We have provided them, they spend.",
                    "id": "dan (bagi) orang-orang yang menerima (mematuhi) seruan Tuhan dan melaksanakan salat, sedang urusan mereka (diputuskan) dengan musyawarah antara mereka; dan mereka menginfakkan sebagian dari rezeki yang Kami berikan kepada mereka,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4310",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4310.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4310.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat yang lalu menjelaskan kenikmatan ukhrawi yang diperoleh oleh orang-orang yang menghindarkan diri dari perbuatan dosa besar. Ayat ini juga menerangkan bahwa kenikmatan ukhrawi yang lebih baik dan lebih kekal itu juga akan diperoleh oleh orang-orang yang menerima seruan Tuhan mereka. Dan kenikmatan ukhrawi itu akan di anugerahkan pula kepada orang-orang yang menerima dan mematuhi seruan Tuhan melalui para rasul dan wahyu-wahyu yang di sampaikan kepada mereka dan orang-orang yang melaksanakan salat, sebagai salah satu kewajiban yang diwajibkan kepada mereka, sedang urusan mereka yang berkaitan dengan persoalan dunia dan kemaslahatan kehidupan mereka, diputuskan dengan musyawarah antara mereka. Dan yang juga menerima kenikmatan ukhrawi itu adalah mereka yang menginfakkan di jalan Allah dengan tulus dan ikhlas sebagian dari rezeki mereka, baik dalam bentuk harta maupun lainnya yang Kami berikan kepada mereka.",
                        "long": "Ayat ini menerangkan bahwa orang-orang yang menyambut baik panggilan Allah kepada agama-Nya seperti mengesakan dan menyucikan Zat-Nya dari penyembahan selain Dia, mendirikan salat fardu pada waktunya dengan sempurna untuk membersihkan hati dari iktikad batil dan menjauhkan diri dari perbuatan mungkar, baik yang tampak maupun yang tidak tampak, selalu bermusyawarah untuk menentukan sikap di dalam menghadapi hal-hal yang pelik dan penting, kesemuanya akan mendapatkan kesenangan yang kekal di akhirat . Dalam ayat yang serupa, Allah berfirman:\n\nDan bermusyawarahlah dengan mereka dalam urusan itu. (Ali 'Imran/3: 159)\n\nDemikian pula menginfakkan rezeki di jalan Allah, membelanjakannya di jalan yang berguna dan bermanfaat bagi pribadi, masyarakat, nusa, dan bangsa. Mereka juga akan mendapatkan kesenangan yang kekal di akhirat. Dalam ayat lain Allah berfirman:\n\nWahai orang-orang yang beriman! Infakkanlah sebagian dari rezeki yang telah Kami berikan kepadamu. (al-Baqarah/2: 254)\n\nDan firman-Nya:\n\nWahai orang-orang yang beriman! Infakkanlah sebagian dari hasil usahamu yang baik-baik. (al-Baqarah/2: 267)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4311,
                    "inSurah": 39
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِينَ إِذَا أَصَابَهُمُ الْبَغْيُ هُمْ يَنتَصِرُونَ",
                    "transliteration": {
                        "en": "Wallazeena izaa asaabahumul baghyu hum yantasiroon"
                    }
                },
                "translation": {
                    "en": "And those who, when tyranny strikes them, they defend themselves,",
                    "id": "dan (bagi) orang-orang yang apabila mereka diperlakukan dengan zalim, mereka membela diri."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4311",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4311.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4311.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat-ayat yang lalu menjelaskan beberapa golongan yang akan mendapatkan kenikmatan ukhrawi dari Allah. Di dalam ayat ini, Allah memerintahkan untuk membela diri kepada orang-orang yang di zalimi. Dan orang-orang yang apabila mereka di perlakukan dengan zalim, yaitu tindakan yang melampaui batas oleh orang lain, mereka sendiri dengan segala kekuatan dan kemampuannya membela diri sesuai dengan kondisi yang mereka hadapi.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa di antara sifat orang-orang yang akan memperoleh kebahagiaan yang kekal abadi di akhirat ialah orang-orang yang apabila diperlakukan semena-mena oleh orang lain, ia akan membela diri dan membalas kepada orang yang menzaliminya tersebut, dengan syarat pembelaan diri tersebut tidak melampaui kezaliman yang menimpanya. Dalam pembelaan diri ini mereka akan mendapat pertolongan dari Allah, sebagaimana firman-Nya: \n\nDemikianlah, dan barang siapa membalas seimbang dengan (kezaliman) penganiayaan yang pernah dia derita kemudian dia dizalimi (lagi), pasti Allah akan menolongnya. (al-hajj/22: 60)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4312,
                    "inSurah": 40
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَجَزَاءُ سَيِّئَةٍ سَيِّئَةٌ مِّثْلُهَا ۖ فَمَنْ عَفَا وَأَصْلَحَ فَأَجْرُهُ عَلَى اللَّهِ ۚ إِنَّهُ لَا يُحِبُّ الظَّالِمِينَ",
                    "transliteration": {
                        "en": "Wa jazaaa'u saiyi'atin saiyi'tum misluha faman 'afaa wa aslaha fa ajruhoo 'alal laah; innahoo laa yuhibbuz zaalimeen"
                    }
                },
                "translation": {
                    "en": "And the retribution for an evil act is an evil one like it, but whoever pardons and makes reconciliation - his reward is [due] from Allah. Indeed, He does not like wrongdoers.",
                    "id": "Dan balasan suatu kejahatan adalah kejahatan yang setimpal, tetapi barangsiapa memaafkan dan berbuat baik (kepada orang yang berbuat jahat) maka pahalanya dari Allah. Sungguh, Dia tidak menyukai orang-orang zalim."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4312",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4312.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4312.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan balasan dari suatu kejahatan apa pun adalah kejahatan yang setimpal dan seimbang dengan kejahatan itu demi mencapai keadilan, tetapi barang siapa memaafkan pelaku dan perbuatan zalim yang di lakukannya dan berbuat baik kepada orang yang berbuat jahat itu, maka pahalanya akan di perolehnya dengan jaminan dari Allah. Sungguh, Dia tidak menyukai, yaitu tidak melimpahkan rahmat-Nya, kepada orang-orang zalim.",
                        "long": "Dalam ayat ini Allah menjelaskan bahwa perbuatan membela diri yang dilakukan seseorang yang dianiaya orang lain hendaklah ditujukan kepada pelaku penganiayaan dan seimbang dengan berat ringannya penganiayaan tersebut. Tindakan balasan atau pembelaan diri yang berlebihan tidak dibenarkan agama, hal ini sesuai dengan firman Allah:\n\nBarang siapa menyerang kamu, maka seranglah dia setimpal dengan serangannya terhadap kamu. (al-Baqarah/2: 194)\n\nDi ayat lain Allah berfirman:\n\nDan jika kamu membalas, maka balaslah dengan (balasan) yang sama dengan siksaan yang ditimpakan kepadamu. Tetapi jika kamu bersabar, sesungguhnya itulah yang lebih baik bagi orang yang sabar. (an-Nahl/16: 126)\n\nDalam situasi saat ini orang-orang yang teraniaya oleh orang lain, mungkin tidak bisa langsung membela diri atau menuntut haknya kepada orang-orang yang menganiayanya karena berbagai keterbatasannya, maka ia bisa meminta pertolongan pihak-pihak berwajib yang bisa melakukan tindakan untuk membela haknya, seperti polisi, pengadilan dan sebagainya. Perlu diingatkan bahwa hak seseorang harus dipertahankan, jangan hanya berdiam diri ketika orang lain merampas haknya. Banyak hadis yang menerangkan tentang hak-hak seperti:\n\nSiapa yang terbunuh karena mempertahankan hartanya, maka ia adalah seorang yang syahid. Siapa yang terbunuh karena mempertahankan (keselamatan)nyawa, keluarga, dan agamanya, maka ia adalah seorang yang syahid. (Riwayat Abu Dawud dan at-Tirmidhi)\n\nSekalipun demikian, ayat ini juga menganjurkan untuk tidak membalas kejahatan orang lain, tetapi memaafkan dan memperlakukan dengan baik orang yang berbuat jahat kepada kita karena Allah akan memberikan pahala kepada orang-orang yang memaafkan kesalahan orang lain, selain itu memaafkan orang lain adalah penebus dosa. Firman Allah:\n\nDan luka-luka (pun) ada qisas-nya (balasan yang sama). Barangsiapa melepaskan (hak qisas)nya, maka itu (menjadi) penebus dosa baginya. (al-Ma'idah/5: 45)\n\nAyat 40 ini ditutup dengan satu penegasan bahwa Allah tidak menyukai orang-orang yang zalim yang melampaui batas di dalam melakukan pembalasan atas kejahatan yang pernah dialaminya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4313,
                    "inSurah": 41
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَمَنِ انتَصَرَ بَعْدَ ظُلْمِهِ فَأُولَٰئِكَ مَا عَلَيْهِم مِّن سَبِيلٍ",
                    "transliteration": {
                        "en": "Wa lamanin tasara ba'da zulmihee fa ulaaa'ika maa 'alaihim min sabeel"
                    }
                },
                "translation": {
                    "en": "And whoever avenges himself after having been wronged - those have not upon them any cause [for blame].",
                    "id": "Tetapi orang-orang yang membela diri setelah dizalimi, tidak ada alasan untuk menyalahkan mereka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4313",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4313.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4313.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Tetapi orang-orang yang telah berusaha membela diri mereka setelah di zalimi, tidak ada alasan untuk menyalahkan dan mengecam mereka.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa orang yang berbuat sesuatu karena membela diri dari satu penganiayaan atau suatu kejahatan yang menimpanya, tidak ada jalan untuk menuntutnya dari sisi hukum dan ia tidak berdosa karena dia melakukannya berdasarkan hak. Tetapi orang-orang yang berbuat zalim, berbuat kejahatan di muka bumi dan melampaui batas dalam memberikan pembalasan, mereka itulah yang dapat dituntut dan akan mendapat azab dan siksa yang pedih di akhirat kelak."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4314,
                    "inSurah": 42
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَظْلِمُونَ النَّاسَ وَيَبْغُونَ فِي الْأَرْضِ بِغَيْرِ الْحَقِّ ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ أَلِيمٌ",
                    "transliteration": {
                        "en": "Innamas sabeelu 'alal lazeena yazlimoonan naasa wa yabghoona fil ardi bighairil haqq; ulaaa'ika lahum 'azaabun aleem"
                    }
                },
                "translation": {
                    "en": "The cause is only against the ones who wrong the people and tyrannize upon the earth without right. Those will have a painful punishment.",
                    "id": "Sesungguhnya kesalahan hanya ada pada orang-orang yang berbuat zalim kepada manusia dan melampaui batas di bumi tanpa (mengindahkan) kebenaran. Mereka itu mendapat siksa yang pedih."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4314",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4314.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4314.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sesungguhnya jalan untuk menyatakan kesalahan dan perbuatan dosa hanya ada pada orang-orang yang berbuat zalim kepada manusia dan melampaui batas di muka bumi tanpa mengindahkan kebenaran. Mereka itu mendapat siksa yang pedih atas perbuatan mereka di hari akhirat kelak.",
                        "long": "Dalam ayat ini Allah menolak tuduhan kaum musyrik Mekah bahwa Muhammad saw itu mengada-adakan dusta terhadap Allah. Ini adalah perbuatan yang amat buruk. Seandainya Allah menghendaki, tentu Dia dapat mengunci mati hatimu karena perbuatan semacam itu, tidak dilakukan kecuali oleh orang musyrikin.\n\nTetapi sunah Allah telah berlaku dan akan terus berlaku bahwa Dia selalu menghancurkan dan menghapuskan yang batil serta menguatkan yang hak dan menanamkan hakikat yang hak itu di kalangan manusia sesuai dengan ketentuan yang telah ditetapkan-Nya. Itulah sebabnya agama yang dibawa oleh Muhammad saw hari demi hari makin bertambah kuat dan mantap, makin tersebar luas, serta semakin bertambah banyak penganutnya.\n\nAllah Maha Mengetahui semua yang tersimpan dalam hati, tidak ada yang tersembunyi bagi-Nya, maka segala sesuatu terjadi berdasarkan ilmu Allah yang amat luas, meliputi segala sesuatu. Oleh sebab itu tuduhan mereka terhadap Nabi Muhammad yang dianggap telah mengada-adakan kebohongan tentang Allah diketahui oleh-Nya dan telah dibuktikan ketidakbenarannya dalam ayat ini."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4315,
                    "inSurah": 43
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 422,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَمَن صَبَرَ وَغَفَرَ إِنَّ ذَٰلِكَ لَمِنْ عَزْمِ الْأُمُورِ",
                    "transliteration": {
                        "en": "Wa laman sabara wa ghafara inna zaalika lamin 'azmil umoor"
                    }
                },
                "translation": {
                    "en": "And whoever is patient and forgives - indeed, that is of the matters [requiring] determination.",
                    "id": "Tetapi barangsiapa bersabar dan memaafkan, sungguh yang demikian itu termasuk perbuatan yang mulia."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4315",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4315.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4315.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Akan tetapi, barang siapa bersabar terhadap kezaliman dengan tidak melakukan pembalasan atas kezaliman itu dan memaafkannya, sungguh yang demikian itu termasuk perbuatan yang mulia.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa orang-orang yang sabar dan memaafkan perbuatan jahat yang dilakukan orang lain atas dirinya, sedangkan ia sanggup membalasnya, mereka itu telah melakukan sesuatu yang utama dan mereka itu berhak menerima pahala yang banyak. \n\nDiriwayatkan oleh Abu Hurairah bahwa seorang laki-laki mencaci maki Abu Bakar, sedangkan Nabi duduk bersamanya, tersenyum, begitu banyak caci maki itu sehingga Abu Bakar membalas caci maki tersebut. Kemudian Nabi marah dan bangun dari duduknya, lalu Abu Bakar mengikutinya dan berkata, \"Ya Rasulullah, dia telah mencaci makiku sedangkan engkau duduk (melihatnya), ketika aku membalas caci makinya engkau marah dan bangkit (meninggalkanku).\" Rasul kemudian menjawab, \"Sesungguhnya (ketika engkau dicaci) malaikat ada bersamamu membalas caci maki orang tersebut, ketika engkau membalas caci maki itu, hadirlah setan (disitu), maka aku tidak mau duduk bersama setan.\" Kemudian Rasul bersabda, Ya Abu Bakar, ada 3 hal yang semuanya benar, yaitu:\n\n1. Seorang hamba dianiaya, lalu dia memaafkan penganiayanya itu, maka ia akan dimuliakan Allah dan dimenangkan atas musuhnya.\n\n2. Seorang laki-laki yang memberikan suatu pemberian dengan maksud mengeratkan hubungan silaturahmi akan diberi Allah tambahan rezeki yang banyak.\n\n3. Orang-orang yang minta-minta dengan maksud memperkaya diri akan dikurangi Allah rezekinya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4316,
                    "inSurah": 44
                },
                "meta": {
                    "juz": 25,
                    "page": 487,
                    "manzil": 6,
                    "ruku": 423,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِن وَلِيٍّ مِّن بَعْدِهِ ۗ وَتَرَى الظَّالِمِينَ لَمَّا رَأَوُا الْعَذَابَ يَقُولُونَ هَلْ إِلَىٰ مَرَدٍّ مِّن سَبِيلٍ",
                    "transliteration": {
                        "en": "Wa mai yudlilil laahu famaa lahoo minw waliyyim mim ba'dih; wa taraz zaalimeena lammaa ra awul 'azaaba yaqooloona hal ilaa maraddim min sabeel"
                    }
                },
                "translation": {
                    "en": "And he whom Allah sends astray - for him there is no protector beyond Him. And you will see the wrongdoers, when they see the punishment, saying, \"Is there for return [to the former world] any way?\"",
                    "id": "Dan barangsiapa dibiarkan sesat oleh Allah, maka tidak ada baginya pelindung setelah itu. Kamu akan melihat orang-orang zalim ketika mereka melihat azab berkata, “Adakah kiranya jalan untuk kembali (ke dunia)?”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4316",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4316.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4316.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan barang siapa dibiarkan sesat oleh Allah akibat kecenderungan dan keinginan hatinya untuk sesat, maka tidak ada baginya pelindung yang dapat melindunginya dari kesesatan itu sesudahnya, sesudah Allah memperlakukannya dengan perlakuan itu. Kamu, wahai Nabi Muhammad dan orang-orang beriman, akan melihat orang-orang zalim ketika mereka melihat azab yang akan di terimanya di akhirat kelak berkata, “Adakah kiranya jalan yang dapat mengantarkan kami untuk kembali ke alam dunia?”",
                        "long": "Pada ayat ini Allah menerangkan bahwa apa yang dikehendaki-Nya pasti menjadi kenyataan dan tak seorang pun yang dapat menghalangi-Nya; sebaliknya apa yang tidak dikehendaki-Nya, tidak akan terjadi. Barang siapa yang telah diberi petunjuk oleh Allah tidak akan ada yang menyesatkannya, dan barang siapa yang telah dibiarkan sesat oleh Allah, karena selalu berbuat kejahatan tidak akan ada seorang pun yang dapat memberinya petunjuk ke jalan yang benar, yang akan membantunya dia mencapai kebahagiaan dan keberuntungan. Firman Allah:\n\nDan barang siapa disesatkan-Nya, maka engkau tidak akan mendapatkan seorang penolong yang dapat memberi petunjuk kepadanya. (al-Kahf/18: 17)\n\nOrang-orang kafir di akhirat nanti ketika melihat dan menyaksikan azab di depan matanya, berangan-angan bisa kembali lagi ke dunia untuk berbuat baik dan beriman. Mereka berkata, \"Apakah masih ada jalan bagi kami untuk kembali ke dunia?\" Andaikata mereka itu dapat kembali lagi ke dunia, mereka tidak juga akan beriman dan berbuat baik, mereka akan tetap saja melanggar larangan-larangan Allah. Hal ini digambarkan pula oleh Allah dalam ayat yang lain dengan firman-Nya:\n\nDan seandainya engkau (Muhammad) melihat ketika mereka dihadapkan ke neraka, mereka berkata, \"Seandainya kami dikembalikan (ke dunia), tentu kami tidak akan mendustakan ayat-ayat Tuhan kami, serta menjadi orang-orang yang beriman.\"Tetapi (sebenarnya) bagi mereka telah nyata kejahatan yang mereka sembunyikan dahulu. Seandainya mereka dikembalikan ke dunia, tentu mereka akan mengulang kembali apa yang telah dilarang mengerjakannya. Mereka itu sungguh pendusta. (al-An'am/6: 27-28)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4317,
                    "inSurah": 45
                },
                "meta": {
                    "juz": 25,
                    "page": 488,
                    "manzil": 6,
                    "ruku": 423,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَتَرَاهُمْ يُعْرَضُونَ عَلَيْهَا خَاشِعِينَ مِنَ الذُّلِّ يَنظُرُونَ مِن طَرْفٍ خَفِيٍّ ۗ وَقَالَ الَّذِينَ آمَنُوا إِنَّ الْخَاسِرِينَ الَّذِينَ خَسِرُوا أَنفُسَهُمْ وَأَهْلِيهِمْ يَوْمَ الْقِيَامَةِ ۗ أَلَا إِنَّ الظَّالِمِينَ فِي عَذَابٍ مُّقِيمٍ",
                    "transliteration": {
                        "en": "Wa taraahum yu'radoona 'alaihaa khaashi'eena minazzulli yanzuroona min tarfin khaifiyy; wa qaalal lazeena aamanooo innal khaasireenal lazeena khasiroon anfusahum wa ahleehim Yawmal Qiyaamah; alaaa innaz zaalimeena fee'azaabim muqeem"
                    }
                },
                "translation": {
                    "en": "And you will see them being exposed to the Fire, humbled from humiliation, looking from [behind] a covert glance. And those who had believed will say, \"Indeed, the [true] losers are the ones who lost themselves and their families on the Day of Resurrection. Unquestionably, the wrongdoers are in an enduring punishment.\"",
                    "id": "Dan kamu akan melihat mereka dihadapkan ke neraka dalam keadaan tertunduk karena (merasa) hina, mereka melihat dengan pandangan yang lesu. Dan orang-orang yang beriman berkata, “Sesungguhnya orang-orang yang rugi ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari Kiamat.” Ingatlah, sesungguhnya orang-orang zalim itu berada dalam azab yang kekal."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4317",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4317.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4317.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan kamu dan siapa pun yang hadir di tempat itu akan melihat mereka, orang-orang yang zalim, sedang dihadapkan ke neraka sebagai tempat penyiksaan yang abadi bagi mereka dalam keadaan tertunduk karena merasa hina, mereka melihat dengan pandangan yang lesu karena merasa sebentar lagi akan menerima siksaan api neraka. Dan orang-orang yang beriman berkata, “Sesungguhnya orang-orang yang rugi karena tidak beriman dan beramal saleh sewaktu di dunia ialah orang-orang yang merugikan diri mereka sendiri dan keluarganya pada hari Kiamat.” Ingatlah, sesungguhnya orang-orang zalim itu berada dalam azab yang kekal di dalam neraka.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa ketika orang-orang kafir ini dihadapkan ke neraka, mereka sangat takut dan merasa hina karena mereka tahu dan yakin bahwa itu adalah akibat dari pelanggaran-pelanggaran dan dosa yang telah dilakukannya, mereka mengetahui kebesaran serta kekuasaan Tuhan yang telah didurhakainya. Mereka tidak dapat menatap api neraka yang menyala-nyala itu, mereka melihatnya dengan lirikan mata yang penuh kelesuan, sama halnya dengan orang yang digiring untuk dibunuh ketika ia melihat pedang yang mengkilat yang akan menghabiskan nyawanya. Dia tidak akan mampu menatap pedang itu, tetapi dia melihatnya dengan lirik mata dan dalam keadaan lesu dan mencuri-curi penglihatan.\n\nDi kala itu orang-orang mukmin berkata, \"Sesungguhnya orang-orang yang merugi ialah orang-orang yang telah menganiaya dirinya sendiri sehingga mereka dimasukkan ke dalam neraka dan tidak memperoleh sedikit pun nikmat dan kesenangan yang abadi di dalam surga; mereka dipisahkan dengan orang yang disayanginya, sahabat-sahabatnya, dan familinya.\" Ini adalah suatu kerugian yang tak ada taranya. \n\nPada akhir ayat ini dijelaskan bahwa orang-orang kafir akan berada dalam siksaan yang berkepanjangan yang tak ada habis-habisnya. Tidak ada jalan bagi mereka untuk lepas dan menghindar dari siksaan itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4318,
                    "inSurah": 46
                },
                "meta": {
                    "juz": 25,
                    "page": 488,
                    "manzil": 6,
                    "ruku": 423,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا كَانَ لَهُم مِّنْ أَوْلِيَاءَ يَنصُرُونَهُم مِّن دُونِ اللَّهِ ۗ وَمَن يُضْلِلِ اللَّهُ فَمَا لَهُ مِن سَبِيلٍ",
                    "transliteration": {
                        "en": "Wa maa kaana lahum min awliyaaa'a yansuroonahum min doonil laah; wa mai yudlilil laahu famaa lahoo min sabeel"
                    }
                },
                "translation": {
                    "en": "And there will not be for them any allies to aid them other than Allah. And whoever Allah sends astray - for him there is no way.",
                    "id": "Dan mereka tidak akan mempunyai pelindung yang dapat menolong mereka selain Allah. Barangsiapa dibiarkan sesat oleh Allah tidak akan ada jalan keluar baginya (untuk mendapat petunjuk)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4318",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4318.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4318.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan mereka, orang-orang yang rugi dan zalim itu, tidak akan mempunyai pelindung yang dapat menolong dan menyelamatkan mereka dari azab di akhirat nanti selain Allah Yang Mahakuasa. Barang siapa dibiarkan sesat oleh Allah akibat kesesatannya, tidak akan ada jalan keluar baginya untuk mendapat petunjuk.\r\n\r\n \r\n  Normal\r\n  0\r\n  \r\n  \r\n  \r\n  \r\n  false\r\n  false\r\n  false\r\n  \r\n  EN-US\r\n  X-NONE\r\n  AR-SA\r\n  \r\n   \r\n   \r\n   \r\n   \r\n   \r\n   \r\n   \r\n   \r\n   \r\n  \r\n  \r\n   \r\n   \r\n   \r\n   \r\n   \r\n   \r\n   \r\n   \r\n   \r\n   \r\n   \r\n  \r\n\r\n \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n  \r\n \r\n\r\n\r\n /* Style Definitions */\r\n table.MsoNormalTable\r\n\t{mso-style-name:\"Table Normal\";\r\n\tmso-tstyle-rowband-size:0;\r\n\tmso-tstyle-colband-size:0;\r\n\tmso-style-noshow:yes;\r\n\tmso-style-priority:99;\r\n\tmso-style-parent:\"\";\r\n\tmso-padding-alt:0cm 5.4pt 0cm 5.4pt;\r\n\tmso-para-margin-top:0cm;\r\n\tmso-para-margin-right:0cm;\r\n\tmso-para-margin-bottom:10.0pt;\r\n\tmso-para-margin-left:0cm;\r\n\tline-height:115%;\r\n\tmso-pagination:widow-orphan;\r\n\tfont-size:11.0pt;\r\n\tfont-family:\"Calibri\",sans-serif;\r\n\tmso-ascii-font-family:Calibri;\r\n\tmso-ascii-theme-font:minor-latin;\r\n\tmso-hansi-font-family:Calibri;\r\n\tmso-hansi-theme-font:minor-latin;}",
                        "long": "Dalam ayat ini dijelaskan bahwa seseorang tidak akan mendapat pertolongan dari siapa pun untuk menyelamatkan mereka dari siksa yang menimpa Mereka. Berhala-berhala yang pernah disembah mereka di dunia tidak dapat sama sekali memberi pertolongan, bahkan mustahil akan dapat membela mereka dan melepaskan mereka dari azab yang sedang menimpa mereka. Ayat 46 ini ditutup dengan satu ketegasan bahwa orang yang dibiarkan Allah sesat itu telah menjadi watak dan tabiat mereka akan selalu berbuat kejahatan, kerusakan dan pelanggaran-pelanggaran terhadap larangan agama; mereka tidak akan dapat lagi diperbaiki, tidak akan dapat lagi melakukan hal-hal yang hak dan benar di dunia ini, dan tidak akan dapat memasuki surga Jannatun Na'im di akhirat nanti."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4319,
                    "inSurah": 47
                },
                "meta": {
                    "juz": 25,
                    "page": 488,
                    "manzil": 6,
                    "ruku": 423,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "اسْتَجِيبُوا لِرَبِّكُم مِّن قَبْلِ أَن يَأْتِيَ يَوْمٌ لَّا مَرَدَّ لَهُ مِنَ اللَّهِ ۚ مَا لَكُم مِّن مَّلْجَإٍ يَوْمَئِذٍ وَمَا لَكُم مِّن نَّكِيرٍ",
                    "transliteration": {
                        "en": "Istajeeboo li Rabbikum min qabli any yaatiya Yawmul laa maradda lahoo minal laah; maa lakum mim malja iny yawma'izinw wa maa lakum min nakeer"
                    }
                },
                "translation": {
                    "en": "Respond to your Lord before a Day comes from Allah of which there is no repelling. No refuge will you have that day, nor for you will there be any denial.",
                    "id": "Patuhilah seruan Tuhanmu sebelum datang dari Allah suatu hari yang tidak dapat ditolak (atas perintah dari Allah). Pada hari itu kamu tidak memperoleh tempat berlindung dan tidak (pula) dapat mengingkari (dosa-dosamu)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4319",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4319.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4319.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Agar kalian mendapat pertolongan dari Allah dan mendapat perlindungan dari-Nya, maka patuhilah seruan Tuhanmu dengan mengamalkan apa yang di perintahkan dan meninggalkan apa yang di larang sebelum datang dari Allah suatu hari, yaitu hari akhirat, yang tidak dapat ditolak kehadirannya oleh siapa pun karena ia datang atas perintah dari Allah. Pada hari itu kamu tidak memperoleh tempat berlindung kecuali iman dan amal saleh yang telah kamu lakukan dan tidak pula dapat mengingkari dosa-dosamu yang pernah kamu perbuat di dunia.",
                        "long": "Allah menerangkan bahwa Dia telah memerintahkan agar manusia patuh dan taat serta menerima seruan Rasul-Nya, agama Allah yang disampaikan sebelum datang hari dimana tidak seorang pun dapat menahan, menolak dan menghalangi kedatangannya yaitu hari Kiamat. Pada hari itu mereka tidak mempunyai suatu tempat pun untuk berlindung yang akan menyelamatkan mereka dari kesusahan, dan mereka itu tidak dapat mengingkari kejahatan-kejahatan yang telah diperbuatnya di dunia, karena semuanya itu sudah tertera dengan jelas di dalam buku catatan amalan masing-masing dan lidah serta anggota tubuh mereka pun menjadi saksi. Bagaimana pun juga mereka tidak akan dapat melarikan diri dan menghindar dari kedahsyatan hari itu. Dalam hubungan ini Allah berfirman:\n\nPada hari itu manusia berkata, \"Ke mana tempat lari?\" Tidak! Tidak ada tempat berlindung! Hanya kepada Tuhanmu tempat kembali pada hari itu. (al-Qiyamah/75: 10-12)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4320,
                    "inSurah": 48
                },
                "meta": {
                    "juz": 25,
                    "page": 488,
                    "manzil": 6,
                    "ruku": 423,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَإِنْ أَعْرَضُوا فَمَا أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا ۖ إِنْ عَلَيْكَ إِلَّا الْبَلَاغُ ۗ وَإِنَّا إِذَا أَذَقْنَا الْإِنسَانَ مِنَّا رَحْمَةً فَرِحَ بِهَا ۖ وَإِن تُصِبْهُمْ سَيِّئَةٌ بِمَا قَدَّمَتْ أَيْدِيهِمْ فَإِنَّ الْإِنسَانَ كَفُورٌ",
                    "transliteration": {
                        "en": "Fa-in a'radoo famaaa arsalnaaka 'alaihim hafeezan in 'alaika illal balaagh; wa innaaa izaaa azaqnal insaana minnaa rahmatan fariha bihaa wa in tusibhum saiyi'atum bimaa qaddamat aydeehim fa innal insaana kafoor"
                    }
                },
                "translation": {
                    "en": "But if they turn away - then We have not sent you, [O Muhammad], over them as a guardian; upon you is only [the duty of] notification. And indeed, when We let man taste mercy from us, he rejoices in it; but if evil afflicts him for what his hands have put forth, then indeed, man is ungrateful.",
                    "id": "Jika mereka berpaling, maka (ingatlah) Kami tidak mengutus engkau sebagai pengawas bagi mereka. Kewajibanmu tidak lain hanyalah menyampaikan (risalah). Dan sungguh, apabila Kami merasakan kepada manusia suatu rahmat dari Kami, dia menyambutnya dengan gembira; tetapi jika mereka ditimpa kesusahan disebabkan perbuatan tangan mereka sendiri (niscaya mereka ingkar), sungguh, manusia itu sangat ingkar (kepada nikmat)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4320",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4320.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4320.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Jika mereka berpaling, yaitu tidak mau menerima seruanmu untuk beriman, maka ingatlah, wahai Nabi Muhammad, Kami tidak mengutus engkau sebagai pengawas bagi mereka dengan memaksa mereka untuk beriman dan tidak pula mengharuskan mereka menerima seruanmu sehingga mereka beriman. Kewajibanmu tidak lain hanyalah menyampaikan risalah dan seruan Tuhanmu kepada mereka. Dan sungguh, apabila Kami merasakan kepada manusia suatu rahmat, yaitu hal-hal yang menyenangkan dari Kami, dia menyambutnya dengan gembira; tetapi jika sebaliknya mereka ditimpa kesusahan disebabkan perbuatan tangan mereka sendiri, niscaya mereka ingkar. Sungguh, manusia itu salah satu sifatnya adalah sangat ingkar kepada nikmat.",
                        "long": "Pada ayat ini Allah menerangkan bahwa apabila Nabi Muhammad saw telah menunaikan tugas menyampaikan risalah menyeru orang-orang musyrik kepada kebenaran dan kepada jalan yang lurus, tetapi mereka itu tidak menyambut baik dan tidak mau menerimanya bahkan mereka itu tetap menolak dan berpaling dari kebenaran, maka hendaklah Rasul membiarkan sikap mereka tanpa perlu gusar dan cemas. Hal ini dikarenakan Rasul tidak diberi tugas mengawasi dan meneliti amal perbuatan orang-orang musyrik itu, tetapi dia hanya diberi tugas menyampaikan apa yang diturunkan dan diperintahkan Allah kepadanya. Apabila Nabi Muhammad saw telah melaksanakan kewajibannya, maka beliau sudah dianggap menunaikan misinya, sebagaimana firman Allah:\n\nMaka sesungguhnya tugasmu hanya menyampaikan saja, dan Kamilah yang memperhitungkan (amal mereka). (ar-Ra'd/13: 40)\n\nDan firman-Nya:\n\nMaka berilah peringatan, karena sesungguhnya engkau (Muhammad) hanyalah pemberi peringatan. Engkau bukanlah orang yang berkuasa atas mereka, (al-Gasyiyah/88: 21-22)\n\nDan firman-Nya pula:\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allah-lah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah/2: 272)\n\nSelanjutnya Allah menerangkan tabiat dan watak manusia yaitu apabila manusia itu diberi kekayaan, dikaruniai kesenangan hidup, kesejahteraan jasmani, perasaan aman sentosa, mereka senang dan gembira atas karunia tersebut, bahkan sering menimbulkan perasaan angkuh dan takabur. Tetapi sebaliknya apabila mereka ditimpa kemiskinan, penyakit, musibah yang bermacam-macam berupa banjir, kebakaran dan akibat dosa dan maksiat yang dikerjakannya, mereka mengingkari semua karunia yang telah diberikan Allah kepadanya, lupa akan karunia itu, malah mereka lupa mengerjakan kebaikan. Demikianlah sifat orang kafir dan tidak beriman kepada Allah. Berbeda dengan orang-orang yang benar-benar beriman kepada Allah, mereka bersyukur, beriman dan beribadah semakin mantap. Apabila mereka tidak atau belum memperoleh karunia, mereka bersabar karena mereka percaya kepada ketentuan Allah; segala sesuatu dikembalikan kepada Allah, mereka menyesuaikan diri dengan firman Allah:\n\nDan kepada Allah-lah segala perkara dikembalikan. (al-Baqarah/2: 210)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4321,
                    "inSurah": 49
                },
                "meta": {
                    "juz": 25,
                    "page": 488,
                    "manzil": 6,
                    "ruku": 423,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لِّلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ يَخْلُقُ مَا يَشَاءُ ۚ يَهَبُ لِمَن يَشَاءُ إِنَاثًا وَيَهَبُ لِمَن يَشَاءُ الذُّكُورَ",
                    "transliteration": {
                        "en": "Lillaahi mulkus samaawaati wal ard; yakhluqu maa yashaaa'; yahabu limai yashaaa'u inaasanw wa yahabu limai yashaaa'uz zukoor"
                    }
                },
                "translation": {
                    "en": "To Allah belongs the dominion of the heavens and the earth; He creates what he wills. He gives to whom He wills female [children], and He gives to whom He wills males.",
                    "id": "Milik Allah-lah kerajaan langit dan bumi; Dia menciptakan apa yang Dia kehendaki, memberikan anak perempuan kepada siapa yang Dia kehendaki dan memberikan anak laki-laki kepada siapa yang Dia kehendaki,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4321",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4321.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4321.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Hanya milik Allah-lah kewenangan untuk penciptaan dan pengaturan kerajaan langit dan bumi dengan kekuasaan-Nya. Dia menciptakan apa yang Dia kehendaki sesuai dengan kehendak-Nya, walaupun yang di ciptakannya itu enggan menerimanya, memberikan anak-anak ber jenis kelamin perempuan saja, tanpa anak laki-laki kepada siapa yang Dia kehendaki, dan memberikan anak-anak berjenis kelamin laki-laki saja, tanpa anak-anak perempuan kepada siapa yang Dia kehendaki. Demikianlah kekuasaan Allah kepada makhluk-Nya, tidak dapat mereka menolaknya.",
                        "long": "Pada ayat ini Allah menerangkan bahwa Dia-lah yang menciptakan langit dan bumi, memiliki, berkuasa dan berbuat sekehendak-Nya terhadap apa yang ada di langit dan di bumi. Apa saja yang Dia kehendaki pasti terwujud dan menjadi kenyataan, dan apa yang tidak Dia kehendaki tidak terwujud. Dia memberikan nikmat kepada siapa yang dikehendaki-Nya. Tidak seorang pun dapat menghalangi apa yang dikehendaki-Nya tidak seorang pun dapat memberikan nikmat kepada siapa yang tidak dikehendaki-Nya. Dia-lah yang menciptakan segala sesuatu menurut kehendak-Nya. Dia-lah yang memberikan keturunan anak perempuan kepada siapa yang dikehendaki-Nya, memberikan keturunan anak laki-laki kepada siapa yang dikehendaki-Nya, dan memberikan keturunan anak laki-laki dan perempuan, dan ada pula yang dijadikannya mandul, tidak memiliki keturunan, semua itu ada hikmahnya.\n\nSemuanya itu menunjukkan kemahakuasaan Allah yang tidak seorang pun dapat menentang-Nya. Dia berbuat sekehendak-Nya sesuai dengan kodrat-Nya dan tidak seorang pun yang sanggup merintangi-Nya atau turut membantu mengatur keinginan-Nya.\n\nAyat ini ditutup dengan satu ketegasan, bahwa Allah Maha Mengetahui siapa-siapa yang layak dan berhak dianugerahi tiap-tiap macam karunia tersebut di atas. Dia Mahakuasa menciptakan apa yang dikehendaki dan berbuat sekehendak-Nya menurut kebijaksanaan dan ilmu-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4322,
                    "inSurah": 50
                },
                "meta": {
                    "juz": 25,
                    "page": 488,
                    "manzil": 6,
                    "ruku": 423,
                    "hizbQuarter": 195,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَوْ يُزَوِّجُهُمْ ذُكْرَانًا وَإِنَاثًا ۖ وَيَجْعَلُ مَن يَشَاءُ عَقِيمًا ۚ إِنَّهُ عَلِيمٌ قَدِيرٌ",
                    "transliteration": {
                        "en": "Aw yuzawwijuhum zukraananw wa inaasanw wa yaj'alu mai yashaaa'u 'aqeemaa; innahoo 'Aleemun Qadeer"
                    }
                },
                "translation": {
                    "en": "Or He makes them [both] males and females, and He renders whom He wills barren. Indeed, He is Knowing and Competent.",
                    "id": "atau Dia menganugerahkan jenis laki-laki dan perempuan, dan menjadikan mandul siapa yang Dia kehendaki. Dia Maha Mengetahui, Mahakuasa."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4322",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4322.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4322.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Atau, Dia mengkombinasikan mereka, yakni menggabungkan anak-anak itu, ada anak-anak berjenis laki-laki dan ada pula yang berjenis perempuan kepada siapa yang dikehendaki-Nya, dan menjadikan mandul siapa yang Dia kehendaki mandul. Dia Maha Mengetahui segala hal yang terkait dengan persoalan-persoalan di atas, dan Mahakuasa atas segala sesuatu yang dikehendaki-Nya.",
                        "long": "Pada ayat ini Allah menerangkan bahwa Dia-lah yang menciptakan langit dan bumi, memiliki, berkuasa dan berbuat sekehendak-Nya terhadap apa yang ada di langit dan di bumi. Apa saja yang Dia kehendaki pasti terwujud dan menjadi kenyataan, dan apa yang tidak Dia kehendaki tidak terwujud. Dia memberikan nikmat kepada siapa yang dikehendaki-Nya. Tidak seorang pun dapat menghalangi apa yang dikehendaki-Nya tidak seorang pun dapat memberikan nikmat kepada siapa yang tidak dikehendaki-Nya. Dia-lah yang menciptakan segala sesuatu menurut kehendak-Nya. Dia-lah yang memberikan keturunan anak perempuan kepada siapa yang dikehendaki-Nya, memberikan keturunan anak laki-laki kepada siapa yang dikehendaki-Nya, dan memberikan keturunan anak laki-laki dan perempuan, dan ada pula yang dijadikannya mandul, tidak memiliki keturunan, semua itu ada hikmahnya.\n\nSemuanya itu menunjukkan kemahakuasaan Allah yang tidak seorang pun dapat menentang-Nya. Dia berbuat sekehendak-Nya sesuai dengan kodrat-Nya dan tidak seorang pun yang sanggup merintangi-Nya atau turut membantu mengatur keinginan-Nya.\n\nAyat ini ditutup dengan satu ketegasan, bahwa Allah Maha Mengetahui siapa-siapa yang layak dan berhak dianugerahi tiap-tiap macam karunia tersebut di atas. Dia Mahakuasa menciptakan apa yang dikehendaki dan berbuat sekehendak-Nya menurut kebijaksanaan dan ilmu-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4323,
                    "inSurah": 51
                },
                "meta": {
                    "juz": 25,
                    "page": 488,
                    "manzil": 6,
                    "ruku": 423,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ وَمَا كَانَ لِبَشَرٍ أَن يُكَلِّمَهُ اللَّهُ إِلَّا وَحْيًا أَوْ مِن وَرَاءِ حِجَابٍ أَوْ يُرْسِلَ رَسُولًا فَيُوحِيَ بِإِذْنِهِ مَا يَشَاءُ ۚ إِنَّهُ عَلِيٌّ حَكِيمٌ",
                    "transliteration": {
                        "en": "Wa maa kaana libasharin any yukallimahul laahu illaa wahyan aw minw waraaa'i hijaabin aw yursila Rasoolan fa yoohiya bi iznuhee maa yashaaa'; innahoo 'Aliyyun Hakeem"
                    }
                },
                "translation": {
                    "en": "And it is not for any human being that Allah should speak to him except by revelation or from behind a partition or that He sends a messenger to reveal, by His permission, what He wills. Indeed, He is Most High and Wise.",
                    "id": "Dan tidaklah patut bagi seorang manusia bahwa Allah akan berbicara kepadanya kecuali dengan perantaraan wahyu atau dari belakang tabir atau dengan mengutus utusan (malaikat) lalu diwahyukan kepadanya dengan izin-Nya apa yang Dia kehendaki. Sungguh, Dia Mahatinggi, Mahabijaksana."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4323",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4323.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4323.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat-ayat yang lalu berbicara tentang kekuasaan Allah atas makhluk-makhluk-Nya. Ayat ini menjelaskan tentang wahyu Allah yang diturunkan kepada rasul. Dan tidaklah patut, yaitu tidak mungkin terjadi, bagi seorang manusia bahwa Allah akan berbicara secara langsung kepadanya kecuali berupa wahyu yang di turunkan kepadanya atau pembicaraan yang disampaikannya dari belakang tabir, seperti yang di alami oleh Nabi Musa di Tur Sina atau dengan mengutus utusan, yakni malaikat Jibril lalu di wahyukan kepadanya dengan izin-Nya apa yang Dia kehendaki. Sungguh, Dia Mahatinggi, Mahasuci dari sifat-sifat yang dimiliki makhluk-Nya dan Mahabijaksana dalam menempatkan sesuatu secara proporsional sesuai dengan hikmah-Nya.",
                        "long": "Pada ayat ini Allah menerangkan bahwa Allah tidak akan berkata-kata dengan hamba-Nya kecuali dengan salah satu dari tiga cara seperti berikut ini:\n\n1. Dengan wahyu, yakni Allah menanamkan ke dalam hati sanubari seorang nabi suatu pengertian yang tidak diragukannya bahwa yang diterimanya adalah dari Allah. Seperti halnya yang terjadi dengan Nabi Muhammad saw. Sabda beliau:\n\nSesungguhnya Ruhul Qudus telah menghembuskan ke dalam lubuk hatiku bahwasanya seseorang tidak akan meninggal dunia hingga dia menerima dengan sempurna rezeki dan ajalnya, maka bertakwalah kepada Allah dan berusahalah dengan cara yang sebaik-baiknya. (Riwayat Ibnu hibban)\n\n2. Di belakang tabir yakni dengan cara mendengar dan tidak melihat siapa yang berkata, tetapi perkataannya itu didengar, seperti halnya Allah berbicara dengan Nabi Musa, Firman Allah :\n\nDan ketika Musa datang untuk (munajat) pada waktu yang telah Kami tentukan dan Tuhan telah berfirman (langsung) kepadanya, (Musa) berkata, \"Ya Tuhanku, tampakkanlah (diri-Mu) kepadaku agar aku dapat melihat Engkau.\" (Allah) berfirman, \"Engkau tidak akan (sanggup) melihat-Ku. (al-A'raf/7: 143)\n\n3. Mengutus seorang utusan, yakni Allah mengutus Malaikat Jibril, maka utusan itu menyampaikan wahyu kepada siapa yang dikehendaki-Nya, sebagaimana halnya Jibril turun kepada Nabi Muhammad saw dan kepada nabi-nabi yang lain.\n\n'Aisyah meriwayatkan bahwa al-harits bin Hisyam bertanya kepada Nabi saw, \"Bagaimana cara wahyu datang kepadamu?\" Rasulullah saw menjawab, \"Terkadang wahyu datang kepadaku seperti bunyi lonceng. Cara inilah yang sangat berat bagiku. Setelah ia berhenti, aku telah mengerti apa yang telah dikatakan-Nya; kadang-kadang malaikat mewujudkan dirinya kepadaku sebagai seorang laki-laki, lalu dia berbicara kepadaku, maka aku mengerti apa yang dibicarakannya\". Berkata 'Aisyah ra, sesungguhnya saya lihat Nabi ketika turun kepadanya wahyu di hari yang sangat dingin, kemudian setelah wahyu itu berhenti terlihat dahinya bercucuran keringat. (Riwayat al-Bukhari)\n\nAyat ini ditutup dengan penegasan bahwa Allah itu Mahatinggi lagi Mahasuci dari sifat-sifat makhluk ciptaan-Nya. Dia disebut menurut kebijaksanaan-Nya, berbicara dengan hamba-hamba-Nya, adakalanya tanpa perantara baik berupa ilham atau berupa percakapan dari belakang tabir."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4324,
                    "inSurah": 52
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 423,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَكَذَٰلِكَ أَوْحَيْنَا إِلَيْكَ رُوحًا مِّنْ أَمْرِنَا ۚ مَا كُنتَ تَدْرِي مَا الْكِتَابُ وَلَا الْإِيمَانُ وَلَٰكِن جَعَلْنَاهُ نُورًا نَّهْدِي بِهِ مَن نَّشَاءُ مِنْ عِبَادِنَا ۚ وَإِنَّكَ لَتَهْدِي إِلَىٰ صِرَاطٍ مُّسْتَقِيمٍ",
                    "transliteration": {
                        "en": "Wa kazaalika awhainaaa ilaika rooham min amrinaa; maa kunta tadree mal Kitaabu wa lal eemaanu wa laakin ja'alnaahu nooran nahdee bihee man nashaaa'u min 'ibaadinaa; wa innaka latahdeee ilaaa Siraatim Mustaqeem"
                    }
                },
                "translation": {
                    "en": "And thus We have revealed to you an inspiration of Our command. You did not know what is the Book or [what is] faith, but We have made it a light by which We guide whom We will of Our servants. And indeed, [O Muhammad], you guide to a straight path -",
                    "id": "Dan demikianlah Kami wahyukan kepadamu (Muhammad) ruh (Al-Qur'an) dengan perintah Kami. Sebelumnya engkau tidaklah mengetahui apakah Kitab  (Al-Qur'an) dan apakah iman itu, tetapi Kami jadikan Al-Qur'an itu cahaya, dengan itu Kami memberi petunjuk siapa yang Kami kehendaki di antara hamba-hamba Kami. Dan sungguh, engkau benar-benar membimbing (manusia) kepada jalan yang lurus,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4324",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4324.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4324.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan demikianlah Kami wahyukan kepadamu, wahai Nabi Muhammad, ruh, yaitu Al-Qur’an yang di turunkan dengan perantaraan Jibril dengan perintah Kami. Sebelumnya, yaitu sebelum Al-Qur’an itu di turunkan kepadamu, engkau tidaklah mengetahui apakah al-Kitab itu, yaitu Al-Qur’an dan apakah pula iman itu. Akan tetapi, Kami menjadikannya, yaitu Al-Qur’an itu, cahaya yang dapat menerangi dan menunjukkan jalan yang benar kepadamu. Dengan Al-Qur’an itu pula Kami memberi petunjuk siapa yang Kami kehendaki untuk mendapat petunjuk di antara hamba-hamba Kami. Dan sungguh, engkau, wahai Nabi Muhammad, benar-benar membimbing manusia kepada jalan yang lurus, jalan yang Kami ridai.",
                        "long": "Allah menerangkan bahwa sebagaimana Dia menurunkan wahyu kepada rasul-rasul terdahulu Dia juga menurunkan wahyu kepada Nabi Muhammad saw berupa Al-Qur'an sebagai rahmat-Nya. Selanjutnya Allah menjelaskan bahwa Muhammad saw sebelum mencapai umur empat puluh tahun dan berada di tengah-tengah kaumnya, belum tahu apa Al-Qur'an itu dan apa iman itu, dan begitu juga belum tahu apa syariat itu secara terperinci dan pengertian tentang hal-hal yang mengenai wahyu yang diturunkannya, tetapi Allah menjadikan Al-Qur'an itu cahaya terang benderang yang dengannya Allah memberi petunjuk kepada hamba-hamba yang dikehendaki-Nya dan membandingkan kepada agama yang benar yaitu agama Islam. Sebagaimana firman Allah:\n\nDan engkau (Muhammad) tidak pernah mengharap agar Kitab (Al-Qur'an) itu diturunkan kepadamu, tetapi ia (diturunkan) sebagai rahmat dari Tuhanmu, sebab itu janganlah sekali-kali engkau menjadi penolong bagi orang-orang kafir. (al-Qasas/28: 86)\n\nDan firman-Nya:\n\nKatakanlah, \"Al-Qur'an adalah petunjuk dan penyembuh bagi orang-orang yang beriman. Dan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan (Al-Qur'an) itu merupakan kegelapan bagi mereka. (Fussilat/41: 44)\n\nFirman Allah:\n\nSungguh, Al-Qur'an ini memberi petunjuk ke (jalan) yang paling lurus. (al-Isra'/17: 9)\n\nDengan cahaya Al-Qur'an itulah, Allah memberikan petunjuk kepada jalan yang lurus yaitu agama yang benar."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4325,
                    "inSurah": 53
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 423,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "صِرَاطِ اللَّهِ الَّذِي لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ أَلَا إِلَى اللَّهِ تَصِيرُ الْأُمُورُ",
                    "transliteration": {
                        "en": "Siraatil laahil lazee lahoo maa fis samaawaati wa maa fil ard; alaaa ilal laahi taseerul umoor"
                    }
                },
                "translation": {
                    "en": "The path of Allah, to whom belongs whatever is in the heavens and whatever is on the earth. Unquestionably, to Allah do [all] matters evolve.",
                    "id": "(Yaitu) jalan Allah yang milik-Nyalah apa yang ada di langit dan apa yang ada di bumi. Ingatlah, segala urusan kembali kepada Allah."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4325",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4325.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4325.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Yaitu jalan Allah yang milik-Nyalah kewenangan dan kekuasaan terhadap apa yang ada di langit dan apa yang ada di bumi. Ingatlah, segala urusan kembali kepada Allah tanpa perantara, lalu Dia memberi ganjaran pahala kepada mereka yang telah melakukan kebajikan dan menghukum mereka yang telah berbuat dosa.",
                        "long": "Pada ayat ini Allah menerangkan bahwa jalan yang lurus itu ialah jalan yang telah disyariatkan Allah pemilik langit dan bumi serta penguasa keduanya, berbuat sekehendak-Nya, dan sebagai hakim yang tidak dapat digugat keputusan-Nya.\n\nAyat ini diakhiri dengan satu peringatan bahwa semua urusan makhluk pada hari Kiamat nanti dikembalikan kepada Allah tidak kepada yang lain. Maka ditempatkanlah setiap mereka itu pada tempat yang layak baginya, di surga atau di neraka. Firman Allah:\n\nDan milik Allah-lah apa yang ada di langit dan apa yang ada di bumi, dan hanya kepada Allah segala urusan dikembalikan. (Ali 'Imran/3: 109)"
                    }
                }
            }
        ]
    }
}