{
    "code": 200,
    "status": "OK.",
    "message": "Success fetching surah.",
    "data": {
        "number": 43,
        "sequence": 63,
        "numberOfVerses": 89,
        "name": {
            "short": "الزخرف",
            "long": "سورة الزخرف",
            "transliteration": {
                "en": "Az-Zukhruf",
                "id": "Az-Zukhruf"
            },
            "translation": {
                "en": "Ornaments of gold",
                "id": "Perhiasan"
            }
        },
        "revelation": {
            "arab": "مكة",
            "en": "Meccan",
            "id": "Makkiyyah"
        },
        "tafsir": {
            "id": "Surat Az Zukhruf terdiri atas 89 ayat, termasuk golongan  surat-surat Makkiyyah, diturunkan sesudah surat Asy Syuura. Dinamai Az Zukhruf (Perhiasan) diambil dari perkataan Az Zukhruf yang terdapat pada ayat 35 surat ini.  Orang-orang musyrik mengukur tinggi rendahnya derajat seseorang tergantung kepada perhiasan dan harta benda yang ia punyai, karena Muhammad s.a.w. adalah seorang anak yatim lagi miskin, ia tidak pantas diangkat Allah sebagai seorang rasul dan nabi.  Pangkat rasul dan nabi harus diberikan kepada orang yang kaya.  Ayat ini menegaskan bahwa harta tidak dapat dijadikan dasar untuk mengukur tinggi rendahnya derajat seseorang, karena harta itu merupakan hiasan kehidupan duniawi, bukan berarti kesenangan akhirat."
        },
        "preBismillah": {
            "text": {
                "arab": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
                "transliteration": {
                    "en": "Bismillaahir Rahmaanir Raheem"
                }
            },
            "translation": {
                "en": "In the name of Allah, the Entirely Merciful, the Especially Merciful.",
                "id": "Dengan nama Allah Yang Maha Pengasih, Maha Penyayang."
            },
            "audio": {
                "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1",
                "secondary": [
                    "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1.mp3",
                    "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1.mp3"
                ]
            }
        },
        "verses": [
            {
                "number": {
                    "inQuran": 4326,
                    "inSurah": 1
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "حم",
                    "transliteration": {
                        "en": "Haa-Meeem"
                    }
                },
                "translation": {
                    "en": "Ha, Meem.",
                    "id": "Ha Mim"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4326",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4326.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4326.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Hà Mìm. Kedua huruf ini termasuk huruf-huruf yang terletak pada permulaan sebagian dari surah-surah Al-Quran seperti: Alif Làm Mìm, Alif Làm Rà, Alif Làm Mìm Sàd, dan sebagainya. Di antara ahli-ahli tafsir ada yang menyerahkan pengertiannya kepada Allah karena di pandang termasuk ayat-ayat mutasyabihat, dan ada pula yang menafsirkannya. Golongan yang menafsirkannya ada yang memandangnya sebagai nama surah, dan ada pula yang berpendapat bahwa huruf-huruf abjad itu gunanya untuk menarik perhatian para pendengar supaya memperhatikan Al-Quran itu, dan untuk mengisyaratkan bahwa Al-Quran itu diturunkan dari Allah dalam bahasa Arab yang tersusun dari huruf-huruf abjad. Kalau mereka tidak percaya bahwa Al-Quran di turunkan dari Allah dan hanya buatan Muhammad semata-mata, maka cobalah mereka buat semacam Al-Quran itu.",
                        "long": "Permulaan ayat ini terdiri dari huruf-huruf hijaiah, sebagaimana terdapat pada permulaan beberapa surah lainnya. Para ahli tafsir berbeda pendapat tentang maksud huruf-huruf itu. Selanjutnya silakan menelaah masalah ini pada \"Al-Qur'an dan Tafsirnya\" jilid I yaitu tafsir ayat pertama Surah al-Baqarah.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4327,
                    "inSurah": 2
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالْكِتَابِ الْمُبِينِ",
                    "transliteration": {
                        "en": "Wal Kitaabil Mubeen"
                    }
                },
                "translation": {
                    "en": "By the clear Book,",
                    "id": "Demi Kitab (Al-Qur'an) yang jelas."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4327",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4327.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4327.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Demi al-kitab, demikian Allah bersumpah yang diturunkan kepada Nabi Muhammad, yaitu Al-Quran yang nyata bersumber dari Allah, nyata ke istimewaannya, dan nyata uraian-uraiannya sehingga menjadi petunjuk bagi manusia.",
                        "long": "Allah bersumpah, demi Kitab Suci Al-Qur'an yang menerangkan petunjuk dan hidayah, dan penjelasan hal-hal yang diperlukan manusia di dunia dan di akhirat untuk mencapai kebahagiaan. Barang siapa mengikuti petunjuk-petunjuk yang telah digariskan di dalam Al-Qur'an, dia akan beruntung dan selamat, dan barang siapa yang menyimpang daripadanya, maka dia akan merugi dan sesat dari jalan yang benar."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4328,
                    "inSurah": 3
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّا جَعَلْنَاهُ قُرْآنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُونَ",
                    "transliteration": {
                        "en": "Innaa ja'alnaahu Quraanan 'Arabiyyal la'allakum ta'qiloon"
                    }
                },
                "translation": {
                    "en": "Indeed, We have made it an Arabic Qur'an that you might understand.",
                    "id": "Kami menjadikan Al-Qur'an dalam bahasa Arab agar kamu mengerti."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4328",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4328.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4328.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sesungguhnya Kami menjadikannya, yaitu kitab yang nyata itu, sebagai Al-Qur’an, yaitu bacaan dalam bahasa Arab agar kamu mengerti pesan-pesannya dengan menggunakan akalmu.",
                        "long": "Allah menerangkan bahwa Dia telah menjadikan Al-Qur'an dalam bahasa Arab bukan dalam bahasa 'Ajam (bahasa-bahasa asing) karena yang akan diberi peringatan pertama kali adalah orang-orang Arab agar mereka mudah memahami pelajaran dan nasihat-nasihat yang terkandung di dalamnya, dan dengan mudah mereka dapat memikirkan arti dan maknanya. Dia tidak menurunkan Al-Qur'an dalam bahasa 'Ajam agar tidak ada alasan bagi mereka untuk mengatakan bagaimana mereka dapat memahami isi Al-Qur'an karena bahasanya bukan bahasa Arab, bahasa kami, sebagaimana firman Allah:\n\nDan sekiranya Al-Qur'an Kami jadikan sebagai bacaan dalam bahasa selain bahasa Arab niscaya mereka mengatakan, \"Mengapa tidak dijelaskan ayat-ayatnya?\" Apakah patut (Al-Qur'an) dalam bahasa selain bahasa Arab sedang (rasul), orang Arab? Katakanlah, \"Al-Qur'an adalah petunjuk dan penyembuh bagi orang-orang yang beriman. (Fussilat/41: 44)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4329,
                    "inSurah": 4
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِنَّهُ فِي أُمِّ الْكِتَابِ لَدَيْنَا لَعَلِيٌّ حَكِيمٌ",
                    "transliteration": {
                        "en": "Wa innahoo feee Ummil Kitaabi Ladainaa la'aliyyun hakeem"
                    }
                },
                "translation": {
                    "en": "And indeed it is, in the Mother of the Book with Us, exalted and full of wisdom.",
                    "id": "Dan sesungguhnya Al-Qur'an itu dalam Ummul Kitab (Lauh Mahfuzh) di sisi Kami, benar-benar (bernilai) tinggi dan penuh hikmah."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4329",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4329.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4329.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sesungguhnya dia, yaitu Al-Qur’an itu, di dalam Ummul-Kitàb, yaitu kitab induk atau Lauë Mahfùz, yang berada di sisi Kami dan ia benar-benar bernilai tinggi dan penuh hikmah di dalamnya.",
                        "long": "Allah menerangkan kedudukan Al-Qur'an di Lauh Mahfudz bahwa ia telah ada dalam ilmu-Nya yang azali, amat tinggi nilainya karena dia mengandung rahasia-rahasia dan hikmah-hikmah yang menerangkan kebahagiaan manusia, dan petunjuk-petunjuk yang membawa mereka ke jalan yang benar. Hal ini sesuai dengan firman Allah:\n\nDan (ini) sesungguhnya Al-Qur'an yang sangat mulia, dalam Kitab yang terpelihara (Lauh Mahfudz), tidak ada yang menyentuhnya selain hamba-hamba yang disucikan. Diturunkan dari Tuhan seluruh alam. (al-Waqi'ah/56: 77-80)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4330,
                    "inSurah": 5
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَفَنَضْرِبُ عَنكُمُ الذِّكْرَ صَفْحًا أَن كُنتُمْ قَوْمًا مُّسْرِفِينَ",
                    "transliteration": {
                        "en": "Afanadribu 'ankumuz Zikra safhan an kuntum qawmam musrifeen"
                    }
                },
                "translation": {
                    "en": "Then should We turn the message away, disregarding you, because you are a transgressing people?",
                    "id": "Maka apakah Kami akan berhenti menurunkan ayat-ayat (sebagai peringatan) Al-Qur'an kepadamu, karena kamu kaum yang melampaui batas?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4330",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4330.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4330.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka apakah dengan penolakan kamu terhadap Al-Qur’an yang Kami turunkan itu, wahai orang-orang kafir, akan menyebabkan Kami akan berhenti menurunkan ayat-ayat Al-Qur’an sebagai peringatan kepa-damu, karena kamu adalah kaum yang melampaui batas karena kebejatan dan keingkaranmu terhadapnya? Sama sekali tidak. Kami tidak akan pernah berhenti menurunkannya.",
                        "long": "Allah mencela kaum musyrik Mekah dengan mengatakan: Apakah Kami akan berhenti memperingatkan kamu dengan Al-Qur'an karena kamu sudah begitu mendalam dalam kekafiranmu, selalu meninggalkan perintah Kami dan melakukan larangan Kami? Tidak! Kami sekali-sekali tidak akan berbuat demikian, karena rahmat dan kasih sayang Kami kepadamu, meskipun kamu seharusnya dibinasakan, atau dibiarkan sesat sampai mati, karena perbuatanmu sudah keterlaluan dan melampaui batas.\n\nQatadah berkata, \"Sekiranya Al-Qur'an itu telah diangkat atau ditiadakan ketika ia ditolak orang-orang pertama dari umat terdahulu, maka pasti mereka binasa, tetapi Allah selalu memberikan rahmat dan kasih sayang-Nya kepada mereka dan Muhammad saw senantiasa menyeru mereka selama duapuluh tahun lebih menurut izin dan kehendak Allah.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4331,
                    "inSurah": 6
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَكَمْ أَرْسَلْنَا مِن نَّبِيٍّ فِي الْأَوَّلِينَ",
                    "transliteration": {
                        "en": "Wa kam arsalnaa min Nabiyyin fil awwaleen"
                    }
                },
                "translation": {
                    "en": "And how many a prophet We sent among the former peoples,",
                    "id": "Dan betapa banyak nabi-nabi yang telah Kami utus kepada umat-umat yang terdahulu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4331",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4331.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4331.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Setelah Allah menegaskan bahwa Al-Qur’an adalah kitab yang bernilai tinggi dan tidak akan pernah berhenti di turunkan walaupun mendapat penolakan dari orang-orang kafir, maka pada ayat ini Allah menegaskan bahwa sikap orang-orang musyik Mekah tidak beda dengan umat-umat sebelumnya, “Dan betapa banyak nabi-nabi yang telah Kami utus kepada umat-umat yang terdahulu sebelum engkau, wahai Nabi Muhammad, sikap umat-umat mereka tidak berbeda dengan sikap orang-orang musyrik Mekah yang kamu hadapi.”",
                        "long": "Pada ayat ini Allah menghibur Rasul-Nya Muhammad saw yang sedang duka, karena ia didustakan oleh kaumnya, dan Allah memerintahkan kepadanya supaya dia bersabar. Tidak sedikit rasul yang telah diutus oleh Allah sejak dahulu diingkari dan diejek oleh kaumnya sebagaimana ia diingkari dan diejek pula.\n\nDemikianlah Sunatullah yang merupakan satu ketentuan dari Allah yang tidak dapat diubah lagi, sebagaimana firman Allah:\n\nSebagai sunah Allah yang (berlaku juga) bagi orang-orang yang telah terdahulu sebelum(mu), dan engkau tidak akan mendapati perubahan pada sunnah Allah. (al-Ahzab/33: 62)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4332,
                    "inSurah": 7
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا يَأْتِيهِم مِّن نَّبِيٍّ إِلَّا كَانُوا بِهِ يَسْتَهْزِئُونَ",
                    "transliteration": {
                        "en": "Wa maa yaateehim min Nabiyyin illaa kaanoo bihee yasahzi'oon"
                    }
                },
                "translation": {
                    "en": "But there would not come to them a prophet except that they used to ridicule him.",
                    "id": "Dan setiap kali seorang nabi datang kepada mereka, mereka selalu memperolok-olokkannya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4332",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4332.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4332.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan di antara sikap mereka adalah bahwa setiap kali seorang nabi datang kepada mereka, mereka enggan menerima kehadirannya. Mereka memperlihatkan sikap-sikap yang buruk kepada para nabi itu dan selalu memperolok-olokkannya dengan berbagai macam olokan meskipun para nabi telah di dukung dengan berbagai bukti atas kebenaran dakwah mereka.",
                        "long": "Pada ayat ini Allah menghibur Rasul-Nya Muhammad saw yang sedang duka, karena ia didustakan oleh kaumnya, dan Allah memerintahkan kepadanya supaya dia bersabar. Tidak sedikit rasul yang telah diutus oleh Allah sejak dahulu diingkari dan diejek oleh kaumnya sebagaimana ia diingkari dan diejek pula.\n\nDemikianlah Sunatullah yang merupakan satu ketentuan dari Allah yang tidak dapat diubah lagi, sebagaimana firman Allah:\n\nSebagai sunah Allah yang (berlaku juga) bagi orang-orang yang telah terdahulu sebelum(mu), dan engkau tidak akan mendapati perubahan pada sunnah Allah. (al-Ahzab/33: 62)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4333,
                    "inSurah": 8
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَأَهْلَكْنَا أَشَدَّ مِنْهُم بَطْشًا وَمَضَىٰ مَثَلُ الْأَوَّلِينَ",
                    "transliteration": {
                        "en": "Fa ahlaknaaa ashadda minhum batshanw wa madaa masalul lawwaleen"
                    }
                },
                "translation": {
                    "en": "And We destroyed greater than them in [striking] power, and the example of the former peoples has preceded.",
                    "id": "Karena itu Kami binasakan orang-orang yang lebih besar kekuatannya di antara mereka dan telah berlalu contoh umat-umat terdahulu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4333",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4333.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4333.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Karena keingkaran dan penolakan mereka terhadap para nabi yang Kami utus itu, Kami binasakan orang-orang yang lebih besar kekuatannya di antara mereka tanpa mendapat kesulitan sedikit pun. Dan telah berlalu di sebutkan di dalam Al-Qur’an contoh dan perumpamaan umat-umat terdahulu yang Kami binasakan yang patut menjadi pelajaran bagi orang-orang musyrik Mekah.",
                        "long": "Allah menerangkan bahwa Dia menghancurkan orang-orang yang mendustakan rasul-rasul dan mereka tak dapat mengelak dan menghindar apabila bencana itu datang, padahal mereka jauh lebih kuat dan perkasa dibandingkan dengan kaum Nabi Muhammad saw. Yang demikian itu hendaknya menjadi perhatian umat Muhammad. Firman Allah:\n\nMaka apakah mereka tidak mengadakan perjalanan di bumi, lalu mereka memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka. Mereka itu lebih banyak dan lebih hebat kekuatannya serta (lebih banyak) peninggalan-peninggalan peradabannya di bumi. (Gafir/40: 82)\n\nAyat ini ditutup dengan satu peringatan kepada umat Muhammad bahwa ketentuan Allah yang berlaku pada umat yang mendustakan rasul, kiranya menjadi pelajaran bagi mereka karena tidak mustahil mereka itu juga akan ditimpa bencana sebagaimana halnya umat yang terdahulu itu. Firman Allah:\n\nMaka Kami jadikan mereka sebagai (kaum) terdahulu dan pelajaran bagi orang-orang yang kemudian. (az-Zukhruf/43: 56)\n\nAllah juga berfirman:\n\nItulah (ketentuan) Allah yang telah berlaku terhadap hamba-hamba-Nya. (Gafir/40: 85)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4334,
                    "inSurah": 9
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَ السَّمَاوَاتِ وَالْأَرْضَ لَيَقُولُنَّ خَلَقَهُنَّ الْعَزِيزُ الْعَلِيمُ",
                    "transliteration": {
                        "en": "Wa la'in sa altahum man khalaqas samaawaati wal arda la yaqoolunna khalaqa hunnal 'Azeezul 'Aleem"
                    }
                },
                "translation": {
                    "en": "And if you should ask them, \"Who has created the heavens and the earth?\" they would surely say, \"They were created by the Exalted in Might, the Knowing.\"",
                    "id": "Dan jika kamu tanyakan kepada mereka, “Siapakah yang menciptakan langit dan bumi?” Pastilah mereka akan menjawab, “Semuanya diciptakan oleh Yang Mahaperkasa, Maha Mengetahui.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4334",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4334.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4334.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sesungguhnya mereka sebenarnya menyadari tentang bukti kekuasaan Allah di alam ini, termasuk kekuasaan untuk membinasakan orang-orang yang ingkar terhadap utusan-utusan-Nya. Oleh karena itu, jika kamu menanyakan kepada mereka, “Siapakah yang menciptakan langit yang demikian tinggi dan kukuh itu dengan bintang-bintang yang menghiasinya dan siapa pulakah yang menciptakan bumi yang indah dan terhampar luas dengan segala kenikmatan yang dapat dinikmati?” pastilah mereka secara spontan dan tanpa berpikir panjang akan menjawab, “Semuanya, yakni langit dan bumi dengan segala isi keduanya diciptakan oleh Yang Mahaperkasa terhadap sesuatu dengan kekuasaan-Nya, Maha Mengetahui terhadap segala sesuatu yang diciptakan-Nya.”",
                        "long": "Ayat ini ditujukan Allah kepada Rasul-Nya bahwa apabila dia bertanya kepada orang-orang musyrik kaumnya, siapakah yang menjadikan alam semesta seperti langit, bumi dan lainnya, mereka dengan tandas menjawab, bahwa semuanya itu diciptakan oleh Allah, Tuhan yang Maha Perkasa, Maha Mengetahui segalanya, tidak satu pun yang tersembunyi bagi-Nya. Firman Allah:\n\nBagi Allah tidak ada sesuatu pun yang tersembunyi di bumi dan di langit. (Ali 'Imran/3: 5)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4335,
                    "inSurah": 10
                },
                "meta": {
                    "juz": 25,
                    "page": 489,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "الَّذِي جَعَلَ لَكُمُ الْأَرْضَ مَهْدًا وَجَعَلَ لَكُمْ فِيهَا سُبُلًا لَّعَلَّكُمْ تَهْتَدُونَ",
                    "transliteration": {
                        "en": "Allazee ja'ala lakumul arda mahdanw wa ja'ala lakum feehaa subulal la'allakum tahtadoon"
                    }
                },
                "translation": {
                    "en": "[The one] who has made for you the earth a bed and made for you upon it roads that you might be guided",
                    "id": "Yang menjadikan bumi sebagai tempat menetap bagimu dan Dia menjadikan jalan-jalan di atas bumi untukmu agar kamu mendapat petunjuk."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4335",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4335.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4335.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Begitu banyak kekuasaan Allah yang ditunjukkan kepada manusia. Di antaranya adalah bahwa Dialah yang menjadikan bumi sebagai tempat menetap yang mantap dan nyaman bagimu dan Dia pulalah yang menjadikan untukmu jalan-jalan yang banyak di atas bumi yang terhampar luas itu agar kamu mendapat petunjuk untuk menuju ke arah dan tujuan yang kamu inginkan dan untuk menuju ke tempat pembuktian ke-Esaan Allah.",
                        "long": "Allah menerangkan bahwa Dia-lah yang menjadikan bumi sebagai hamparan dan menyiapkannya bagi makhluk-Nya untuk tempat mereka menetap, berpijak dan mengayunkan kaki, diperlengkapi dengan jalan-jalan agar mereka dapat berkunjung dari satu tempat ke tempat yang lain, baik yang dekat maupun yang jauh untuk kepentingan hidup dan penghidupan, kepentingan ekonomi dan perdagangan, dan lain-lain. Sejalan dengan ayat ini firman Allah:\n\nBukankah Kami telah menjadikan bumi sebagai hamparan. (an-Naba'/78: 6)\n\nFirman Allah:\n\nDan Kami jadikan (pula) di sana jalan-jalan yang luas, agar mereka mendapat petunjuk. (al-Anbiya'/21: 31)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4336,
                    "inSurah": 11
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِي نَزَّلَ مِنَ السَّمَاءِ مَاءً بِقَدَرٍ فَأَنشَرْنَا بِهِ بَلْدَةً مَّيْتًا ۚ كَذَٰلِكَ تُخْرَجُونَ",
                    "transliteration": {
                        "en": "Wallazee nazzala minas samaaa'i maaa'am biqadarin fa anshamaa bihee baldatam maitaa' kazaalika tukhrajoon"
                    }
                },
                "translation": {
                    "en": "And who sends down rain from the sky in measured amounts, and We revive thereby a dead land - thus will you be brought forth -",
                    "id": "Dan yang menurunkan air dari langit menurut ukuran (yang diperlukan) lalu dengan air itu Kami hidupkan negeri yang mati (tandus). Seperti itulah kamu akan dikeluarkan (dari kubur)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4336",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4336.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4336.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan Dia pulalah yang menurunkan secara bertahap dan teratur air dari langit menurut ukuran yang diperlukan untuk semua makhluk-Nya yang ada di bumi, untuk kebutuhan minuman kamu, untuk minuman hewan-hewan piaraanmu dan untuk kebutuhan-kebutuhanmu yang lain. Lalu dengan air yang diturunkan sesuai kadarnya itu Kami hidupkan negeri yang mati dan tandus sehingga tumbuh-tumbuhan yang ada padanya dapat keluar dari bumi dan tumbuh dengan baik dan subur. Seperti itulah kamu nanti akan dikeluarkan ketika akan dibangkitkan dari kuburmu.",
                        "long": "Allah menurunkan hujan dari langit sesuai dengan keperluan untuk menghidup-suburkan tanam-tanaman dan tumbuh-tumbuhan. Dia menurunkan hujan tidak lebih dari yang diperlukan sehingga tidak melimpah ruah melampaui batas dan akhirnya menjadi bencana, seperti halnya air bah yang merusak dan membinasakan, dan tidak pula terlalu sedikit sehingga tidak mencukupi kebutuhan untuk kesuburan tanam-tanaman dan tumbuh-tumbuhan yang menyebabkan kering dan layu, dan mengakibatkan timbulnya bencana kelaparan yang menimpa makhluk Allah di mana-mana.\n\nDengan turunnya hujan dari langit sesuai dengan kadar yang diperlukan, maka hidup dan makmurlah negeri yang telah mati yang tidak lagi ditumbuhi tanam-tanaman dan pohon-pohonan. Sebagaimana Allah kuasa menghidupkan negeri yang telah mati, begitu pula Dia kuasa menghidupkan dan mengeluarkan orang-orang mati itu dari kubur dalam keadaan hidup, sebagaimana firman Allah:\n\nDan Dia menurunkan air (hujan) dari langit, lalu dengan air itu dihidupkannya bumi setelah mati (kering). (ar-Rum/30: 24)\n\nDan firman-Nya:\n\nMaka Kami arahkan awan itu ke suatu negeri yang mati (tandus) lalu dengan hujan itu Kami hidupkan bumi setelah mati (kering). Seperti itulah kebangkitan itu. (Fathir/35: 9)\n\nApa yang dikemukakan oleh ayat ini dibuktikan oleh ilmu pengetahuan yang ditemukan manusia saat ini. Diperkirakan dalam waktu satu detik, sebanyak 16 juta ton air menguap dari bumi. Menggunakan angka ini, maka diperhitungkan akan adanya 513 triliun ton air yang menguap dari bumi dalam setahun. Angka ini ternyata sama dengan perhitungan mengenai jumlah air hujan yang turun dalam setahun. Dengan demikian, air melakukan sirkulasi yang seimbang secara terus-menerus. Kehidupan di bumi sangat bergantung pada keberlanjutan siklus air yang demikian ini. Walaupun banyak teknologi mencoba mengintervensi siklus alami ini, seperti membuat hujan buatan, pada kenyataannya siklus air tidak dapat dibuat secara artifisial.\n\nProporsi air hujan tidak hanya penting dalam bentuk jumlahnya, tetapi juga kecepatan turunnya butir air hujan [menurut ukuran yang diperlukan]. Kecepatan butir air hujan tidak melebihi kecepatan standar, tidak peduli berapa ukuran butir air hujan itu. Umumnya butiran air hujan mempunyai diameter 4,5 mm. Kecepatannya sekitar 8 meter per detik. Pada ukuran yang lebih kecil, tentunya kecepatannya lebih rendah. Pada ukuran butiran yang lebih besar dari 4,5 mm, tidak berarti kecepatannya makin tinggi. Kecepatannya tetap, yaitu sekitar 8 meter per detik. Hal ini disebabkan karena bentuk butiran yang cair itu akan berinteraksi dengan udara dan angin sehingga bentuk butir air itu berubah sedemikian rupa yang mengakibatkan kecepatan jatuhnya menurun dan tidak melebihi kecepatan standar. \n\nMenghidupkan negeri yang mati dengan air (hujan) dari langit telah difirmankan pada Surah Fussilat/41: 39, bahwasanya dengan diturunkan hujan di daerah yang tandus maka daerah tersebut akan (bisa, dengan kehendak Allah) ditumbuhi pepohonan. Pada ayat ini ditekankan bahwa air dari langit diturunkan menurut kadar tertentu. Kebangkitan manusia setelah alam kubur sering diibaratkan dengan menghidupkan tanah yang tandus dengan air hujan. Perumpamaan ini dapat kita bandingkan dengan tumbuhnya biji-bijian atau spora liar yang terbawa tiupan angin dan terserak di atas tanah yang kering. Apabila tanah yang kering ini mendapat siraman hujan dengan jumlah yang cukup [menurut ukuran yang diperlukan], maka biji-biji tersebut akan tumbuh menjadi kecambah-kecambah dan kemudian menjadi tumbuhan. Apabila curah hujan sangat banyak maka biji-bijian atau spora yang menjadi bakal benih tumbuh-tumbuhan akan hanyut terbawa aliran air. Seandainya aliran air tidak sampai menghanyutkan, tetapi bila kadar kelembaban air dalam tanah terlalu berlebih maka biji-bijian tidak akan tumbuh menjadi kecambah, malahan akan membusuk. Semuanya menurut ukuran."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4337,
                    "inSurah": 12
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَالَّذِي خَلَقَ الْأَزْوَاجَ كُلَّهَا وَجَعَلَ لَكُم مِّنَ الْفُلْكِ وَالْأَنْعَامِ مَا تَرْكَبُونَ",
                    "transliteration": {
                        "en": "Wallazee khalaqal azwaaja kullahaa wa ja'ala lakum minal fulki wal-an'aami maa tarkaboon"
                    }
                },
                "translation": {
                    "en": "And who created the species, all of them, and has made for you of ships and animals those which you mount.",
                    "id": "Dan yang menciptakan semua berpasang-pasangan dan menjadikan kapal untukmu dan hewan ternak yang kamu tunggangi."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4337",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4337.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4337.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "12-13. Dan kekuasaan-Nya yang lain adalah bahwa Dia pulalah yang menciptakan semuanya, yaitu semua makhluk-Nya berpasang-pasangan dan dengan keberpasangannya itu mereka saling menyempurnakan satu sama lain. Dan Dialah yang menjadikan kapal sebagai alat transportasi laut untukmu yang dapat mengantar kamu dan kebutuhan kamu ke tempat tujuanmu di laut dengan aman dan atas izin-Nya dan hewan ternak sebagai alat transportasi darat yang kamu tunggangi, agar kamu duduk di atas punggungnya dengan aman dan atas izin-Nya dan menjadikannya sebagai pengangkut barang-barang kebutuhanmu. Kemudian kamu ingat dengan pikiran dan hatimu nikmat Tuhanmu, yaitu ditundukkannya hewan-hewan itu untuk kamu apabila kamu telah duduk dengan aman dan mantap dan melihat barang-barangmu aman di atasnya; dan agar kamu mengucapkan dengan lidahmu sebagai peng-akuan atas kekuasaan Allah menundukkannya dengan mengatakan, “Mahasuci Allah yang telah menundukkan semua ini bagi kami padahal kami sebelumnya, yakni sebelum Allah menundukkannya, tidak mampu menguasainya.\\\\\"12-13. Dan kekuasaan-Nya yang lain adalah bahwa Dia pulalah yang menciptakan semuanya, yaitu semua makhluk-Nya berpasang-pasangan dan dengan keberpasangannya itu mereka saling menyempurnakan satu sama lain. Dan Dialah yang menjadikan kapal sebagai alat transportasi laut untukmu yang dapat mengantar kamu dan kebutuhan kamu ke tempat tujuanmu di laut dengan aman dan atas izin-Nya dan hewan ternak sebagai alat transportasi darat yang kamu tunggangi, agar kamu duduk di atas punggungnya dengan aman dan atas izin-Nya dan menjadikannya sebagai pengangkut barang-barang kebutuhanmu. Kemudian kamu ingat dengan pikiran dan hatimu nikmat Tuhanmu, yaitu ditundukkannya hewan-hewan itu untuk kamu apabila kamu telah duduk dengan aman dan mantap dan melihat barang-barangmu aman di atasnya; dan agar kamu mengucapkan dengan lidahmu sebagai peng-akuan atas kekuasaan Allah menundukkannya dengan mengatakan, “Mahasuci Allah yang telah menundukkan semua ini bagi kami padahal kami sebelumnya, yakni sebelum Allah menundukkannya, tidak mampu menguasainya.\\\\\"",
                        "long": "Di antara sifat Allah yang disebut dalam ayat ini ialah Dia-lah yang menciptakan semua makhluk berpasang-pasangan, laki-laki perempuan, jantan-betina, baik dari jenis tumbuh-tumbuhan, pohon-pohonan, buah-buahan, bunga-bungaan dan lain-lain maupun dari jenis hewan dan manusia. Dia pula yang menjadikan kendaraan berupa perahu, kapal yang dapat dipergunakan untuk mengangkut manusia dan keperluan barang dagangan di laut, dan binatang ternak, seperti unta, kuda, himar, sapi dan lain-lain yang dapat dipergunakan sebagai alat pengangkutan di darat, dan lain-lain yang dapat menghubungkan satu tempat dengan tempat yang lain, baik di darat maupun di laut dengan macam alat perhubungan.\n\nSesuai dengan firman Allah:\n\nDan (Dia telah menciptakan) kuda, bagal, dan keledai, untuk kamu tunggangi dan (menjadi) perhiasan. Allah menciptakan apa yang tidak kamu ketahui. (an-Nahl/16: 8)\n\nPenjelasan mengenai Allah menciptakan segala sesuatunya berpasang-pasangan dapat dilihat penjelasannya pada Surah asy-Syura/42: 11. Beberapa ayat lain yang membicarakan hal yang sama adalah Yasin/36: 36, ar-Ra'd/13: 3, dan adh-dzariyat/51: 49."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4338,
                    "inSurah": 13
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لِتَسْتَوُوا عَلَىٰ ظُهُورِهِ ثُمَّ تَذْكُرُوا نِعْمَةَ رَبِّكُمْ إِذَا اسْتَوَيْتُمْ عَلَيْهِ وَتَقُولُوا سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَٰذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ",
                    "transliteration": {
                        "en": "Litastawoo 'alaa zuhoorihee summa tazkuroo ni'mata Rabbikum izastawaitum 'alaihi wa taqooloo Subhaanal lazee sakhkhara lana haaza wa maa kunnaa lahoo muqrineen"
                    }
                },
                "translation": {
                    "en": "That you may settle yourselves upon their backs and then remember the favor of your Lord when you have settled upon them and say. \"Exalted is He who has subjected this to us, and we could not have [otherwise] subdued it.",
                    "id": "Agar kamu duduk di atas punggungnya kemudian kamu ingat nikmat Tuhanmu apabila kamu telah duduk di atasnya; dan agar kamu mengucapkan, “Maha-suci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4338",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4338.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4338.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan kekuasaan-Nya yang lain adalah bahwa Dia pulalah yang menciptakan semuanya, yaitu semua makhluk-Nya berpasang-pasangan dan dengan keberpasangannya itu mereka saling menyempurnakan satu sama lain. Dan Dialah yang menjadikan kapal sebagai alat transportasi laut untukmu yang dapat mengantar kamu dan kebutuhan kamu ke tempat tujuanmu di laut dengan aman dan atas izin-Nya dan hewan ternak sebagai alat transportasi darat yang kamu tunggangi, agar kamu duduk di atas punggungnya dengan aman dan atas izin-Nya dan menjadikannya sebagai pengangkut barang-barang kebutuhanmu. Kemudian kamu ingat dengan pikiran dan hatimu nikmat Tuhanmu, yaitu ditundukkannya hewan-hewan itu untuk kamu apabila kamu telah duduk dengan aman dan mantap dan melihat barang-barangmu aman di atasnya; dan agar kamu mengucapkan dengan lidahmu sebagai peng-akuan atas kekuasaan Allah menundukkannya dengan mengatakan, “Mahasuci Allah yang telah menundukkan semua ini bagi kami padahal kami sebelumnya, yakni sebelum Allah menundukkannya, tidak mampu menguasainya.",
                        "long": "Pada ayat ini Allah menerangkan bahwa apabila manusia berada di atas punggung binatang, perahu, kapal, kereta api, pesawat terbang dan lain-lain hendaklah mengingat nikmat yang telah dikaruniakan Allah kepada mereka, hendaklah mengagungkan Allah dan menyucikan-Nya dari sifat-sifat yang tidak layak yang dituduhkan orang-orang musyrik kepada-Nya, dan hendaklah mereka membaca ayat ini sebagai doa:\n\nMahasuci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Tuhan kami. (az-Zukhruf/43: 13-14)\n\nAndaikata Allah tidak menundukkan alam semesta dengan ilmu yang dianugerahkan-Nya tentu manusia tidak dapat melakukannya, karena yang demikian itu di luar kemampuan mereka.\n\nBacaan doa itu mengingatkan manusia supaya selalu bersiap-siap menghadapi hari pembalasan saat seluruh manusia akan menghadapi dan mengalaminya dan jangan lalai mengingat Allah, baik di waktu bepergian atau tidak, di waktu berlayar atau tinggal di kampung halaman.\n\nSehubungan dengan tafsir di atas, diriwayatkan oleh Imam Muslim, Abu Dawud, dan an-Nasa'i bahwa Rasulullah saw, apabila bepergian dan berkendaraan mengucapkan tiga kali dan membaca doa tersebut di atas.\n\nApabila Nabi saw mengendarai kendaraannya untuk melakukan suatu perjalanan, maka beliau bertakbir tiga kali. Kemudian beliau membaca, \"Mahasuci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Tuhan kami.\"(Riwayat Muslim, Abu Dawud, dan an-Nasa'i)\n\nAyat di atas mengajarkan agar manusia mensyukuri nikmat Allah yang telah diberikan berupa binatang dan memperlakukannya dengan baik. Kesetaraan di antara makhluk, terutama antara binatang dan manusia, sangat ditekankan Tuhan. Salah satu ayat di bawah ini menjelaskan bahwa binatang juga umat Tuhan, sama dengan manusia. Walau mereka mempunyai ciri, kekhususan dan sistem yang berbeda-beda, pada hakikatnya, mereka sama dengan manusia di mata Tuhan. Dan manusia diwajibkan untuk mengingatnya.\n\nDan tidak ada seekor binatang pun yang ada di bumi dan burung-burung yang terbang dengan kedua sayapnya, melainkan semuanya merupakan umat-umat (juga) seperti kamu. Tidak ada sesuatu pun yang Kami luputkan di dalam Kitab, kemudian kepada Tuhan mereka dikumpulkan.\" (al-An'am/6: 38)\n\nBeberapa ayat Al-Qur'an menyinggung mengenai binatang, antara lain tentang bagaimana manusia harus bersikap terhadap binatang, kegunaan binatang untuk manusia, perilaku binatang yang harus ditiru manusia, dan banyak lagi lainnya. Dalam hubungan kesetaraan antar makhluk ini, ada tulisan seorang arif, Muhammad Fazlur Rahman Ansari, berbunyi demikian, \"Segala yang di muka bumi ini diciptakan untuk kita, maka sudah menjadi kewajiban alamiah kita untuk: menjaga segala sesuatu dari kerusakan; memanfaatkannya dengan tetap menjaga martabatnya sebagai ciptaan Tuhan; melestarikannya sebisa mungkin, yang dengan demikian, mensyukuri nikmat Tuhan dalam bentuk perbuatan nyata.\" \n\nMenyangkut hewan atau satwa peliharaan, Al-Qur'an dalam Surah an-Nahl/16: 5 menyebutkan beberapa manfaat binatang untuk manusia:\n\nDan hewan ternak telah diciptakan-Nya untuk kamu, padanya ada (bulu) yang menghangatkan dan berbagai manfaat, dan sebagiannya kamu makan. (an-Nahl/16: 5)\n\nDalam hubungannya dengan ayat dari Surah an-Nahl di atas, kita harus memperhatikan bahwa, misalnya, kulit dan bulu binatang ternak boleh dimanfaatkan. Namun Nabi Muhammad saw melanjutkannya dengan satu hal yang sangat bijaksana. Beliau melarang penggunaan kulit binatang liar walaupun sekedar untuk alas lantai. Jika aturan atau himbauan yang dikemukakan Nabi ini ditaati oleh semua orang, maka pembunuhan sia-sia terhadap beberapa jenis binatang liar demi meraih keuntungan semata niscaya tidak terjadi. Demikian pula, kendati umat Islam diperbolehkan mengkonsumsi daging beberapa binatang tertentu, tapi perlu diingat bahwa hal ini tidak menghalalkan pembantaian secara kejam dan tak terkendali terhadap mereka. \n\nSalah satu manfaat binatang adalah sebagai tunggangan. Kita harus ingat bahwa orang-orang Arab di masa lalu sepenuhnya bergantung pada unta untuk membantu membawa barang dalam perjalanan. Tuhan menyatakan hal tersebut dalam ayat di bawah: \n\nDan ia mengangkut beban-bebanmu ke suatu negeri yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. Sungguh, Tuhanmu Maha Pengasih, Maha Penyayang. Dan (Dia telah menciptakan) kuda, bagal, dan keledai untuk kamu tunggangi dan (menjadi) perhiasan. Allah menciptakan apa yang tidak kamu ketahui. (an-Nahl/16: 7-8)\n\nPada hakikatnya Islam mengajarkan pada umatnya untuk menyayangi binatang dan melestarikan kehidupannya. Di dalam Al-Qur'an, Allah menekankan bahwa Dia telah menganugerahi manusia wilayah kekuasaan yang mencakup segala sesuatu di dunia ini. \n\nDan Dia telah menundukkan apa yang ada di langit dan apa yang ada di bumi untukmu semuanya (sebagai rahmat) dari-Nya. (al-Jatsiyah/45: 13). \n\nDalam ayat ini, Al-Qur'an sama sekali tidak menunjukan bahwa manusia memiliki kekuasaan mutlak untuk berbuat sekehendak hatinya segala sesuatu yang ada di langit dan bumi. Mereka juga tidak pula memiliki hak tanpa batas untuk menggunakan alam sehingga merusak keseimbangan ekologisnya. \n\n\" .... semua itu dari Dia ....\" Penggalan ayat di sini seharusnya disadari dan dimengerti sebagai pengingat-ingat dari Tuhan, bahwa manusia tidak memiliki apa-apa di dunia ini. Jadi bagaimana seharusnya kita memperlakukan barang orang lain harus selalu diingat di dalam benak \"...orang-orang yang berpikir....\"\n\nIslam pada dasarnya tidak mendukung manusia untuk menyalahgunakan binatang untuk tujuan olahraga maupun untuk menjadikan binatang sebagai objek eksperimen yang sembarangan. Ayat ini mengingatkan umat manusia bahwa Sang Pencipta telah menjadikan semua yang ada di alam ini (termasuk satwa) sebagai amanah yang harus mereka jaga."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4339,
                    "inSurah": 14
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِنَّا إِلَىٰ رَبِّنَا لَمُنقَلِبُونَ",
                    "transliteration": {
                        "en": "Wa innaaa ilaa Rabbinaa lamunqaliboon"
                    }
                },
                "translation": {
                    "en": "And indeed we, to our Lord, will [surely] return.\"",
                    "id": "dan sesungguhnya kami akan kembali kepada Tuhan kami.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4339",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4339.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4339.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sesungguhnya sesudah kehidupan di dunia ini, kami pasti akan kembali kepada Tuhan kami, untuk mempertanggungjawabkan amal perbuatan kami.”",
                        "long": "Pada ayat ini Allah menerangkan bahwa apabila manusia berada di atas punggung binatang, perahu, kapal, kereta api, pesawat terbang dan lain-lain hendaklah mengingat nikmat yang telah dikaruniakan Allah kepada mereka, hendaklah mengagungkan Allah dan menyucikan-Nya dari sifat-sifat yang tidak layak yang dituduhkan orang-orang musyrik kepada-Nya, dan hendaklah mereka membaca ayat ini sebagai doa:\n\nMahasuci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Tuhan kami. (az-Zukhruf/43: 13-14)\n\nAndaikata Allah tidak menundukkan alam semesta dengan ilmu yang dianugerahkan-Nya tentu manusia tidak dapat melakukannya, karena yang demikian itu di luar kemampuan mereka.\n\nBacaan doa itu mengingatkan manusia supaya selalu bersiap-siap menghadapi hari pembalasan saat seluruh manusia akan menghadapi dan mengalaminya dan jangan lalai mengingat Allah, baik di waktu bepergian atau tidak, di waktu berlayar atau tinggal di kampung halaman.\n\nSehubungan dengan tafsir di atas, diriwayatkan oleh Imam Muslim, Abu Dawud, dan an-Nasa'i bahwa Rasulullah saw, apabila bepergian dan berkendaraan mengucapkan tiga kali dan membaca doa tersebut di atas.\n\nApabila Nabi saw mengendarai kendaraannya untuk melakukan suatu perjalanan, maka beliau bertakbir tiga kali. Kemudian beliau membaca, \"Mahasuci (Allah) yang telah menundukkan semua ini bagi kami padahal kami sebelumnya tidak mampu menguasainya, dan sesungguhnya kami akan kembali kepada Tuhan kami.\"(Riwayat Muslim, Abu Dawud, dan an-Nasa'i)\n\nAyat di atas mengajarkan agar manusia mensyukuri nikmat Allah yang telah diberikan berupa binatang dan memperlakukannya dengan baik. Kesetaraan di antara makhluk, terutama antara binatang dan manusia, sangat ditekankan Tuhan. Salah satu ayat di bawah ini menjelaskan bahwa binatang juga umat Tuhan, sama dengan manusia. Walau mereka mempunyai ciri, kekhususan dan sistem yang berbeda-beda, pada hakikatnya, mereka sama dengan manusia di mata Tuhan. Dan manusia diwajibkan untuk mengingatnya.\n\nDan tidak ada seekor binatang pun yang ada di bumi dan burung-burung yang terbang dengan kedua sayapnya, melainkan semuanya merupakan umat-umat (juga) seperti kamu. Tidak ada sesuatu pun yang Kami luputkan di dalam Kitab, kemudian kepada Tuhan mereka dikumpulkan.\" (al-An'am/6: 38)\n\nBeberapa ayat Al-Qur'an menyinggung mengenai binatang, antara lain tentang bagaimana manusia harus bersikap terhadap binatang, kegunaan binatang untuk manusia, perilaku binatang yang harus ditiru manusia, dan banyak lagi lainnya. Dalam hubungan kesetaraan antar makhluk ini, ada tulisan seorang arif, Muhammad Fazlur Rahman Ansari, berbunyi demikian, \"Segala yang di muka bumi ini diciptakan untuk kita, maka sudah menjadi kewajiban alamiah kita untuk: menjaga segala sesuatu dari kerusakan; memanfaatkannya dengan tetap menjaga martabatnya sebagai ciptaan Tuhan; melestarikannya sebisa mungkin, yang dengan demikian, mensyukuri nikmat Tuhan dalam bentuk perbuatan nyata.\" \n\nMenyangkut hewan atau satwa peliharaan, Al-Qur'an dalam Surah an-Nahl/16: 5 menyebutkan beberapa manfaat binatang untuk manusia:\n\nDan hewan ternak telah diciptakan-Nya untuk kamu, padanya ada (bulu) yang menghangatkan dan berbagai manfaat, dan sebagiannya kamu makan. (an-Nahl/16: 5)\n\nDalam hubungannya dengan ayat dari Surah an-Nahl di atas, kita harus memperhatikan bahwa, misalnya, kulit dan bulu binatang ternak boleh dimanfaatkan. Namun Nabi Muhammad saw melanjutkannya dengan satu hal yang sangat bijaksana. Beliau melarang penggunaan kulit binatang liar walaupun sekedar untuk alas lantai. Jika aturan atau himbauan yang dikemukakan Nabi ini ditaati oleh semua orang, maka pembunuhan sia-sia terhadap beberapa jenis binatang liar demi meraih keuntungan semata niscaya tidak terjadi. Demikian pula, kendati umat Islam diperbolehkan mengkonsumsi daging beberapa binatang tertentu, tapi perlu diingat bahwa hal ini tidak menghalalkan pembantaian secara kejam dan tak terkendali terhadap mereka. \n\nSalah satu manfaat binatang adalah sebagai tunggangan. Kita harus ingat bahwa orang-orang Arab di masa lalu sepenuhnya bergantung pada unta untuk membantu membawa barang dalam perjalanan. Tuhan menyatakan hal tersebut dalam ayat di bawah: \n\nDan ia mengangkut beban-bebanmu ke suatu negeri yang kamu tidak sanggup mencapainya, kecuali dengan susah payah. Sungguh, Tuhanmu Maha Pengasih, Maha Penyayang. Dan (Dia telah menciptakan) kuda, bagal, dan keledai untuk kamu tunggangi dan (menjadi) perhiasan. Allah menciptakan apa yang tidak kamu ketahui. (an-Nahl/16: 7-8)\n\nPada hakikatnya Islam mengajarkan pada umatnya untuk menyayangi binatang dan melestarikan kehidupannya. Di dalam Al-Qur'an, Allah menekankan bahwa Dia telah menganugerahi manusia wilayah kekuasaan yang mencakup segala sesuatu di dunia ini. \n\nDan Dia telah menundukkan apa yang ada di langit dan apa yang ada di bumi untukmu semuanya (sebagai rahmat) dari-Nya. (al-Jatsiyah/45: 13). \n\nDalam ayat ini, Al-Qur'an sama sekali tidak menunjukan bahwa manusia memiliki kekuasaan mutlak untuk berbuat sekehendak hatinya segala sesuatu yang ada di langit dan bumi. Mereka juga tidak pula memiliki hak tanpa batas untuk menggunakan alam sehingga merusak keseimbangan ekologisnya. \n\n\" .... semua itu dari Dia ....\" Penggalan ayat di sini seharusnya disadari dan dimengerti sebagai pengingat-ingat dari Tuhan, bahwa manusia tidak memiliki apa-apa di dunia ini. Jadi bagaimana seharusnya kita memperlakukan barang orang lain harus selalu diingat di dalam benak \"...orang-orang yang berpikir....\"\n\nIslam pada dasarnya tidak mendukung manusia untuk menyalahgunakan binatang untuk tujuan olahraga maupun untuk menjadikan binatang sebagai objek eksperimen yang sembarangan. Ayat ini mengingatkan umat manusia bahwa Sang Pencipta telah menjadikan semua yang ada di alam ini (termasuk satwa) sebagai amanah yang harus mereka jaga."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4340,
                    "inSurah": 15
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 424,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَجَعَلُوا لَهُ مِنْ عِبَادِهِ جُزْءًا ۚ إِنَّ الْإِنسَانَ لَكَفُورٌ مُّبِينٌ",
                    "transliteration": {
                        "en": "Wa ja'aloo lahoo min 'ibaadihee juz'aa; innal insaana lakafoorum mubeen"
                    }
                },
                "translation": {
                    "en": "But they have attributed to Him from His servants a portion. Indeed, man is clearly ungrateful.",
                    "id": "Dan mereka menjadikan sebagian dari hamba-hamba-Nya sebagai bagian dari-Nya. Sungguh, manusia itu pengingkar (nikmat Tuhan) yang nyata."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4340",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4340.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4340.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Walaupun Allah telah menerangkan kekuasaan-Nya dalam menciptakan langit dan bumi serta menundukkan hewan ternak untuk manusia, sebagian manusia masih saja mempersekutukan Allah dengan makhluk-Nya. Dan mereka, yakni orang-orang musyrik, menjadikan sebagian dari hamba-hamba-Nya, yang merupakan ciptaan-Nya sebagai bagian dari-Nya, dengan menganggap bahwa malaikat adalah anak-anak Tuhan. Sesungguhnya, manusia yang mempercayai dan mengatakan demikian itu benar-benar pengingkar nikmat Tuhan, yang melampaui batas dalam kekafirannya, lagi yang nyata kesyirikan dan keingkarannya.",
                        "long": "Allah menerangkan bahwa sekalipun orang musyrik mengakui bahwa Allah yang menciptakan langit dan bumi, namun di samping itu mereka pun menetapkan bahwa Allah mempunyai anak, dan malaikat merupakan anak perempuan-Nya.\n\nMereka mengatakan, Allah tidak azali seperti makhluk, sama-sama mempunyai anak, malah merendahkan-Nya karena Allah dikatakan mempunyai anak perempuan, sedang mereka mempunyai anak laki-laki. Orang-orang Arab pada waktu itu menganggap orang yang mempunyai anak-anak perempuan itu hina. Jadi, tidak heran kalau ayat itu ditutup dengan satu ketegasan bahwa manusia benar-benar pengingkar nikmat Tuhan, yang telah dikaruniakan kepada mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4341,
                    "inSurah": 16
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 425,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمِ اتَّخَذَ مِمَّا يَخْلُقُ بَنَاتٍ وَأَصْفَاكُم بِالْبَنِينَ",
                    "transliteration": {
                        "en": "Amit takhaza mimmaa yakhluqu banaatinw wa asfaakum bilbaneen"
                    }
                },
                "translation": {
                    "en": "Or has He taken, out of what He has created, daughters and chosen you for [having] sons?",
                    "id": "Pantaskah Dia mengambil anak perempuan dari yang diciptakan-Nya dan memberikan anak laki-laki kepadamu?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4341",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4341.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4341.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Lalu Allah mengecam apa yang telah di katakan dan di yakini oleh orang-orang musyrik dengan mengatakan, “Pantaskah Dia, Allah Yang Maha Esa, Yang Mahakuasa, dan Yang Maha Pencipta itu mengambil dengan sungguh-sungguh dari apa yang di ciptakan-Nya sendiri berupa anak-anak perempuan yang justru orang-orang musyrik itu tidak suka mendapatkannya? Tentulah tidak pantas. Dan pantas pulakah kamu beranggapan bahwa Allah memberikan anak laki-laki kepadamu? Tentulah tidak pantas. Sungguh ini kepercayaan yang sangat keliru dan tidak masuk akal.”",
                        "long": "Allah membuka tabir kesesatan orang musyrik dan kebatilan ucapan mereka. Apakah masuk akal bahwa Allah memiliki sesuatu untuk diri-Nya yang lebih buruk (menurut anggapan mereka) sedangkan yang lain memiliki yang baik dan memilih untuk diri-Nya anak perempuan, sedangkan untuk orang lain anak laki-laki? Firman Allah:\n\nApakah (pantas) untuk kamu yang laki-laki dan untuk-Nya yang perempuan?\n\nYang demikian itu tentulah suatu pembagian yang tidak adil. (an-Najm/53: 21-22)\n\nDan firman-Nya:\n\nApakah Dia (Allah) memilih anak-anak perempuan daripada anak-anak laki-laki? Mengapa kamu ini? Bagaimana (caranya) kamu menetapkan? Maka mengapa kamu tidak memikirkan? (ash-shaffat/37: 153-155)\n\nDan firman-Nya lagi:\n\nSekiranya Allah hendak mengambil anak, tentu Dia akan memilih apa yang Dia kehendaki dari apa yang telah diciptakan-Nya. Mahasuci Dia. Dialah Allah Yang Maha Esa, Mahaperkasa. (az-Zumar/39: 4)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4342,
                    "inSurah": 17
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 425,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِذَا بُشِّرَ أَحَدُهُم بِمَا ضَرَبَ لِلرَّحْمَٰنِ مَثَلًا ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ",
                    "transliteration": {
                        "en": "Wa izaa bushshira ahaduhum bimaa daraba lir Rahmaani masalan zalla wajhuhoo muswaddanw wa hua kazeem"
                    }
                },
                "translation": {
                    "en": "And when one of them is given good tidings of that which he attributes to the Most Merciful in comparison, his face becomes dark, and he suppresses grief.",
                    "id": "Dan apabila salah seorang di antara mereka diberi kabar gembira dengan apa (kelahiran anak perempuan) yang dijadikan sebagai perumpamaan bagi (Allah) Yang Maha Pengasih, jadilah wajahnya hitam pekat, karena menahan sedih (dan marah)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4342",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4342.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4342.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah menegaskan apa yang di kecam-Nya di dalam ayat sebelumnya dengan mengatakan bahwa apabila salah seorang di antara mereka, yaitu kaum musyrik Mekah yang berkeyakinan seperti itu, diberi kabar gembira dengan kelahiran apa, yaitu anak perempuan, yang di jadikan sebagai perumpamaan bagi Al-Rahman, Allah Yang Maha Pengasih, jadilah wajahnya hitam pekat karena kejengkelan dan kemarahan menerima kehadiran anak perempuan itu, sedang ia sendiri ketika menerima berita itu amat menahan sedih dan marah. Kalau demikian halnya, mengapa mereka menyatakan bahwa Allah memiliki anak perempuan?",
                        "long": "Allah menunjukkan kebodohan orang-orang musyrik dan kecurangan mereka. Apabila salah seorang dari mereka dikaruniai anak perempuan, dengan serta-merta mukanya menjadi sangat muram karena sedih, menanggung malu yang amat dalam, tak kuat rasanya berhadapan muka dengan teman-temannya. Dia menyendiri dalam kebingungan. Apakah kiranya yang akan diperbuatnya? Apakah anak perempuan yang diperolehnya itu akan dibiarkan begitu saja, sekalipun ia harus menanggung malu dan hina, ataukah akan menguburkannya hidup-hidup? Suatu perbuatan yang sangat tercela, sebagaimana firman Allah:\n\nPadahal apabila seseorang dari mereka diberi kabar dengan (kelahiran) anak perempuan, wajahnya menjadi hitam (merah padam), dan dia sangat marah. Dia bersembunyi dari orang banyak, disebabkan kabar buruk yang disampaikan kepadanya. Apakah dia akan memeliharanya dengan (menanggung) kehinaan atau akan membenamkannya ke dalam tanah (hidup-hidup)? Ingatlah alangkah buruknya (putusan) yang mereka tetapkan itu. (an-Nahl/16: 58-59)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4343,
                    "inSurah": 18
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 425,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَوَمَن يُنَشَّأُ فِي الْحِلْيَةِ وَهُوَ فِي الْخِصَامِ غَيْرُ مُبِينٍ",
                    "transliteration": {
                        "en": "Awa mai yunashsha'u fil hilyati wa huwa fil khisaami ghairu mubeen"
                    }
                },
                "translation": {
                    "en": "So is one brought up in ornaments while being during conflict unevident [attributed to Allah]?",
                    "id": "Dan apakah patut (menjadi anak Allah) orang yang dibesarkan sebagai perhiasan sedang dia tidak mampu memberi alasan yang tegas dan jelas dalam pertengkaran."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4343",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4343.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4343.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Lalu Allah mengecam mereka dengan mengatakan bahwa apakah orang, yakni wanita-wanita yang dibesarkan dalam perhiasan, patut dijadikan sebagai anak Allah sedang dia tidak mampu memberi alasan atau penjelasan yang tegas dan jelas dalam pertengkaran.",
                        "long": "Allah membantah anggapan kaum musyrik bahwa Allah mempunyai anak perempuan sedangkan mereka mempunyai anak laki-laki. Bantahan itu ialah: Apakah orang yang dilahirkan dan dibesarkan untuk berhias dan bila ia dalam bertukar pikiran dan berdiskusi tidak sanggup mengemukakan hujjah atau alasan yang kuat, karena dia lebih terpengaruh oleh perasaan daripada mempergunakan akal dan pikiran, adakah orang seperti ini patut dianggap anak Tuhan?"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4344,
                    "inSurah": 19
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 425,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَجَعَلُوا الْمَلَائِكَةَ الَّذِينَ هُمْ عِبَادُ الرَّحْمَٰنِ إِنَاثًا ۚ أَشَهِدُوا خَلْقَهُمْ ۚ سَتُكْتَبُ شَهَادَتُهُمْ وَيُسْأَلُونَ",
                    "transliteration": {
                        "en": "Wa ja'alul malaaa'ikatal lazeena hum 'ibaadur Rahmaani inaasaa; a shahidoo khalaqhum; satuktabu shahaa datuhum wa yus'aloon"
                    }
                },
                "translation": {
                    "en": "And they have made the angels, who are servants of the Most Merciful, females. Did they witness their creation? Their testimony will be recorded, and they will be questioned.",
                    "id": "Dan mereka menjadikan malaikat-malaikat hamba-hamba (Allah) Yang Maha Pengasih itu sebagai jenis perempuan. Apakah mereka menyaksikan penciptaan (malaikat-malaikat itu)? Kelak akan dituliskan kesaksian mereka dan akan dimintakan pertanggungjawaban."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4344",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4344.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4344.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah menegaskan apa yang dinyatakan-Nya di dalam ayat di atas dengan mengatakan bahwa mereka, orang-orang musyrik Mekah, menjadikan malaikat-malaikat yang mereka itu hamba-hamba Allah Yang Maha Pengasih yang sangat taat dan senantiasa beribadah kepada-Nya itu sebagai berjenis kelamin perempuan. Apakah mereka menyaksikan sendiri dengan mata kepala mereka atau melalui bukti-bukti yang pasti menyangkut penciptaan mereka, yakni malaikat-malaikat itu pada saat diciptakan ataukah melihat wujud malaikat itu setelah diciptakan? Hal itu pastilah tidak akan terjadi. Mereka tidak menyaksikannya. Kelak akan dituliskan di dalam catatan amal mereka oleh malaikat yang ditugaskan untuk itu kesaksian mereka dan akan dimintai pertanggungjawaban di akhirat kelak.",
                        "long": "Ayat ini menerangkan bahwa kaum musyrik telah berbuat empat kesalahan besar yang menunjukkan kekafiran mereka. Pertama, dikatakannya bahwa Allah mempunyai anak; kedua, anak-anak Allah perempuan; dan ketiga, anak-anak Allah itu adalah malaikat, padahal malaikat adalah hamba yang dimuliakan-Nya, yang senantiasa menyembah Tuhan siang dan malam, dan tidak pernah menyalahi apa yang diperintahkan kepadanya. Malaikat yang bersifat demikian dikatakannya perempuan. Keempat, anggapan mereka bahwa mereka menjadi musyrik karena ditakdirkan oleh Allah. Semua pernyataan mereka itu adalah dosa besar dan kebohongan yang tidak berdasar sama sekali.\n\nApakah mereka menyaksikan penciptaan malaikat-malaikat itu sehingga mereka berani menetapkan yang demikian dan yakin bahwa malaikat itu perempuan? Allah berfirman:\n\nAtau apakah Kami menciptakan malaikat-malaikat berupa perempuan sedangkan mereka menyaksikan(nya)?Ingatlah, sesungguhnya di antara kebohongannya mereka benar-benar mengatakan,\"Allah mempunyai anak.\" Dan sungguh, mereka benar-benar pendusta. (as-shaffat/37: 150-152)\n\nAyat 19 ini ditutup dengan satu ancaman kepada orang musyrik bahwa apa yang mereka katakan mengenai malaikat, semua itu akan dicatat dan akan dimintai pertanggungjawaban mereka di akhirat kelak.\n\nSatu lagi diperlihatkan perbuatan sesat dan orang musyrik. Mereka berkata dengan nada mengejek, \"Sekiranya Allah yang Maha Pemurah menghendaki, niscaya kami tidak menyembah malaikat itu.\" Seakan-akan mereka menyembah malaikat karena kehendak Allah. Allah berfirman:\n\nOrang-orang musyrik akan berkata, \"Jika Allah menghendaki, tentu kami tidak akan mempersekutukan-Nya. (al-An'am/6: 148)\n\nPendirian mereka sangat keliru dan sesat, karena Allah tidak pernah merestui suatu penyembahan terhadap sesuatu selain Dia, Allah hanya memerintahkan agar manusia hanya menyembah kepada-Nya, sebagaimana firman-Nya:\n\nDan sungguh, Kami telah mengutus seorang rasul untuk setiap umat (untuk menyerukan), \"Sembahlah Allah, dan jauhilah thagut\" (an-Nahl/16: 36)\n\nDan firman-Nya:\n\nDan tanyakanlah (Muhammad) kepada rasul-rasul Kami yang telah Kami utus sebelum engkau, \"Apakah Kami menentukan tuhan-tuhan selain (Allah) Yang Maha Pengasih untuk disembah?\" (az-Zukhruf/43: 45)\n\nAyat 20 ini ditutup dengan satu ketegasan, menolak ucapan orang musyrik itu, bahwa mereka tidak tahu sama sekali keadaan yang sebenarnya dan tidak mempunyai pengetahuan sedikit pun mengenai hal itu. Apa yang dikatakan mereka hanya dugaan belaka dan tidak berdasarkan hak dan kebenaran."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4345,
                    "inSurah": 20
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 425,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالُوا لَوْ شَاءَ الرَّحْمَٰنُ مَا عَبَدْنَاهُم ۗ مَّا لَهُم بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَخْرُصُونَ",
                    "transliteration": {
                        "en": "Wa qaaloo law shaaa'ar Rahmaanu maa 'abadnaahum; maa lahum bizaalika min 'ilmin in hum illaa yakhrusoon"
                    }
                },
                "translation": {
                    "en": "And they said, \"If the Most Merciful had willed, we would not have worshipped them.\" They have of that no knowledge. They are not but falsifying.",
                    "id": "Dan mereka berkata, “Sekiranya (Allah) Yang Maha Pengasih menghendaki, tentulah kami tidak menyembah mereka (malaikat).” Mereka tidak mempunyai ilmu sedikit pun tentang itu. Tidak lain mereka hanyalah menduga-duga belaka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4345",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4345.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4345.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan hal yang lebih buruk lagi dari sikap mereka adalah ketika mereka berkata, “Sekiranya Allah Yang Maha Pengasih menghendaki agar kami tidak menyembah para malaikat-malaikat itu, tentulah kami tidak menyembah mereka.” Mereka, orang-orang musyrik yang menyatakan bahwa para malaikat itu berjenis kelamin perempuan, tidak mempunyai ilmu sedikit pun tentang itu. Tidak lain mereka hanyalah menduga-duga belaka dan mengada-ada, bahkan mereka berbohong.",
                        "long": "Ayat ini menerangkan bahwa kaum musyrik telah berbuat empat kesalahan besar yang menunjukkan kekafiran mereka. Pertama, dikatakannya bahwa Allah mempunyai anak; kedua, anak-anak Allah perempuan; dan ketiga, anak-anak Allah itu adalah malaikat, padahal malaikat adalah hamba yang dimuliakan-Nya, yang senantiasa menyembah Tuhan siang dan malam, dan tidak pernah menyalahi apa yang diperintahkan kepadanya. Malaikat yang bersifat demikian dikatakannya perempuan. Keempat, anggapan mereka bahwa mereka menjadi musyrik karena ditakdirkan oleh Allah. Semua pernyataan mereka itu adalah dosa besar dan kebohongan yang tidak berdasar sama sekali.\n\nApakah mereka menyaksikan penciptaan malaikat-malaikat itu sehingga mereka berani menetapkan yang demikian dan yakin bahwa malaikat itu perempuan? Allah berfirman:\n\nAtau apakah Kami menciptakan malaikat-malaikat berupa perempuan sedangkan mereka menyaksikan(nya)?Ingatlah, sesungguhnya di antara kebohongannya mereka benar-benar mengatakan,\"Allah mempunyai anak.\" Dan sungguh, mereka benar-benar pendusta. (as-shaffat/37: 150-152)\n\nAyat 19 ini ditutup dengan satu ancaman kepada orang musyrik bahwa apa yang mereka katakan mengenai malaikat, semua itu akan dicatat dan akan dimintai pertanggungjawaban mereka di akhirat kelak.\n\nSatu lagi diperlihatkan perbuatan sesat dan orang musyrik. Mereka berkata dengan nada mengejek, \"Sekiranya Allah yang Maha Pemurah menghendaki, niscaya kami tidak menyembah malaikat itu.\" Seakan-akan mereka menyembah malaikat karena kehendak Allah. Allah berfirman:\n\nOrang-orang musyrik akan berkata, \"Jika Allah menghendaki, tentu kami tidak akan mempersekutukan-Nya. (al-An'am/6: 148)\n\nPendirian mereka sangat keliru dan sesat, karena Allah tidak pernah merestui suatu penyembahan terhadap sesuatu selain Dia, Allah hanya memerintahkan agar manusia hanya menyembah kepada-Nya, sebagaimana firman-Nya:\n\nDan sungguh, Kami telah mengutus seorang rasul untuk setiap umat (untuk menyerukan), \"Sembahlah Allah, dan jauhilah thagut\" (an-Nahl/16: 36)\n\nDan firman-Nya:\n\nDan tanyakanlah (Muhammad) kepada rasul-rasul Kami yang telah Kami utus sebelum engkau, \"Apakah Kami menentukan tuhan-tuhan selain (Allah) Yang Maha Pengasih untuk disembah?\" (az-Zukhruf/43: 45)\n\nAyat 20 ini ditutup dengan satu ketegasan, menolak ucapan orang musyrik itu, bahwa mereka tidak tahu sama sekali keadaan yang sebenarnya dan tidak mempunyai pengetahuan sedikit pun mengenai hal itu. Apa yang dikatakan mereka hanya dugaan belaka dan tidak berdasarkan hak dan kebenaran."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4346,
                    "inSurah": 21
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 425,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمْ آتَيْنَاهُمْ كِتَابًا مِّن قَبْلِهِ فَهُم بِهِ مُسْتَمْسِكُونَ",
                    "transliteration": {
                        "en": "Am aatainaahum Kitaabam min qablihee fahum bihee mustamsikoon"
                    }
                },
                "translation": {
                    "en": "Or have We given them a book before the Qur'an to which they are adhering?",
                    "id": "Atau apakah pernah Kami berikan sebuah kitab kepada mereka sebelumnya, lalu mereka berpegang (pada kitab itu)?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4346",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4346.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4346.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Atau kalau mereka tidak pernah menyaksikan penciptaan para malaikat dan menyaksikan wujudnya, apakah pernah Kami berikan informasi atau pengetahuan yang menjelaskan mengenai hal itu melalui sebuah kitab yang diturunkan kepada mereka sebelumnya, yaitu sebelum Al-Qur’an diturunkan, lalu mereka berpegang teguh dengannya, yaitu dengan informasi di dalam kitab itu? Sama sekali tidak. Mereka tidak pernah memiliki informasi mengenai hal itu.",
                        "long": "Allah menambahkan penjelasan dalam rangka penolakan-Nya terhadap anggapan orang-orang musyrik bahwa mereka menyembah malaikat karena kehendak Allah, dengan firman-Nya, \"Apakah memang pernah kami memberikan kepada mereka sebuah kitab sebelum Al-Qur'an, lalu mereka berpegang teguh kepada kitab itu? Tidak, sama sekali tidak. Pendirian mereka hanya didasarkan atas dugaan dan sangkaan yang mengandung dusta, firman Allah:\n\nYang mereka ikuti hanya persangkaan belaka dan mereka hanyalah membuat kebohongan. (al-An'am/6: 116)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4347,
                    "inSurah": 22
                },
                "meta": {
                    "juz": 25,
                    "page": 490,
                    "manzil": 6,
                    "ruku": 425,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "بَلْ قَالُوا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِم مُّهْتَدُونَ",
                    "transliteration": {
                        "en": "Bal qaalooo innaa wajadnaaa aabaaa'anaa 'alaaa ummatinw wa innaa 'alaaa aasaarihim muhtadoon"
                    }
                },
                "translation": {
                    "en": "Rather, they say, \"Indeed, we found our fathers upon a religion, and we are in their footsteps [rightly] guided.\"",
                    "id": "Bahkan mereka berkata, “Sesungguhnya kami mendapati nenek moyang kami menganut suatu agama, dan kami mendapat petunjuk untuk mengikuti jejak mereka.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4347",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4347.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4347.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Bahkan setelah kehabisan alasan dan dalih atas kesesatan mereka, mereka berkata, “Sesungguhnya kami mendapati nenek moyang dan leluhur kami menganut suatu agama, yakni suatu keyakinan dan kepercayaan yang patut kami ikuti dan teladani, dan sesungguhnya kami mendapat petunjuk untuk mengikuti jejak mereka.”",
                        "long": "Allah menerangkan bahwa apa yang disangka sebagai alasan untuk mempersekutukan Allah, sama sekali tidak benar, dan tidak mempunyai alasan yang dapat diandalkan. Mereka semata-mata hanya bertaklid mengikuti dan berpegang teguh kepada apa yang telah diperbuat oleh nenek moyang mereka, karena mereka yakin bahwa nenek moyang mereka berpengetahuan luas, dan tidak akan menyesatkan orang-orang yang mengikutinya, malahan mereka akan mendapat petunjuk. Mereka memutarbalikkan keadaan, karena sebenarnya mereka telah sesat, tidak mendapat petunjuk, sebagaimana firman Allah:\n\nSungguh, mereka telah sesat dan tidak mendapat petunjuk. (al-An'am/6: 140)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4348,
                    "inSurah": 23
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 425,
                    "hizbQuarter": 196,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَكَذَٰلِكَ مَا أَرْسَلْنَا مِن قَبْلِكَ فِي قَرْيَةٍ مِّن نَّذِيرٍ إِلَّا قَالَ مُتْرَفُوهَا إِنَّا وَجَدْنَا آبَاءَنَا عَلَىٰ أُمَّةٍ وَإِنَّا عَلَىٰ آثَارِهِم مُّقْتَدُونَ",
                    "transliteration": {
                        "en": "Wa kazaalika maaa arsalnaa min qablika fee qaryatim min nazeerin illaa qaala mutrafoohaaa innaa wajadnaaa aabaaa'anaa 'alaaa ummatinw wa innaa 'alaaa aasaarihim muqtadoon"
                    }
                },
                "translation": {
                    "en": "And similarly, We did not send before you any warner into a city except that its affluent said, \"Indeed, we found our fathers upon a religion, and we are, in their footsteps, following.\"",
                    "id": "Dan demikian juga ketika Kami mengutus seorang pemberi peringatan sebelum engkau (Muhammad) dalam suatu negeri, orang-orang yang hidup mewah (di negeri itu) selalu berkata, “Sesungguhnya kami mendapati nenek moyang kami menganut suatu (agama) dan sesungguhnya kami sekedar pengikut jejak-jejak mereka.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4348",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4348.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4348.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan apa yang dikatakan oleh kaum musyrik Mekah kepadamu sekarang, wahai Nabi Muhammad, demikian juga yang dikatakan oleh umat-umat terdahulu ketika Kami mengutus seorang pemberi peringatan, yaitu nabi atau rasul sebelum engkau diutus, dalam suatu negeri di lokasi mana pun di bumi ini, orang-orang yang hidup mewah secara durhaka di masing-masing negeri itu selalu berkata, “Sesungguhnya kami mendapati nenek moyang kami yang juga orang-orang terkemuka dan paham menganut suatu agama, yakni kepercayaan yang mereka yakini benar dan sesungguhnya kami tidak lain, kecuali sekadar pengikut-pengikut yang mengikuti jejak-jejak mereka.”",
                        "long": "Pada ayat ini Allah menghibur Nabi Muhammad saw bahwa tidak seorang rasul pun yang diutus ke suatu negeri sebelum Muhammad saw mendapat sambutan dengan kata-kata yang menyenangkan hati. Mereka semua mendapat jawaban yang tidak enak didengar dan sangat menjengkelkan hati. Sikap yang demikian berasal dari orang-orang yang terbiasa hidup mewah, sombong dan angkuh. Mereka berkata, \"Sesungguhnya kami mendapatkan nenek moyang kami menganut suatu agama dan sesungguhnya kami adalah pengikut jejak mereka.\" Jadi, kalau Muhammad saw mendapat jawaban seperti itu tidak perlu gusar dan merasa sesak dada. Apa yang dikatakan kepada Muhammad saw telah dikatakan pula kepada rasul-rasul sebelumnya, sebagaimana firman Allah:\n\nApa yang dikatakan (oleh orang-orang kafir) kepadamu tidak lain adalah apa yang telah dikatakan kepada rasul-rasul sebelummu. (Fussilat/41: 43)\n\nBegitu pula kalau dikatakan bahwa Nabi Muhammad saw tukang sihir, atau gila oleh kaumnya, itu pun karena rasul-rasul sebelumnya telah dituduh seperti itu juga oleh kaumnya, firman Allah:\n\nDemikianlah setiap kali seorang rasul yang datang kepada orang-orang yang sebelum mereka, mereka (kaumnya) pasti mengatakan, \"Dia itu pesihir atau orang gila.\" (adh-dzariyat/51: 52)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4349,
                    "inSurah": 24
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 425,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ قَالَ أَوَلَوْ جِئْتُكُم بِأَهْدَىٰ مِمَّا وَجَدتُّمْ عَلَيْهِ آبَاءَكُمْ ۖ قَالُوا إِنَّا بِمَا أُرْسِلْتُم بِهِ كَافِرُونَ",
                    "transliteration": {
                        "en": "Qaala awa law ji'tukum bi ahdaa mimmaa wajattum 'alaihi aabaaa'akum qaalooo innaa bimaaa ursiltum bihee kaafiroon"
                    }
                },
                "translation": {
                    "en": "[Each warner] said, \"Even if I brought you better guidance than that [religion] upon which you found your fathers?\" They said, \"Indeed we, in that with which you were sent, are disbelievers.\"",
                    "id": "(Rasul itu) berkata, “Apakah (kamu akan mengikutinya juga) sekalipun aku membawa untukmu (agama) yang lebih baik daripada apa yang kamu peroleh dari (agama) yang dianut nenek moyangmu.” Mereka menjawab, “Sesungguhnya kami mengingkari (agama) yang kamu diperintahkan untuk menyampaikannya.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4349",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4349.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4349.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Apa yang dikatakan oleh umat-umat terdahulu itu dijawab oleh para rasul utusan Allah itu dengan mengatakan, “Dan apakah kamu akan mengikutinya juga sekalipun aku membawa untukmu agama, yakni keyakinan dan kepercayaan, yang lebih baik daripada apa yang kamu peroleh dari agama dan kepercayaan yang dianut nenek moyangmu dahulu?” Dengan sikap menentang, mereka menjawab, “Sesungguhnya kami mengingkari agama yang kamu diperintahkan untuk menyampaikannya.”",
                        "long": "Allah menerangkan bahwa Nabi Muhammad menghimbau kaumnya dengan ucapan, \"Apakah kamu masih tetap mengikuti jejak nenek moyang kamu, sekalipun aku membawa untukmu suatu agama yang nyata dan lebih baik daripada apa yang telah dianut oleh nenek moyangmu itu?\" Kaumnya menjawab dengan sombong, bahwa mereka akan tetap mengikuti jejak nenek moyang mereka dan tidak akan mengikuti agama yang dibawanya, yakni agama yang ditugaskan kepadanya untuk menyampaikannya, dan mereka tetap akan mengingkarinya, sebagaimana firman Allah:\n\nOrang-orang yang menyombongkan diri berkata, \"Sesungguhnya kami mengingkari apa yang kamu percayai.\" (al-A'raf/7: 76)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4350,
                    "inSurah": 25
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 425,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَانتَقَمْنَا مِنْهُمْ ۖ فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُكَذِّبِينَ",
                    "transliteration": {
                        "en": "Fantaqamnaa minhum fanzur kaifa kaana 'aaqibatul mukazzibeen"
                    }
                },
                "translation": {
                    "en": "So we took retribution from them; then see how was the end of the deniers.",
                    "id": "Lalu Kami binasakan mereka, maka perhatikanlah bagaimana kesudahan orang-orang yang mendustakan (kebenaran)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4350",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4350.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4350.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Lalu, akibat dari keyakinan dan kepercayaan mereka yang salah dan penentangan terhadap apa yang dibawa oleh para rasul itu, Kami binasakan mereka dengan berbagai macam siksaan. Maka perhatikanlah, wahai Muhammad atau siapa pun yang mau memperhatikan dan mengambil pelajaran, bagaimana kesudahan orang-orang terdahulu yang mendustakan kebenaran yang dibawa oleh para rasul itu.",
                        "long": "Allah menerangkan bahwa orang-orang yang tetap membangkang dan senantiasa mendustakan rasul-rasul yang diutus kepada mereka dan mengingkari ketuhanan Allah, akan dibinasakan sebagai akibat dari perbuatan mereka yang selalu mendustakan ayat-ayat Allah; kiranya hal itu dapat disaksikan dan menjadi iktibar sesuai dengan firman-Nya:\n\nMaka berjalanlah kamu di bumi dan perhatikanlah bagaimana kesudahan orang yang mendustakan (rasul-rasul). (an-Nahl/16: 36)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4351,
                    "inSurah": 26
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 426,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ وَقَوْمِهِ إِنَّنِي بَرَاءٌ مِّمَّا تَعْبُدُونَ",
                    "transliteration": {
                        "en": "Wa iz qaala Ibraaheemu liabeehi wa qawmiheee innane baraaa'um mimmaa ta'budo"
                    }
                },
                "translation": {
                    "en": "And [mention, O Muhammad], when Abraham said to his father and his people, \"Indeed, I am disassociated from that which you worship",
                    "id": "Dan (ingatlah) ketika Ibrahim berkata kepada ayahnya dan kaumnya, “Sesungguhnya aku berlepas diri dari apa yang kamu sembah,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4351",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4351.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4351.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ingatlah ketika Nabi Ibrahim, nenek moyang mereka yang tidak mau mengikuti jejak buruk dari leluhurnya, berkata kepada ayah-nya dan kaumnya yang menyekutukan Allah dan menyembah berhala-berhala, “Sesungguhnya aku berlepas diri dari apa, yaitu berhala-berhala, yang kamu sembah.",
                        "long": "Allah memerintahkan kepada Muhammad saw supaya dia memperingatkan kaumnya yang fanatik kepada nenek moyangnya bahwa Nabi Ibrahim telah berlepas diri dari bapak dan kaumnya ketika dia melihat mereka bersungguh-sungguh menyembah berhala, karena yang demikian itu adalah satu hal yang tidak pantas dan membawa kepada kesesatan sebagaimana firman Allah:\n\nDan (ingatlah) ketika Ibrahim berkata kepada ayahnya Azar, \"Pantaskah engkau menjadikan berhala-berhala itu sebagai tuhan? Sesungguhnya aku melihat engkau dan kaummu dalam kesesatan yang nyata.\" (al-An'am/6: 74)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4352,
                    "inSurah": 27
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 426,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِلَّا الَّذِي فَطَرَنِي فَإِنَّهُ سَيَهْدِينِ",
                    "transliteration": {
                        "en": "Illal lazee fataranee innahoo sa yahdeen"
                    }
                },
                "translation": {
                    "en": "Except for He who created me; and indeed, He will guide me.\"",
                    "id": "kecuali (kamu menyembah) Allah yang menciptakanku; karena sungguh, Dia akan memberi petunjuk kepadaku.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4352",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4352.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4352.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "kecuali yang kamu sembah itu adalah Allah, Tuhan yang telah menciptakan aku, menciptakan kalian, dan apa yang kamu sembah itu; karena sesungguhnya Dia pulalah yang akan memberi petunjuk kepadaku untuk kebahagiaan hidup di dunia dan akhirat.”",
                        "long": "Dalam ayat ini Nabi Ibrahim menegaskan pendiriannya setelah dia berlepas diri dari bapak dan kaumnya, bahwa dia hanya menyembah Allah yang menciptakannya dan yang menciptakan seluruh manusia. Dia yang akan menunjukkan jalan yang baik dan benar, yang akan membawa manusia kepada kebahagiaan dunia dan akhirat. Dia yang menyediakan dan memberi makan dan minum, menyembuhkan orang sakit. Tuhan yang mematikan dan menghidupkan, Tuhan yang diharapkan mengampuni dosa di akhirat. Penegasan Nabi Ibrahim diabadikan di dalam Al-Qur'an sebagaimana firman Allah:\n\n(yaitu) Yang telah menciptakan aku, maka Dia yang memberi petunjuk kepadaku, dan Yang memberi makan dan minum kepadaku; dan apabila aku sakit, Dialah yang menyembuhkan aku, dan Yang akan mematikan aku, kemudian akan menghidupkan aku (kembali), dan Yang sangat kuinginkan akan mengampuni kesalahanku pada hari Kiamat.\" (asy-Syura/26: 78-82)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4353,
                    "inSurah": 28
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 426,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَجَعَلَهَا كَلِمَةً بَاقِيَةً فِي عَقِبِهِ لَعَلَّهُمْ يَرْجِعُونَ",
                    "transliteration": {
                        "en": "Wa ja'alahaa Kalimatam baaqiyatan fee 'aqibihee la'al lahum yarji'oon"
                    }
                },
                "translation": {
                    "en": "And he made it a word remaining among his descendants that they might return [to it].",
                    "id": "Dan (Ibrahim) menjadikan (kalimat tauhid) itu kalimat yang kekal pada keturunannya agar mereka kembali (kepada kalimat tauhid itu)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4353",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4353.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4353.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan dia, yakni Ibrahim, menjadikannya, yakni kalimat tauhid yang disampaikannya kepada kaumnya itu, kalimat yang kekal pada keturunannya sesudahnya agar mereka kembali kepada kalimat tauhid itu apabila suatu saat nanti mereka menyimpang dari jalan yang benar dengan menyekutukan Allah.",
                        "long": "Allah menerangkan bahwa Nabi Ibrahim menjadikan kalimat tauhid itu kalimat yang kekal, agar penduduk Mekah dapat menyadarinya, lalu meninggalkan agama nenek moyangnya yang sesat dan mengikuti agama tauhid yang dianut nenek moyang mereka yang tidak sesat yaitu Ibrahim apalagi jika mereka mengingat, bahwa Nabi Ibrahimlah kebanggaan mereka karena membangun Baitullah yang menjadi kiblat umat Islam sedunia ketika mendirikan salat.\n\nQatadah berkata, \"Dari keturunan Ibrahim itu senantiasa ada yang menyembah Allah sampai hari Kiamat.\" Dan Ibnu 'Arabi berkata, \"Bahwasanya keturunan Ibrahim dapat turun-temurun beragama tauhid, karena dua doanya yang telah diperkenankan oleh Allah, pertama:\n\n\"Sesungguhnya Aku menjadikan engkau sebagai pemimpin bagi seluruh manusia.\" Dia (Ibrahim) berkata, \"Dan (juga) dari anak cucuku?\" Allah berfirman, \"(Benar, tetapi) janji-Ku tidak berlaku bagi orang-orang zalim.\" (al-Baqarah/2: 124) \n\ndan kedua:\n\nDan jauhkanlah aku beserta anak cucuku agar tidak menyembah berhala. (Ibrahim/14: 35)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4354,
                    "inSurah": 29
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 426,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "بَلْ مَتَّعْتُ هَٰؤُلَاءِ وَآبَاءَهُمْ حَتَّىٰ جَاءَهُمُ الْحَقُّ وَرَسُولٌ مُّبِينٌ",
                    "transliteration": {
                        "en": "Bal matta'tu haaa'ulaaa'i wa aabaaa'ahum hattaa jaaa'a humul haqqu wa Rasoolum mubeen"
                    }
                },
                "translation": {
                    "en": "However, I gave enjoyment to these [people of Makkah] and their fathers until there came to them the truth and a clear Messenger.",
                    "id": "Bahkan Aku telah memberikan kenikmatan hidup kepada mereka dan nenek moyang mereka sampai kebenaran (Al-Qur'an) datang kepada mereka beserta seorang Rasul yang memberi penjelasan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4354",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4354.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4354.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Bahkan Allah menyatakan, “Aku, Tuhan Yang Maha Esa, telah memberikan kenikmatan hidup kepada mereka, yakni kaum Nabi Ibrahim yang menyekutukan-Ku dan nenek moyang mereka yang durhaka itu dan tidak menurunkan siksaan kepada mereka semua sampai kebenaran yang mutlak yang tidak diragukan lagi kebenarannya, yaitu Al-Qur’an, datang kepada mereka dan datang pula seorang rasul, yaitu Nabi Muhammad, yang memberi penjelasan.”",
                        "long": "Allah menerangkan bahwa Dia telah memberikan kenikmatan kepada orang-orang musyrik dan nenek moyang mereka sejak dahulu kala, memanjangkan umur mereka, menganugerahkan beraneka ragam nikmat, tetapi mereka itu terpesona oleh nikmat yang ada pada mereka, terpengaruh oleh kehendak hawa nafsu mereka, lalu menuruti ajakan setan dan melupakan kalimat tauhid. Maka Allah menjadikan dari keturunan Ibrahim orang-orang yang mengesakan Allah, menyuruh orang-orang kafir di antara mereka agar beriman kepada-Nya, maka dipilih-Nyalah Muhammad saw sebagai Rasul dan diturunkan-Nya Al-Qur'an sebagai kitab yang berisi petunjuk ke jalan yang benar, menyeru mereka untuk berbuat amal baik demi kemaslahatan dan kebahagiaan dunia dan akhirat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4355,
                    "inSurah": 30
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 426,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَمَّا جَاءَهُمُ الْحَقُّ قَالُوا هَٰذَا سِحْرٌ وَإِنَّا بِهِ كَافِرُونَ",
                    "transliteration": {
                        "en": "Wa lammaa jaaa'ahumul haqqu qaaloo haazaa sihrunw wa innaa bihee kaafiroon"
                    }
                },
                "translation": {
                    "en": "But when the truth came to them, they said, \"This is magic, and indeed we are, concerning it, disbelievers.\"",
                    "id": "Tetapi ketika kebenaran (Al-Qur'an) itu datang kepada mereka, mereka berkata, “Ini adalah sihir dan sesungguhnya kami mengingkarinya.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4355",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4355.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4355.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ketika kebenaran, yakni Al-Qur’an, itu datang kepada mereka, dengan penuh keangkuhan, penghinaan, dan pelecehan mereka berkata, “Ini adalah sihir yang nyata dan sesungguhnya kami adalah orang-orang yang selamanya mengingkarinya.”",
                        "long": "Allah menerangkan bahwa ketika disampaikan kepada mereka Al-Qur'an dan mukjizat sebagai bukti kebenaran Rasul, mereka menyambutnya dengan sambutan yang tidak baik. Mereka berkata bahwa apa yang didatangkan kepada mereka adalah sihir dan bukan wahyu dari Allah, oleh karena itu mereka mengingkarinya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4356,
                    "inSurah": 31
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 426,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالُوا لَوْلَا نُزِّلَ هَٰذَا الْقُرْآنُ عَلَىٰ رَجُلٍ مِّنَ الْقَرْيَتَيْنِ عَظِيمٍ",
                    "transliteration": {
                        "en": "Wa qaaloo law laa nuzzila haazal Quraanu 'alaa rajulim minal qaryataini 'azeem"
                    }
                },
                "translation": {
                    "en": "And they said, \"Why was this Qur'an not sent down upon a great man from [one of] the two cities?\"",
                    "id": "Dan mereka (juga) berkata, “Mengapa Al-Qur'an ini tidak diturunkan kepada orang besar (kaya dan berpengaruh) dari salah satu dua negeri ini (Mekah dan Taif)?”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4356",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4356.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4356.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan mereka tidak hanya melecehkan Al-Qur’an, tetapi juga melecehkan Nabi Muhammad dengan berkata, “Mengapa Al-Qur’an ini, yang diyakini oleh Muhammad sebagai petunjuk yang diturunkan Tuhan, tidak diturunkan kepada seorang laki-laki yang agung, kaya, dan berpengaruh yang berasal dari salah satu dua negeri ini, yaitu Mekah dan Taif?”",
                        "long": "Mereka berkata, \"Kedudukan sebagai rasul adalah kedudukan yang mulia, maka sepantasnyalah orang yang memangku jabatan itu adalah orang yang mulia pula, mempunyai kekayaan dan kedudukan yang tinggi, sedangkan Muhammad saw tidak memiliki yang demikian itu. Yang pantas menduduki jabatan ini adalah salah satu dari dua orang yang memiliki hal-hal tersebut dari dua kota yang mulia pula yaitu al-Walid bin al-Mugirah dari Mekah atau 'Urwah bin Mas'ud ats-saqafi dari thaif."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4357,
                    "inSurah": 32
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 426,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَهُمْ يَقْسِمُونَ رَحْمَتَ رَبِّكَ ۚ نَحْنُ قَسَمْنَا بَيْنَهُم مَّعِيشَتَهُمْ فِي الْحَيَاةِ الدُّنْيَا ۚ وَرَفَعْنَا بَعْضَهُمْ فَوْقَ بَعْضٍ دَرَجَاتٍ لِّيَتَّخِذَ بَعْضُهُم بَعْضًا سُخْرِيًّا ۗ وَرَحْمَتُ رَبِّكَ خَيْرٌ مِّمَّا يَجْمَعُونَ",
                    "transliteration": {
                        "en": "Ahum yaqsimoona rahmata Rabbik; Nahnu qasamnaa bainahum ma'eeshatahum fil hayaatid dunyaa wa rafa'naa ba'dahum fawqa ba'din darajaatil liyattakhiza ba'duhum ba'dan sukhriyyaa; wa rahmatu Rabbika khairum mimmaa yajma'oon"
                    }
                },
                "translation": {
                    "en": "Do they distribute the mercy of your Lord? It is We who have apportioned among them their livelihood in the life of this world and have raised some of them above others in degrees [of rank] that they may make use of one another for service. But the mercy of your Lord is better than whatever they accumulate.",
                    "id": "Apakah mereka yang membagi-bagi rahmat Tuhanmu? Kamilah yang menentukan penghidupan mereka dalam kehidupan dunia, dan Kami telah meninggikan sebagian mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat memanfaatkan sebagian yang lain. Dan rahmat Tuhanmu lebih baik dari apa yang mereka kumpulkan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4357",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4357.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4357.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Atas sikap pengingkaran mereka terhadap Al-Qur’an dan kerasulan Nabi Muhammad itu, Allah lalu bertanya kepada Nabi Muhammad, “Apakah mereka, yang ingkar, durhaka, dan menyekutukan Tuhan itu, yang membagi-bagi rahmat Tuhan, Pencipta, Pemelihara, dan Pelimpah rahmat kepada-mu, wahai Nabi Muhammad? Sama sekali tidak. Mereka tidak dapat melakukan itu. Kamilah yang membagikan rahmat di antara mereka dan Kami pula lah yang menentukan penghidupan mereka dalam kehidupan dunia sesuai dengan ketentuan dan hukum-hukum yang telah Kami tetapkan. Dan Kami telah meninggikan sebagian mereka dalam kedudukan, harta, ilmu, dan jabatan mereka atas sebagian yang lain beberapa derajat, agar sebagian mereka dapat memanfaatkan sebagian yang lain sehingga mereka dapat saling membantu dan menolong dalam pemenuhan kebutuhan hidup. Dan rahmat Tuhan yang dilim-pahkan kepada mu berupa kenabian dan kerasulan lebih baik dari apa yang mereka kumpulkan, baik berupa kekayaan yang melimpah dan kekuasaan yang sangat tinggi.”",
                        "long": "Ayat ini menunjukkan penolakan terhadap keinginan orang-orang musyrik yang tak mau menerima pengangkatan Muhammad saw sebagai rasul; seakan-akan merekalah yang paling berhak dan berwenang membagi-bagi dan menentukan siapa yang pantas menerima rahmat Tuhan. Allah menyatakan, \"Sekali-kali tidaklah demikian halnya, Kamilah yang berhak dan berwenang mengatur dan menentukan penghidupan hamba dalam kehidupan dunia. Kami-lah yang melebihkan sebagian hamba atas sebagian yang lain; ada yang kaya dan ada yang lemah, ada yang pandai dan ada yang bodoh, ada yang maju dan ada yang terbelakang, karena apabila Kami menyamakan di antara hamba di dalam hal-hal tersebut di atas, maka akan terjadi persaingan di antara mereka, atau tidak terjadi situasi saling bantu-membantu antara satu dengan yang lain, dan tidak akan terjadi saling memanfaatkan antara satu dengan yang lain, sebaliknya mereka saling mengejek. Semuanya itu akan membawa kepada kehancuran dan kerusakan dunia. Kalau mereka tidak mampu berbuat seperti tersebut di atas mengenai urusan keduniaan, mengapa mereka berani menentang berbagai kebijaksanaan Allah di dalam menentukan siapa yang pantas diserahi tugas kerasulan itu. \n\nAyat ini ditutup dengan penegasan bahwa rahmat Allah dan keutamaan yang diberikan kepada orang yang telah ditakdirkan memangku jabatan kenabian dan mengikuti petunjuk wahyu dalam Al-Qur'an yang telah diturunkan, jauh lebih baik dan mulia daripada kemewahan dan kekayaan dunia yang ditimbun mereka. Demikian dikarenakan dunia dengan segala kekayaannya itu berada di tepi jurang yang akan runtuh dan akan lenyap tidak berbekas sedikit pun."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4358,
                    "inSurah": 33
                },
                "meta": {
                    "juz": 25,
                    "page": 491,
                    "manzil": 6,
                    "ruku": 426,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَوْلَا أَن يَكُونَ النَّاسُ أُمَّةً وَاحِدَةً لَّجَعَلْنَا لِمَن يَكْفُرُ بِالرَّحْمَٰنِ لِبُيُوتِهِمْ سُقُفًا مِّن فِضَّةٍ وَمَعَارِجَ عَلَيْهَا يَظْهَرُونَ",
                    "transliteration": {
                        "en": "Wa law laaa any yakoonan naasu ummatanw waahidatal laja'alnaa limany yakfuru bir Rahmaani libu yootihim suqufam min fiddatinw wa ma'aarija 'alaihaa yazharoon"
                    }
                },
                "translation": {
                    "en": "And if it were not that the people would become one community [of disbelievers], We would have made for those who disbelieve in the Most Merciful - for their houses - ceilings and stairways of silver upon which to mount",
                    "id": "Dan sekiranya bukan karena menghindarkan manusia menjadi umat yang satu (dalam kekafiran), pastilah sudah Kami buatkan bagi orang-orang yang kafir kepada (Allah) Yang Maha Pengasih, loteng-loteng rumah mereka dari perak, demikian pula tangga-tangga yang mereka naiki,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4358",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4358.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4358.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sekiranya bukan karena Kami menghindarkan semua manusia menjadi umat yang satu dalam kekafiran, pastilah sudah Kami buatkan untuk orang-orang yang kafir kepada Allah, Yang Maha Pengasih, bagi rumah-rumah mereka loteng-loteng yang terbuat dari perak, dan demikian pula tangga-tangga yang mereka naiki,",
                        "long": "Ayat ini menegaskan sekiranya bukan karena Allah hendak menghindarkan semua manusia menjadi umat yang satu dalam kekafiran akibat mereka melihat orang-orang kafir memperoleh rezeki yang lapang, karena mengira bahwa harta yang banyak adalah bukti cinta Allah kepada mereka, maka akan Allah berikan kepada orang-orang kafir itu rumah-rumah mewah yang terbuat dari emas dan perak, tetapi Allah menghendaki keimanan mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4359,
                    "inSurah": 34
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 426,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلِبُيُوتِهِمْ أَبْوَابًا وَسُرُرًا عَلَيْهَا يَتَّكِئُونَ",
                    "transliteration": {
                        "en": "Wa libu yootihim abwaabanw wa sururan 'alaihaa yattaki'oon"
                    }
                },
                "translation": {
                    "en": "And for their houses - doors and couches [of silver] upon which to recline",
                    "id": "dan (Kami buatkan pula) pintu-pintu (perak) bagi rumah-rumah mereka, dan (begitu pula) dipan-dipan tempat mereka bersandar,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4359",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4359.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4359.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "dan Kami buatkan pula pintu-pintu yang terbuat dari perak bagi rumah-rumah mereka, dan begitu pula dipan-dipan tempat mereka bersandar,",
                        "long": "Begitu juga pintu-pintu rumah orang-orang kafir, dan tempat tidur yang mereka tiduri akan dijadikan dari perak. Semua itu adalah perhiasan tempat manusia berbangga-bangga; semua itu hanya merupakan kesenangan kehidupan dunia yang sifatnya sementara, dan hanya dapat bertahan beberapa saat saja lalu hilang lenyap, sedangkan kehidupan akhirat yang penuh dengan kesenangan dan kenikmatan yang beraneka ragam dan tak terhitung banyaknya serta kekal abadi telah dipersiapkan untuk orang yang bertakwa kepada Allah, yang tidak menyekutukan-Nya, yang tidak berbuat maksiat dengan melanggar perintah-Nya, tetapi taat dan patuh melaksanakan perintah-Nya. Firman Allah:\n\nSedangkan kamu (orang-orang kafir) memilih kehidupan dunia, padahal kehidupan akhirat itu lebih baik dan lebih kekal. (al-A'la/87: 16-17)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4360,
                    "inSurah": 35
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 426,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَزُخْرُفًا ۚ وَإِن كُلُّ ذَٰلِكَ لَمَّا مَتَاعُ الْحَيَاةِ الدُّنْيَا ۚ وَالْآخِرَةُ عِندَ رَبِّكَ لِلْمُتَّقِينَ",
                    "transliteration": {
                        "en": "Wa zukhrufaa; wa in kullu zaalika lammaa mataa'ul hayaatid dunyaa; wal aakhiratu 'inda Rabbika lilmuttaqeen"
                    }
                },
                "translation": {
                    "en": "And gold ornament. But all that is not but the enjoyment of worldly life. And the Hereafter with your Lord is for the righteous.",
                    "id": "dan (Kami buatkan pula) perhiasan-perhiasan dari emas. Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia, sedangkan kehidupan akhirat di sisi Tuhanmu disediakan bagi orang-orang yang bertakwa."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4360",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4360.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4360.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan semuanya itu tidak lain hanyalah kesenangan kehidupan dunia semata, yang bersifat sementara sedangkan kehidupan akhirat di sisi Tuhanmu disediakan khusus bagi orang-orang yang bertakwa.",
                        "long": "Begitu juga pintu-pintu rumah orang-orang kafir, dan tempat tidur yang mereka tiduri akan dijadikan dari perak. Semua itu adalah perhiasan tempat manusia berbangga-bangga; semua itu hanya merupakan kesenangan kehidupan dunia yang sifatnya sementara, dan hanya dapat bertahan beberapa saat saja lalu hilang lenyap, sedangkan kehidupan akhirat yang penuh dengan kesenangan dan kenikmatan yang beraneka ragam dan tak terhitung banyaknya serta kekal abadi telah dipersiapkan untuk orang yang bertakwa kepada Allah, yang tidak menyekutukan-Nya, yang tidak berbuat maksiat dengan melanggar perintah-Nya, tetapi taat dan patuh melaksanakan perintah-Nya. Firman Allah:\n\nSedangkan kamu (orang-orang kafir) memilih kehidupan dunia, padahal kehidupan akhirat itu lebih baik dan lebih kekal. (al-A'la/87: 16-17)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4361,
                    "inSurah": 36
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 427,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَن يَعْشُ عَن ذِكْرِ الرَّحْمَٰنِ نُقَيِّضْ لَهُ شَيْطَانًا فَهُوَ لَهُ قَرِينٌ",
                    "transliteration": {
                        "en": "Wa mai ya'shu 'an zikrir Rahmaani nuqaiyid lahoo Shaitaanan fahuwa lahoo qareen"
                    }
                },
                "translation": {
                    "en": "And whoever is blinded from remembrance of the Most Merciful - We appoint for him a devil, and he is to him a companion.",
                    "id": "Dan barangsiapa berpaling dari pengajaran Allah Yang Maha Pengasih   (Al-Qur'an), Kami biarkan setan (menyesatkannya) dan menjadi teman karibnya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4361",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4361.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4361.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan barang siapa berpaling dari pengajaran Allah Yang Maha Pengasih, yaitu tidak memperhatikan apa yang terkandung di dalam Al-Qur’an, Kami biarkan setan menyesatkan dan mengendalikannya serta menjadi teman karibnya yang selalu menyertai, mendampingi, dan mendorongnya melakukan kedurhakaan.",
                        "long": "Dalam ayat ini ditegaskan bahwa siapa yang berpaling dari peringatan dan pengajaran Allah, yaitu membutakan hatinya untuk beriman dan mempercayai ajaran-ajaran-Nya yang terdapat dalam Al-Qur'an, maka setan akan selalu menemaninya dan akan selalu berupaya membawanya kepada kesesatan, sehingga Allah akhirnya akan menjadikan setan itu menjadi teman setianya. \n\nMenurut az-Zajjaj, maksud ayat ini adalah bahwa siapa yang berpaling dari Al-Qur'an dan tidak mau mengikuti petunjuk-petunjuk yang terdapat di dalamnya, setan akan terus-menerus menggodanya sampai ia terjerumus ke jalan yang sesat, karena itu ia pasti akan mendapat siksaan Allah. Dalam sebuah hadis Rasulullah saw bersabda:\n\nRasulullah saw bersabda, \"Tidaklah ada salah seorang dari kalian melainkan didampingi oleh pendamping dari golongan jin.\" (Riwayat Muslim)\n\nDi dalam ayat lain Allah berfirman bahwa orang yang selalu mengingkari ayat-ayat Allah, maka hati dan pandangan mereka akan dibolak-balik oleh Allah sehingga mereka tidak jadi beriman dan tetap dalam kesesatan mereka:\n\nDan (begitu pula) Kami memalingkan hati dan penglihatan mereka seperti pertama kali mereka tidak beriman kepadanya (Al-Qur'an), dan Kami biarkan mereka bingung dalam kesesatan. (al-An'am/6: 110)\n\nManusia yang sesat akan berbuat dosa, lalu semakin ia bergelimang dosa, semakin tertutup hatinya sehingga tidak mungkin lagi beriman dan berbuat baik, sebagaimana sabda Rasulullah saw: \n\nRasulullah saw bersabda, \"Sesungguhnya seorang mukmin jika berbuat dosa niscaya ada titik hitam di dalam hatinya, jika ia bertobat dan meninggalkan dan memohon ampun niscaya hatinya kembali bersih. Namun jika dosanya bertambah, niscaya bertambah titik hitam tersebut sehingga meliputi hatinya.\" (Riwayat Ahmad)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4362,
                    "inSurah": 37
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 427,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِنَّهُمْ لَيَصُدُّونَهُمْ عَنِ السَّبِيلِ وَيَحْسَبُونَ أَنَّهُم مُّهْتَدُونَ",
                    "transliteration": {
                        "en": "Wa innahum la yasuddoo nahum 'anis sabeeli wa yahsaboona annahum muhtadoon"
                    }
                },
                "translation": {
                    "en": "And indeed, the devils avert them from the way [of guidance] while they think that they are [rightly] guided",
                    "id": "Dan sungguh, mereka (setan-setan itu) benar-benar menghalang-halangi mereka dari jalan yang benar, sedang mereka menyangka bahwa mereka mendapat petunjuk."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4362",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4362.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4362.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sesungguhnya mereka, yakni setan-setan yang menjadi temannya itu benar-benar menghalang-halangi mereka dari jalan yang benar sehingga mereka tidak mampu melakukan kebaikan, sedang mereka menyangka bahwa mereka mendapat petunjuk dari apa yang ditunjukkan setan itu.",
                        "long": "Dalam ayat ini diterangkan konsekuensi menjadikan setan sebagai teman, yaitu bahwa setan itu akan selalu berupaya menghalangi mereka untuk menemukan jalan yang benar, yaitu mengimani ajaran-ajaran Allah yang terdapat di dalam Al-Qur'an. Mereka akhirnya memang tidak menemukan jalan yang benar itu, tetapi merasa bahwa jalan sesat yang mereka tempuh adalah benar, dan kebenaran ayat-ayat Al-Qur'an yang disampaikan kepada mereka adalah salah. Begitulah hebatnya kekuasaan setan atas diri orang itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4363,
                    "inSurah": 38
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 427,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "حَتَّىٰ إِذَا جَاءَنَا قَالَ يَا لَيْتَ بَيْنِي وَبَيْنَكَ بُعْدَ الْمَشْرِقَيْنِ فَبِئْسَ الْقَرِينُ",
                    "transliteration": {
                        "en": "Hattaaa izaa jaaa'anaa qaala yaa laita bainee wa bainaka bu'dal mashriqaini fabi'sal qareen"
                    }
                },
                "translation": {
                    "en": "Until, when he comes to Us [at Judgement], he says [to his companion], \"Oh, I wish there was between me and you the distance between the east and west - how wretched a companion.\"",
                    "id": "Sehingga apabila orang–orang yang berpaling itu datang kepada Kami (pada hari Kiamat) dia berkata, “Wahai! Sekiranya (jarak) antara aku dan kamu seperti jarak antara timur dan barat! Memang (setan itu) teman yang paling jahat (bagi manusia).”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4363",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4363.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4363.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sehingga apabila dia yang berpaling itu, yakni orang yang tidak mau mengikuti petunjuk Al-Qur’an itu, datang kepada Kami pada hari Kiamat nanti, dia berkata dengan menyesali apa yang pernah dilakukannya di dunia ini, “Wahai! Sekiranya dapat dilakukan, maka jarak antara aku dan kamu seperti jarak antara timur dan barat! Memang, teman yang paling jahat bagi manusia adalah setan yang menjadi qarin itu.”",
                        "long": "Dalam ayat ini diterangkan nasib manusia yang bersahabat dengan setan itu di hari akhirat ketika menghadap Allah. Di saat itulah orang itu baru menyadari bahwa ia telah disesatkan oleh setan-setan itu. Di hadapan Allah ia menyesali mengapa ia terlalu dekat dengan setan-setan itu sewaktu di dunia. Ia menyesal mengapa waktu di dunia dulu mereka dengan setan itu tidak berjauhan sebagaimana jauhnya timur dan barat, yaitu seperti antara satu ujung dengan ujung yang lainnya. Tetapi penyesalan itu tidak berguna, karena dunia sudah digulung dan tidak akan mungkin dikembalikan lagi. \n\nDi akhirat setan-setan yang menjadi teman-teman setia mereka waktu di dunia akan meninggalkan mereka. Di depan Allah setan-setan itu mengingkari persahabatan dan berlepas tangan, sebagaimana diinformasikan dalam Surah Ibrahim/14: 22.\n\nDan setan berkata ketika perkara (hisab) telah diselesaikan, \"Sesungguhnya Allah telah menjanjikan kepadamu janji yang benar, dan aku pun telah menjanjikan kepadamu tetapi aku menyalahinya. Tidak ada kekuasaan bagiku terhadapmu, melainkan (sekedar) aku menyeru kamu lalu kamu mematuhi seruanku, oleh sebab itu janganlah kamu mencerca aku, tetapi cercalah dirimu sendiri. Aku tidak dapat menolongmu, dan kamu pun tidak dapat menolongku. Sesungguhnya aku tidak membenarkan perbuatanmu mempersekutukan aku (dengan Allah) sejak dahulu.\" Sungguh, orang yang zalim akan mendapat siksaan yang pedih. (Ibrahim/14: 22)\n\nDemikianlah, setan-setan jelas merupakan teman yang paling jahat: di dunia mereka merayu, tetapi di akhirat mereka berlepas tangan bahkan menjerumuskan manusia."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4364,
                    "inSurah": 39
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 427,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَن يَنفَعَكُمُ الْيَوْمَ إِذ ظَّلَمْتُمْ أَنَّكُمْ فِي الْعَذَابِ مُشْتَرِكُونَ",
                    "transliteration": {
                        "en": "Wa lai yanfa'akumul Yawma iz zalamtum annakum fil 'azaabi mushtarikoon"
                    }
                },
                "translation": {
                    "en": "And never will it benefit you that Day, when you have wronged, that you are [all] sharing in the punishment.",
                    "id": "Dan (harapanmu itu) sekali-kali tidak akan memberi manfaat kepadamu pada hari itu karena kamu telah menzalimi (dirimu sendiri). Sesungguhnya kamu pantas bersama-sama dalam azab itu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4364",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4364.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4364.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah lalu menafikan apa yang menjadi harapan orang-orang yang enggan mengikuti petunjuk Al-Qur’an dengan mengatakan, “Dan harapanmu itu sekali-kali tidak akan memberi manfaat kepadamu sedikit pun pada hari itu karena kamu pada waktu di dunia dahulu telah menzalimi dirimu sendiri dengan menolak peringatan dari Al-Qur’an dan melakukan perbuatan durhaka. Sesungguhnya kamu dengan qarin-qarinmu itu pantas bersama-sama dalam azab itu, yaitu siksaan api neraka yang amat pedih.",
                        "long": "Selanjutnya Allah menegaskan kepada mereka bahwa bagaimana pun penyesalan mereka dan apa pun alasan mereka tidak akan diterima. Hal itu karena mereka telah berbuat aniaya, yaitu tidak mengimani-Nya dan tidak menjalankan perintah-perintah-Nya. Mereka akhirnya akan dijebloskan ke dalam neraka bersama setan-setan teman-teman mereka itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4365,
                    "inSurah": 40
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 427,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَفَأَنتَ تُسْمِعُ الصُّمَّ أَوْ تَهْدِي الْعُمْيَ وَمَن كَانَ فِي ضَلَالٍ مُّبِينٍ",
                    "transliteration": {
                        "en": "Afa anta tusmi'us summa aw tahdil 'umya wa man kaana fee dalaalim mubeen"
                    }
                },
                "translation": {
                    "en": "Then will you make the deaf hear, [O Muhammad], or guide the blind or he who is in clear error?",
                    "id": "Maka apakah engkau (Muhammad) dapat menjadikan orang yang tuli bisa mendengar, atau (dapatkah) engkau memberi petunjuk kepada orang yang buta (hatinya) dan kepada orang yang tetap dalam kesesatan yang nyata?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4365",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4365.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4365.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka apakah engkau, wahai Nabi Muhammad, dapat menjadikan orang yang tuli, yaitu yang enggan mendengar ajakan kepada kebaikan, bisa mendengar ajakan itu, atau dapatkah engkau memberi petunjuk kepada orang yang buta hatinya untuk berpikir dan memahami petunjuk yang disampaikan kepada mereka dan kepada orang yang tetap dalam kesesatan yang nyata?",
                        "long": "Pada ayat ini Allah bertanya kepada Nabi Muhammad saw yang selalu ingin agar orang-orang kafir itu beriman, apakah ia mampu membuat orang yang tuli mendengar ajakan untuk beriman dan berbuat baik, dan apakah ia mampu membuka hati orang yang telah tertutup mata hatinya. Tentu saja Nabi saw. tidak akan mampu, karena yang mampu melakukannya hanyalah Allah, sedangkan Allah tidak akan mengembalikan mereka yang sesat itu bila mereka sendiri tidak bersedia kembali kepada jalan yang benar. \n\nPertanyaan Allah swt kepada Nabi Muhammad saw itu bukanlah untuk maksud bertanya, tetapi justru untuk menegaskan bahwa telinga dan mata batin mereka sebenarnya sudah tuli dan buta, karena itu kebenaran apa pun yang disampaikan kepada mereka tidak akan mereka terima. Oleh karena itu tugas beliau sebagai seorang rasul hanya menyampaikan. Dalam menyampaikan firman-firman Allah kepada kaum kafir Mekah itu, Nabi saw telah melaksanakannya dengan segenap tenaga dan upaya, namun sebagian mereka menentangnya. Nabi saw dan umatnya diboikot, bahkan diancam akan dibunuh. Untuk menyelamatkan diri Nabi saw memerintahkan pengikut-pengikutnya untuk berhijrah, pertama ke Abessinia, dan kedua ke Medinah. Penentangan dan ancaman itu kadang-kadang membuat hati Nabi saw. kecewa dan hampir-hampir putus asa. Namun dengan turunnya ayat-ayat seperti ayat ini, hati beliau terhibur kembali. Beliau sadar bahwa ia tidak bersalah, tetapi merekalah yang tertutup hatinya. Yang mampu membukanya hanyalah Allah, karena itu beliau tidak lagi berputus asa, tetapi terus berdakwah, dengan harapan pada suatu saat Allah akan menurunkan hidayah-Nya kepada mereka.\n\nDi dalam ayat lain Allah berfirman mengenai pemberian hidayah yang merupakan wewenang Allah itu:\n\nBukanlah kewajibanmu (Muhammad) menjadikan mereka mendapat petunjuk, tetapi Allah-lah yang memberi petunjuk kepada siapa yang Dia kehendaki. (al-Baqarah/2: 272)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4366,
                    "inSurah": 41
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 427,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَإِمَّا نَذْهَبَنَّ بِكَ فَإِنَّا مِنْهُم مُّنتَقِمُونَ",
                    "transliteration": {
                        "en": "Fa immaa nazhabanna bika fa innaa minhum muntaqimoon"
                    }
                },
                "translation": {
                    "en": "And whether [or not] We take you away [in death], indeed, We will take retribution upon them.",
                    "id": "Maka sungguh, sekiranya Kami mewafatkanmu (sebelum engkau mencapai kemenangan), maka sesungguhnya Kami akan tetap memberikan azab kepada mereka (di akhirat),"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4366",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4366.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4366.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka sungguh, sekiranya Kami membawamu pergi dengan mewafatkanmu atau dengan cara yang lain sebelum engkau mencapai kemenangan, maka sesungguhnya Kami akan tetap memberikan azab kepada mereka di akhirat nanti, atau Kami perlihatkan kepadamu azab yang telah Kami ancamkan atau sampaikan kepada mereka. Maka sungguh, Kami Maha berkuasa untuk menurunkan siksaan atas mereka.”",
                        "long": "Di dalam dua ayat ini dijelaskan bahwa Nabi saw tidak perlu terlalu merisaukan penentangan orang-orang musyrikin Mekah. Mereka pasti akan dihukum oleh Allah pada saat yang dikehendaki-Nya. Kemungkinan hukuman itu dalam dua cara. Pertama, Allah akan menghukum mereka setelah Nabi saw meninggal; dengan demikian hukuman itu tidak sempat beliau saksikan sendiri di dunia. Kedua, hukuman terhadap orang-orang yang kafir itu dilaksanakan Allah sekarang juga yaitu pada saat Nabi saw masih hidup. Bukti hukuman seperti itu adalah, menurut sebagian ulama, terbunuhnya banyak pemimpin kaum kafir Mekah pada Perang Badar. Demikianlah ancaman Allah terhadap kaum kafir itu. Pernyataan itu kembali menguatkan hati Nabi saw bahwa mereka yang menentang itu memang betul-betul membutakan mata hatinya karena itu perlu didakwahi lebih intensif lagi."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4367,
                    "inSurah": 42
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 427,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَوْ نُرِيَنَّكَ الَّذِي وَعَدْنَاهُمْ فَإِنَّا عَلَيْهِم مُّقْتَدِرُونَ",
                    "transliteration": {
                        "en": "Aw nuriyannakal lazee wa'adnaahum fa innaa 'alaihim muqtadiroon"
                    }
                },
                "translation": {
                    "en": "Or whether [or not] We show you that which We have promised them, indeed, We are Perfect in Ability.",
                    "id": "atau Kami perlihatkan kepadamu (azab) yang telah Kami ancamkan kepada mereka. Maka sungguh, Kami berkuasa atas mereka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4367",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4367.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4367.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "41-42. Maka sungguh, sekiranya Kami membawamu pergi dengan mewafatkanmu atau dengan cara yang lain sebelum engkau mencapai kemenangan, maka sesungguhnya Kami akan tetap memberikan azab kepada mereka di akhirat nanti, atau Kami perlihatkan kepadamu azab yang telah Kami ancamkan atau sampaikan kepada mereka. Maka sungguh, Kami Maha berkuasa untuk menurunkan siksaan atas mereka.”43.\tWahai Muhammad, berpegang teguhlah engkau kepada apa yang telah di wahyukan Allah kepadamu. Dengan demikian, sungguh engkau berada di jalan yang lurus.",
                        "long": "Di dalam dua ayat ini dijelaskan bahwa Nabi saw tidak perlu terlalu merisaukan penentangan orang-orang musyrikin Mekah. Mereka pasti akan dihukum oleh Allah pada saat yang dikehendaki-Nya. Kemungkinan hukuman itu dalam dua cara. Pertama, Allah akan menghukum mereka setelah Nabi saw meninggal; dengan demikian hukuman itu tidak sempat beliau saksikan sendiri di dunia. Kedua, hukuman terhadap orang-orang yang kafir itu dilaksanakan Allah sekarang juga yaitu pada saat Nabi saw masih hidup. Bukti hukuman seperti itu adalah, menurut sebagian ulama, terbunuhnya banyak pemimpin kaum kafir Mekah pada Perang Badar. Demikianlah ancaman Allah terhadap kaum kafir itu. Pernyataan itu kembali menguatkan hati Nabi saw bahwa mereka yang menentang itu memang betul-betul membutakan mata hatinya karena itu perlu didakwahi lebih intensif lagi."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4368,
                    "inSurah": 43
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 427,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَاسْتَمْسِكْ بِالَّذِي أُوحِيَ إِلَيْكَ ۖ إِنَّكَ عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ",
                    "transliteration": {
                        "en": "Fastamsik billazeee oohi ya ilaika innaka 'alaa Siraatim Mustaqeem"
                    }
                },
                "translation": {
                    "en": "So adhere to that which is revealed to you. Indeed, you are on a straight path.",
                    "id": "Maka berpegang teguhlah engkau kepada (agama) yang telah diwahyukan kepadamu. Sungguh, engkau berada di jalan yang lurus."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4368",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4368.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4368.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Wahai Muhammad, berpegang teguhlah engkau kepada apa yang telah di wahyukan Allah kepadamu. Dengan demikian, sungguh engkau berada di jalan yang lurus.",
                        "long": "Pada ayat ini Nabi saw diminta Allah untuk berpegang teguh pada Al-Qur'an, yaitu lebih meningkatkan iman kepadanya dan lebih giat menyampaikan ajaran-ajaran Allah di dalamnya. Hal itu karena ajaran-ajaran yang terdapat di dalam Kitab itu mutlak benar dan menjamin kebahagiaan hidup manusia di dunia dan akhirat. Sedangkan bagi mereka yang tetap membangkang tentu Allah akan menentukan hukuman buat mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4369,
                    "inSurah": 44
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 427,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِنَّهُ لَذِكْرٌ لَّكَ وَلِقَوْمِكَ ۖ وَسَوْفَ تُسْأَلُونَ",
                    "transliteration": {
                        "en": "Wa innahoo lazikrul laka wa liqawmika wa sawfa tus'aloon"
                    }
                },
                "translation": {
                    "en": "And indeed, it is a remembrance for you and your people, and you [all] are going to be questioned.",
                    "id": "Dan sungguh, Al-Qur'an itu benar-benar suatu peringatan bagimu dan bagi kaummu, dan kelak kamu akan diminta pertanggungjawaban."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4369",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4369.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4369.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ketahuilah wahai Nabi Muhammad, bahwa sesungguhnya Al-Qur’an yang diturunkan kepadamu itu benar-benar suatu peringatan dan pengajaran yang sangat baik bagimu dan bagi kaummu dan semua yang mengikuti tuntunanmu, dan kelak kamu sekalian akan dimintai pertanggungjawaban.",
                        "long": "Allah menegaskan bahwa turunnya Al-Qur'an itu sesungguhnya adalah kemuliaan bagi Nabi saw dan kaumnya, yaitu suku Quraisy pada khususnya dan bangsa Arab pada umumnya. Hal itu karena Al-Qur'an itu diturunkan dalam bahasa mereka. Dengan begitu bangsa Arab, khususnya suku Quraisy, tentu yang paling paham maknanya, karena itu seharusnya mereka menjadi yang pertama dalam mengimaninya dan melaksanakan ajaran-ajaran yang terdapat di dalamnya. Dalam ayat lain Allah menyatakan Al-Qur'an sebagai kehormatan yang telah diberikan kepada mereka:\n\nSungguh, telah Kami turunkan kepadamu sebuah Kitab (Al-Qur'an) yang di dalamnya terdapat peringatan bagimu. Maka apakah kamu tidak mengerti? (al-Anbiya'/21: 10)\n\nSelanjutnya, orang-orang musyrikin Mekah seharusnya menjadi pelopor dalam menyebarkan ajaran-ajaran yang terdapat dalam Al-Qur'an. Untuk itu semua mereka akan diminta pertanggungjawabannya. Bila mereka tidak mengimaninya, tidak menjalankannya, dan tidak menyebarluaskannya, maka kedudukan mereka akan digantikan oleh kaum-kaum lain, sebagaimana difirmankan Allah:\n\nIngatlah, kamu adalah orang-orang yang diajak untuk menginfakkan (hartamu) di jalan Allah. Lalu di antara kamu ada orang yang kikir, dan barangsiapa kikir maka sesungguhnya dia kikir terhadap dirinya sendiri. Dan Allah-lah Yang Mahakaya dan kamulah yang membutuhkan (karunia-Nya). Dan jika kamu berpaling (dari jalan yang benar) Dia akan menggantikan (kamu) dengan kaum yang lain, dan mereka tidak akan (durhaka) seperti kamu (ini). (Muhammad/47: 38)\n\nKarena Al-Qur'an diturunkan dalam bahasa Arab, kaum muslimin yang bukan bangsa Arab dan tidak berbahasa Arab berarti perlu belajar bahasa Arab supaya dapat memahami ajaran-ajaran yang terdapat di dalam Al-Qur'an itu dengan baik. Di antara mereka perlu ada yang mendalami ajaran-ajaran yang terdapat di dalamnya, melaksanakannya, dan mendakwahkannya. Bila mereka melakukan yang demikian itu, maka kedudukan mereka setingkat dengan suku Quraisy yang dianugerahi kemulian sebagai umat pertama yang menerima Islam dan menyebarluaskannya kepada bangsa-bangsa lain. Mereka adalah para ulama. Dengan demikian di pundak para ulama terletak tanggung jawab besar dan mereka juga akan diminta pertanggungjawaban nanti di akhirat oleh Allah swt."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4370,
                    "inSurah": 45
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 427,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَاسْأَلْ مَنْ أَرْسَلْنَا مِن قَبْلِكَ مِن رُّسُلِنَا أَجَعَلْنَا مِن دُونِ الرَّحْمَٰنِ آلِهَةً يُعْبَدُونَ",
                    "transliteration": {
                        "en": "Was'al man arsalnaa min qablika mir Rusulinaaa aja'alnaa min doonir Rahmaani aalihatany yu badoon"
                    }
                },
                "translation": {
                    "en": "And ask those We sent before you of Our messengers; have We made besides the Most Merciful deities to be worshipped?",
                    "id": "Dan tanyakanlah (Muhammad) kepada rasul-rasul Kami yang telah Kami utus sebelum engkau, “Apakah Kami menentukan tuhan-tuhan selain (Allah) Yang Maha Pengasih untuk disembah?”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4370",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4370.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4370.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan tanyakanlah, wahai Muhammad, kepada rasul-rasul Kami yang telah Kami utus kepada umat-umat sebelum engkau, \"Apakah Kami menentukan tuhan-tuhan selain Allah Yang Maha Pengasih untuk disembah?\" Tentu tidak. Kami hanya menentukan satu Tuhan yang disembah, yaitu Allah Yang Maha Esa.",
                        "long": "Ayat ini mengandung celaan terhadap kaum kafir Mekah yang masih belum mau beriman dan masih tetap menyembah berhala-berhala. Celaan itu ditujukan kepada mereka karena Al-Qur'an turun dalam bahasa mereka, dimana merekalah seharusnya yang lebih memahaminya dan mengimaninya terlebih dahulu.\n\nUntuk itulah Allah meminta Nabi Muhammad bertanya kepada rasul-rasul terdahulu, pernahkah Allah menjadikan sembahan selain-Nya. Perintah agar Nabi saw bertanya kepada nabi-nabi terdahulu itu, menurut pendapat sebagian ulama, terjadi pada waktu Nabi saw melakukan Isra' Mi'raj. Ada pula yang berpendapat bahwa pertanyaan kepada rasul-rasul itu dilakukan dengan memeriksa isi kitab-kitab suci terdahulu, yaitu Taurat dan Injil. Para nabi itu pasti akan menjawab bahwa mereka tidak pernah menyaksikan adanya Tuhan selain Allah. Dengan demikian perintah Allah kepada Nabi Muhammad untuk bertanya kepada nabi-nabi terdahulu itu bukanlah bertanya karena tidak tahu, tetapi bertanya untuk menunjukkan bahwa kaum Quraisy yang menyembah berhala-berhala itu keliru karena hal itu tidak pernah diajarkan dalam agama-agama terdahulu. Oleh sebab itu mereka seharusnya beriman."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4371,
                    "inSurah": 46
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَقَدْ أَرْسَلْنَا مُوسَىٰ بِآيَاتِنَا إِلَىٰ فِرْعَوْنَ وَمَلَئِهِ فَقَالَ إِنِّي رَسُولُ رَبِّ الْعَالَمِينَ",
                    "transliteration": {
                        "en": "Wa laqad arsalnaa Moosaa bi aayaatinaaa ilaa Fir'awna wa mala'ihee faqaala innee Rasoolu Rabbil 'aalameen"
                    }
                },
                "translation": {
                    "en": "And certainly did We send Moses with Our signs to Pharaoh and his establishment, and he said, \"Indeed, I am the messenger of the Lord of the worlds.\"",
                    "id": "Dan sungguh, Kami telah mengutus Musa dengan membawa mukjizat-mukjizat Kami kepada Fir’aun dan pemuka-pemuka kaumnya. Maka dia (Musa) berkata, “Sesungguhnya aku adalah utusan dari Tuhan seluruh alam.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4371",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4371.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4371.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat yang lalu berbicara tentang rasul-rasul Allah yang telah diutus sebelum Nabi Muhammad. Ayat ini berbicara tentang Nabi Musa, salah satu dari rasul-rasul itu. Dan sungguh, Kami telah mengutus Musa dengan membawa mukjizat-mukjizat, yakni bukti-bukti kenabian dan kerasulannya serta bukti-bukti kekuasaan Kami, kepada Fir’aun, yang mengaku dirinya sebagai Tuhan, dan pemuka-pemuka kaumnya yang mendukung dan mempertahankan pengakuannya itu. Maka dia, yakni Nabi Musa, berkata, “Sesungguhnya aku adalah utusan dari Tuhan yang telah menciptakan kalian, dan memiliki seluruh alam.”",
                        "long": "Dalam ayat ini diterangkan bahwa Allah telah mengutus Nabi Musa kepada Fir'aun dan rakyatnya untuk menyampaikan ajaran-ajaran Allah. Nabi Musa diutus kepada Fir'aun dengan dilengkapi beberapa mukjizat, misalnya tongkat menjadi ular, tangan yang bercahaya, dan sebagainya. Inti seruan Nabi Musa kepada Fir'aun adalah agar Fir'aun mengakui Allah sebagai Tuhan yang menciptakan dan memelihara seluruh alam ini, dan mengakuinya sebagai utusan-Nya.\n\nPenegasan berkenaan dengan Nabi Musa itu mengandung pula penegasan mengenai Nabi Muhammad saw. Kaum kafir Mekah hendaknya juga mengimani Allah swt sebagai Tuhan Yang Maha Esa, mengimani Muhammad saw sebagai Rasul-Nya dan mengimani mukjizatnya yang utama yaitu Al-Qur'an. Selanjutnya penegasan itu mengandung arti bahwa agama yang diserukan Nabi Muhammad sama dengan yang diserukan Nabi Musa dan seluruh nabi, yaitu Islam. Allah berfirman: \n\nSesungguhnya agama di sisi Allah ialah Islam. (Ali 'Imran/3:19)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4372,
                    "inSurah": 47
                },
                "meta": {
                    "juz": 25,
                    "page": 492,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَلَمَّا جَاءَهُم بِآيَاتِنَا إِذَا هُم مِّنْهَا يَضْحَكُونَ",
                    "transliteration": {
                        "en": "Falammma jaaa'ahum bi aayaatinaaa izaa hum minhaa yadhakoon"
                    }
                },
                "translation": {
                    "en": "But when he brought them Our signs, at once they laughed at them.",
                    "id": "Maka ketika dia (Musa) datang kepada mereka membawa mukjizat-mukjizat Kami, seketika itu mereka menertawakannya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4372",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4372.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4372.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka ketika dia, yakni Nabi Musa, datang kepada mereka membawa mukjizat-mukjizat Kami itu untuk memperkuat ke rasulannya, seperti tongkatnya yang berubah menjadi ular, seketika itu mereka mengejek dan menertawakannya.",
                        "long": "Ayat ini menerangkan sikap Fir'aun dan kaumnya terhadap seruan Nabi Musa. Mereka meminta Nabi Musa menyampaikan bukti-bukti kerasulannya, lalu Nabi Musa menyampaikan mukjizat-mukjizatnya, di antaranya tongkat menjadi ular, tangan bercahaya, dan lain-lain. Tetapi mereka menertawakannya dan mengejeknya. Nabi Muhammad pun diperlakukan demikian oleh kaum kafir Mekah. Mereka menuduhnya pesihir dan pembohong (shad/38: 4), dan menuduh Al-Qur'an itu mimpi, rekayasa, atau syair gubahan Nabi Muhammad saw. (al-Anbiya'/21: 5).\n\nApa yang disampaikan dalam ayat ini meringankan tekanan batin yang diderita Nabi saw akibat penentangan yang keras dari kaum kafir Mekah. Dari isi ayat itu Nabi saw memperoleh pelajaran bahwa sudah menjadi kebiasaan seorang nabi ditentang oleh kaumnya, karena itu yang ditentang bukan hanya dia, tetapi seluruh nabi. Ia harus sabar dan tabah menghadapi segala tantangan, sebagaimana Nabi Musa sabar dan tabah menghadapi Fir'aun dan balatentaranya, sehingga ia memperoleh kemenangan. Begitu pula Nabi Muhammad saw, bila sabar dan tabah, maka ia juga akan memperoleh kemenangan atas kaum kafir Mekah di dunia ini juga, yang kemudian dibuktikan dengan hancurnya pasukan kafir Mekah pada Perang Badar."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4373,
                    "inSurah": 48
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا نُرِيهِم مِّنْ آيَةٍ إِلَّا هِيَ أَكْبَرُ مِنْ أُخْتِهَا ۖ وَأَخَذْنَاهُم بِالْعَذَابِ لَعَلَّهُمْ يَرْجِعُونَ",
                    "transliteration": {
                        "en": "Wa maa nureehim min aayatin illaa hiya akbaru min ukhtihaa wa akhaznaahum bil'azaabi la'allahum yarji'oon"
                    }
                },
                "translation": {
                    "en": "And We showed them not a sign except that it was greater than its sister, and We seized them with affliction that perhaps they might return [to faith].",
                    "id": "Dan tidaklah Kami perlihatkan suatu mukjizat kepada mereka kecuali (mukjizat itu) lebih besar dari mukjizat-mukjizat (yang sebelumnya). Dan Kami timpakan kepada mereka azab agar mereka kembali (ke jalan yang benar)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4373",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4373.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4373.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan tidaklah Kami perlihatkan suatu ayat, yaitu tanda kekuasaan Kami, berupa mukjizat kepada mereka kecuali ia lebih besar dari mukjizat-mukjizat yang sebelumnya. Namun demikian, mereka tetap bersikeras dengan sikap dan keyakinan mereka yang enggan menerima kebenaran. Dan akibat dari perbuatan mereka itu Kami timpakan kepada mereka azab duniawi sebagai cobaan dari Kami seperti kekurangan makanan, berjangkitnya hama tumbuh-tumbuhan agar mereka kembali ke jalan yang benar.",
                        "long": "Dalam ayat ini dijelaskan bahwa mukjizat adalah sesuatu peristiwa atau sesuatu yang besar dan luar biasa yang diberikan kepada seorang nabi sebagai bukti kenabiannya. Namun mukjizat yang diberikan kepada seorang nabi lebih hebat dari mukjizat yang diberikan kepada nabi sebelumnya. Begitu pula mukjizat yang diberikan kepada Nabi Musa. Dalam Surah al-Isra'/17: 101 dinyatakan bahwa Nabi Musa diberi sembilan macam mukjizat, yaitu tongkat menjadi ular, tangan bercahaya, kemarau panjang, laut terbelah, topan yang dahsyat, belalang yang memusnahkan tanaman, kutu yang menimbulkan penyakit, kodok yang menjadi hama, dan air minum yang berubah menjadi darah yang Allah turunkan kepada Fir'aun dan kaumnya dalam bentuk bencana untuk menyadarkan mereka, sebagaimana firman Allah:\n\nMaka Kami kirimkan kepada mereka topan, belalang, kutu, katak dan darah (air minum berubah menjadi darah) sebagai bukti-bukti yang jelas, tetapi mereka tetap menyombongkan diri dan mereka adalah kaum yang berdosa. (al-A'raf/7: 133)\n\nDengan ditimpakannya bencana-bencana itu kepada Fir'aun dan pengikut-pengikutnya diharapkan mereka akan kembali, yaitu beriman. Tetapi tidak demikian, mereka tetap membangkang.\n\nBegitu pula dengan Nabi Muhammad saw, beliau telah menyampaikan kepada kafir Mekah mukjizatnya yang terbesar, yaitu Al-Qur'an. Tetapi mereka tetap menolaknya dan menyatakan bahwa Al-Qur'an itu adalah mimpi, rekayasa, atau syair gubahan Nabi Muhammad saw."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4374,
                    "inSurah": 49
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالُوا يَا أَيُّهَ السَّاحِرُ ادْعُ لَنَا رَبَّكَ بِمَا عَهِدَ عِندَكَ إِنَّنَا لَمُهْتَدُونَ",
                    "transliteration": {
                        "en": "Wa qaaloo yaaa ayyuhas saahirud'u lanaa Rabbaka bimaa 'ahida 'indaka innanaa lamuhtadoon"
                    }
                },
                "translation": {
                    "en": "And they said [to Moses], \"O magician, invoke for us your Lord by what He has promised you. Indeed, we will be guided.\"",
                    "id": "Dan mereka berkata, “Wahai pesihir! Berdoalah kepada Tuhanmu untuk (melepaskan) kami sesuai dengan apa yang telah dijanjikan-Nya kepadamu; sesungguhnya kami (jika doamu dikabulkan) akan menjadi orang yang mendapat petunjuk.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4374",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4374.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4374.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan setiap ada bencana yang ditimpakan kepada Fir’aun dan kaumnya, mereka berkata, “Wahai pesihir, maksudnya Nabi Musa, berdoalah kepada Tuhanmu untuk mengangkat bencana itu dan melepaskan kami dari bencana yang menimpa kami sesuai dengan apa yang telah dijanjikan-Nya kepadamu; sesungguhnya jika doamu dikabulkan, hai Musa, kami akan menjadi orang yang mendapat petunjuk.”",
                        "long": "Fir'aun dan pengikut-pengikutnya merasakan bencana-bencana yang ditimpakan kepada mereka sangat dahsyat, lalu mereka memohon kepada Nabi Musa agar berdoa kepada Allah supaya melepaskan mereka dari azab itu. \"Wahai tukang sihir!\" kata mereka, \"Berdoalah kepada Tuhanmu sesuai dengan apa yang Ia janjikan kepadamu! Kami pasti menerima apa yang kau sampaikan.\" Memanggil Nabi Musa tukang sihir sudah menunjukkan bahwa mereka menghina beliau dan tidak mempercayainya. Tetapi Nabi Musa tetap mengabulkan permintaan mereka, karena Allah memang telah menjanjikan kepadanya bahwa bila mereka beriman, azab itu akan dihentikan. Nabi Musa pun berdoa setelah mereka berjanji akan beriman, lalu Allah pun menghentikan azab tersebut."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4375,
                    "inSurah": 50
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَلَمَّا كَشَفْنَا عَنْهُمُ الْعَذَابَ إِذَا هُمْ يَنكُثُونَ",
                    "transliteration": {
                        "en": "Falammaa kashafnaa 'anhumul 'azaaba izaa hum yankusoon"
                    }
                },
                "translation": {
                    "en": "But when We removed from them the affliction, at once they broke their word.",
                    "id": "Maka ketika Kami hilangkan azab itu dari mereka, seketika itu (juga) mereka ingkar janji."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4375",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4375.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4375.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka dengan begitu cepat ketika Kami hilangkan dan hindarkan azab itu dari mereka karena doa yang dimohonkan oleh Nabi Musa itu, seketika itu juga dari waktu ke waktu dan secara terus-menerus mereka ingkar janji.",
                        "long": "Setelah azab dihentikan, ternyata mereka memungkiri janji mereka. Mereka tetap membangkang, Di dalam ayat lain peristiwa itu diterangkan pula:\n\nDan ketika mereka ditimpa azab (yang telah diterangkan itu) mereka pun berkata, \"Wahai Musa! Mohonkanlah untuk kami kepada Tuhanmu sesuai dengan janji-Nya kepadamu. Jika engkau dapat menghilangkan azab itu dari kami, niscaya kami akan beriman kepadamu dan pasti akan kami biarkan Bani Israil pergi bersamamu.\" Tetapi setelah Kami hilangkan azab itu dari mereka hingga batas waktu yang harus mereka penuhi ternyata mereka ingkar janji. (Surah al-A'raf/7: 134-135)\n\nDi dalam ayat itu diterangkan bahwa mereka berjanji bahwa bila mereka dilepaskan dari bencana-bencana itu, mereka akan beriman dan akan membebaskan Bani Israil dari siksaan dan perbudakan yang mereka perlakukan terhadap mereka. Tetapi semuanya itu hanyalah janji. Mereka tidak menepati janji itu, bahkan ingin mencelakakan Nabi Musa dan kaumnya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4376,
                    "inSurah": 51
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَنَادَىٰ فِرْعَوْنُ فِي قَوْمِهِ قَالَ يَا قَوْمِ أَلَيْسَ لِي مُلْكُ مِصْرَ وَهَٰذِهِ الْأَنْهَارُ تَجْرِي مِن تَحْتِي ۖ أَفَلَا تُبْصِرُونَ",
                    "transliteration": {
                        "en": "Wa naadaa Fir'awnu fee qawmihee qaala yaa qawmi alaisa lee mulku Misra wa haazihil anhaaru tajree min tahtee afalaa tubsiroon"
                    }
                },
                "translation": {
                    "en": "And Pharaoh called out among his people; he said, \"O my people, does not the kingdom of Egypt belong to me, and these rivers flowing beneath me; then do you not see?",
                    "id": "Dan Fir‘aun berseru kepada kaumnya (seraya) berkata, “Wahai kaumku! Bukankah kerajaan Mesir itu milikku dan (bukankah) sungai-sungai ini mengalir di bawahku; apakah kamu tidak melihat?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4376",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4376.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4376.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan Fir‘aun dengan penuh kesombongan dan keangkuhan berseru kepada kaumnya seraya berkata, “Wahai kaumku! Bukankah kerajaan Mesir itu milikku sendiri, bukan milik orang lain, dan bukankah sungai-sungai ini yang mengalir di bawah istana-ku juga menjadi milikku dan ke kayaanku; apakah kamu tidak melihat betapa hebatnya aku dan betapa besar ke kuasaanku dan betapa lemahnya Musa?",
                        "long": "Fir'aun semakin menunjukkan kesombongannya dan kesewenang-wenangannya. Ia bertanya kepada kaumnya, bertanya untuk menegaskan, bukankah kerajaan Mesir yang besar itu milik dia bukan milik orang lain. Bukankah sungai-sungai sebagai sumber kehidupan di negeri itu mengalir di bawah istananya dan di dalam kebun-kebunnya. Pertanyaan itu untuk menunjukan kesombongannya. Dengan ucapan itu ia hendak menyatakan bahwa dialah penguasa besar dan satu-satunya di negeri itu, yang tidak mungkin dilawan dan dikalahkan. Oleh karena itu ia tidak akan beriman dan dan tidak akan tunduk kepada Nabi Musa. Ucapannya itu sekaligus mengandung ancaman kepada siapa saja yang mengikuti Nabi Musa bahwa mereka akan memperoleh nasib yang tidak menguntungkan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4377,
                    "inSurah": 52
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمْ أَنَا خَيْرٌ مِّنْ هَٰذَا الَّذِي هُوَ مَهِينٌ وَلَا يَكَادُ يُبِينُ",
                    "transliteration": {
                        "en": "Am ana khairum min haazal lazee huwa maheenunw wa laa yuakaadu yubeen"
                    }
                },
                "translation": {
                    "en": "Or am I [not] better than this one who is insignificant and hardly makes himself clear?",
                    "id": "Bukankah aku lebih baik dari orang (Musa) yang hina ini dan yang hampir tidak dapat menjelaskan (perkataannya)?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4377",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4377.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4377.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Bukankah dengan kehebatan, kekayaan, dan kekuasaanku itu aku lebih baik dan lebih tinggi kedudukannya dari orang yang hina ini, yaitu Musa, yang tidak memiliki kekuasaan apa pun dan dia juga adalah orang yang hampir tidak dapat menjelaskan perkataannya dengan kalimat-kalimat yang baik? Tentulah aku lebih baik daripada Musa.",
                        "long": "Fir'aun semakin menunjukkan kecongkakannya. Ia menghina Nabi Musa. Ia bertanya kepada kaumnya, sekali lagi untuk menegaskan, bukankah yang terbaik adalah dia, sedangkan Nabi Musa adalah seorang yang hina karena ia tidak memiliki apa-apa, seperti kekuasaan, jabatan, dan kekayaan seperti yang ia miliki. Dan bukankah Nabi Musa itu begitu hinanya mengingat untuk menjelaskan sesuatu dengan kata-kata saja ia tidak mampu. Yang dimaksudkannya adalah ketidakmampuan Nabi Musa berbicara secara jelas karena lidahnya kelu sebagaimana diakuinya dalam doanya kepada Allah agar memperkuatnya dengan mengutus saudaranya, Nabi Harun. Allah berfirman:\n\nDan saudaraku Harun, dia lebih fasih lidahnya daripada aku, maka utuslah dia bersamaku sebagai pembantuku untuk membenarkan (perkataan)ku; sungguh, aku takut mereka akan mendustakanku. (al-Qasas/28: 34)\n\nTujuan Fir'aun bertanya kepada kaumnya dengan menyampaikan kekurangan-kekurangan Nabi Musa bukanlah untuk bertanya tetapi untuk tujuan menghina beliau. Ia berharap dengan mengemukakan kekurangan Nabi Musa, rakyatnya memiliki pandangan yang tidak baik kepadanya dan tidak mempercayainya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4378,
                    "inSurah": 53
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَلَوْلَا أُلْقِيَ عَلَيْهِ أَسْوِرَةٌ مِّن ذَهَبٍ أَوْ جَاءَ مَعَهُ الْمَلَائِكَةُ مُقْتَرِنِينَ",
                    "transliteration": {
                        "en": "Falaw laa ulqiya 'alaihi aswiratum min zahabin awjaaa'a ma'ahul malaaa'ikatu muqtarineen"
                    }
                },
                "translation": {
                    "en": "Then why have there not been placed upon him bracelets of gold or come with him the angels in conjunction?\"",
                    "id": "Maka mengapa dia (Musa) tidak dipakaikan gelang dari emas atau malaikat datang bersama-sama dia untuk mengiringkannya?”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4378",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4378.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4378.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka kalau memang Musa merupakan utusan Tuhan yang dikirim kepada kami, mengapa dia, yakni Musa, tidak dipakaikan oleh Tuhannya gelang dari emas sebagai identitasnya atau para malaikat datang bersama-sama dia untuk mengiringinya sebagai bentuk dukungan terhadap pengutusannya?”",
                        "long": "Fir'aun memberikan alasan mengapa Nabi Musa tidak pantas memperoleh kemuliaan dan tidak layak diimani sebagai rasul, karena ia tidak memiliki gelang-gelang emas sebagai tanda ia kaya, dan tidak didampingi malaikat-malaikat sebagai tanda ia seorang rasul. Dengan demikian Fir'aun membuat tolok ukur kemuliaan itu adalah dengan kekayaan, dan tolok ukur kebenaran pada hal-hal yang kasat mata. Allah tidak meletakkan tolok ukur kemuliaan itu pada materi tetapi pada ketakwaan, sebagaimana firman Allah:\n\nWahai manusia! Sungguh, Kami telah menciptakan kamu dari seorang laki-laki dan seorang perempuan, kemudian Kami jadikan kamu berbangsa-bangsa dan bersuku-suku agar kamu saling mengenal. Sungguh yang paling mulia di antara kamu di sisi Allah ialah orang yang paling bertakwa. Sungguh, Allah Maha Mengetahui, Mahateliti. (al-hujurat/49: 13) \n\nAllah tidak meletakkan tolok ukur kebenaran sebagai seorang rasul itu pada sesuatu yang dapat diindera, namun pada kebenaran jalan yang ditempuhnya, yaitu pada kebenaran wahyu yang diperolehnya dari Allah. Allah berfirman:\n\nKatakanlah (Muhammad), \"Sesungguhnya aku ini hanya seorang manusia seperti kamu, yang telah menerima wahyu, bahwa sesungguhnya Tuhan kamu adalah Tuhan Yang Maha Esa.\" Maka barang siapa mengharap pertemuan dengan Tuhannya maka hendaklah dia mengerjakan kebajikan dan janganlah dia mempersekutukan dengan sesuatu pun dalam beribadah kepada Tuhannya.\" (al-Kahf/18: 110) \n\nPerlakuan yang tidak layak juga dialami Nabi Muhammad saw bahkan lebih hebat lagi. Kaumnya tidak mempercayainya sebagai seorang rasul karena ia tidak memiliki apa-apa. Mereka memintanya, di samping menjadi orang kaya, juga dapat menciptakan peristiwa-peristiwa yang luar biasa sampai-sampai mereka ingin melihat Allah dan malaikat secara kasat mata. Permintaan itu tentu tidak mungkin ia penuhi karena sudah di luar kuasanya dan mustahil dipenuhi. Beliau hanya menjawab, \"Mahasuci Tuhanku, dan saya hanya seorang manusia yang menjadi rasul.\" \n\nKatakanlah (Muhammad), \"Mahasuci Tuhanku, bukankah aku ini hanya seorang manusia yang menjadi rasul?\" (al-Isra'/17: 93)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4379,
                    "inSurah": 54
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَاسْتَخَفَّ قَوْمَهُ فَأَطَاعُوهُ ۚ إِنَّهُمْ كَانُوا قَوْمًا فَاسِقِينَ",
                    "transliteration": {
                        "en": "Fastakhaffa qawmahoo fa ataa'ooh; innahum kaanoo qawman faasiqeen"
                    }
                },
                "translation": {
                    "en": "So he bluffed his people, and they obeyed him. Indeed, they were [themselves] a people defiantly disobedient [of Allah].",
                    "id": "Maka (Fir‘aun) dengan perkataan itu telah mempengaruhi kaumnya, sehingga mereka patuh kepadanya. Sungguh, mereka adalah kaum yang fasik."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4379",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4379.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4379.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka dia, yakni Fir‘aun, dengan perkataannya itu telah mempengaruhi kaumnya, sehingga mereka patuh kepadanya dan mengakui kekuasaan dan ketuhanannya. Sungguh, mereka adalah kaum yang fasik, yang secara terus-menerus menolak kerasulan Nabi Musa dan menyimpang dari ajaran agama.",
                        "long": "Upaya Fir'aun mempengaruhi dan mengelabui rakyatnya berhasil. Rakyat Mesir patuh kepadanya dan tidak mau beriman kepada Nabi Musa bahkan membencinya. Mereka digolongkan oleh Allah sebagai orang-orang fasik, yaitu orang-orang yang benar-benar telah melanggar ajaran-ajaran agama dan keluar dari kebenaran."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4380,
                    "inSurah": 55
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَلَمَّا آسَفُونَا انتَقَمْنَا مِنْهُمْ فَأَغْرَقْنَاهُمْ أَجْمَعِينَ",
                    "transliteration": {
                        "en": "Falammaaa aasafoonan taqamnaa minhum fa aghraqnaahum ajma'een"
                    }
                },
                "translation": {
                    "en": "And when they angered Us, We took retribution from them and drowned them all.",
                    "id": "Maka ketika mereka membuat Kami murka, Kami hukum mereka, lalu Kami tenggelamkan mereka semuanya (di laut),"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4380",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4380.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4380.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka ketika mereka, yaitu Fir’aun dan kaumnya, membuat Kami murka karena pernyataan dan sikap mereka yang menentang Nabi Musa sebagai utusan Kami, Kami membalas sikap mereka itu dengan menghukum mereka, lalu Kami tenggelamkan mereka semuanya di Laut Merah,",
                        "long": "Kefasikan Fir'aun dan kaumnya semakin menjadi-jadi. Mereka semakin lupa daratan bahkan memandang Fir'aun adalah tuhan. Tindakan itu sudah sampai ke puncaknya, yang tidak mungkin lagi dimaafkan oleh Allah dan sangat disesalkan. Allah pun menjatuhkan hukuman-Nya, ketika Fir'aun dan balatentaranya mengejar Nabi Musa dan kaumnya sampai ke Laut Merah, Allah menenggelamkannya di laut itu. Dengan demikian ia tewas karena kesombongannya memiliki kekayaan dan kekuasaan, dan kebenaran pun terungkap walaupun diusung hanya oleh seorang manusia biasa yang tidak punya kekuasaan apa-apa. \n\nPenundaan hukuman terhadap orang yang jahat itu disebut istidraj, yaitu pelaku perbuatan dosa dibiarkan melakukan kejahatan sehingga dosanya meningkat terus sampai ke puncaknya, bila pelakunya tidak mempan lagi dinasehati. Bila dosa-dosa itu sudah sampai di puncaknya, maka Allah tidak mungkin memaafkannya lagi, lalu Ia akan menjatuhkan hukuman-Nya. Nabi bersabda dalam sebuah riwayat Ahmad, at-Tirmidhi, ath-thabrani dan al-Baihaqi:\n\n'Uqbah bin 'Amir meriwayatkan bahwa Nabi saw bersabda, \"Apabila engkau melihat Allah memberikan kepada seorang hamba kenikmatan duniawi yang ia inginkan dari dunia sedangkan ia selalu bermaksiatm maka sesungguhnya hal tersebut merupakan istidraj.\" Kemudian Nabi saw membaca ayat, \"Maka ketika mereka melupakan peringatan yang telah diberikan kepada mereka, Kami pun membukakan semua pintu (kesenangan) untuk mereka. Sehingga ketika mereka bergembira dengan apa yang telah diberikan kepada mereka, Kami siksa mereka secara tiba-tiba, maka ketika itu mereka terdiam putus asa.\" (Riwayat Ahmad, at-Tirmidhi, ath-thabrani dan al-Baihaqi)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4381,
                    "inSurah": 56
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 428,
                    "hizbQuarter": 197,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَجَعَلْنَاهُمْ سَلَفًا وَمَثَلًا لِّلْآخِرِينَ",
                    "transliteration": {
                        "en": "Faja'alnaahum salafanw wa masalal lil aakhireen"
                    }
                },
                "translation": {
                    "en": "And We made them a precedent and an example for the later peoples.",
                    "id": "maka Kami jadikan mereka sebagai (kaum) terdahulu dan pelajaran bagi orang-orang yang kemudian."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4381",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4381.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4381.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Lalu Kami jadikan mereka yang menentang terhadap ajaran-ajaran Allah yang dibawa oleh Nabi Musa dan hukuman yang ditimpakan kepada mereka itu sebagai kaum terdahulu dan pelajaran bagi orang-orang yang datang kemudian.",
                        "long": "Kasus Fir'aun itu merupakan contoh yang patut dijadikan pelajaran oleh generasi-generasi berikutnya sampai hari Kiamat. Pelajarannya adalah agar siapa pun tidak meniru tingkah laku Fir'aun yang congkak dan durhaka. Dan bahwa siapa pun yang congkak dan durhaka akan mengalami nasib yang sama seperti Fir'aun itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4382,
                    "inSurah": 57
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ وَلَمَّا ضُرِبَ ابْنُ مَرْيَمَ مَثَلًا إِذَا قَوْمُكَ مِنْهُ يَصِدُّونَ",
                    "transliteration": {
                        "en": "Wa lammaa duribab nu Maryama masalan izaa qawmu ka minhu yasidoon"
                    }
                },
                "translation": {
                    "en": "And when the son of Mary was presented as an example, immediately your people laughed aloud.",
                    "id": "Dan ketika putra Maryam (Isa) dijadikan perumpamaan, tiba-tiba kaummu (Suku Quraisy) bersorak karenanya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4382",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4382.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4382.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Setelah menjelaskan bahwa kaum Nabi Musa yang menentang ajaran Allah dan hukuman yang ditimpakan kepada mereka adalah pelajaran bagi orang-orang datang kemudian, Allah lalu menjelaskan pelajaran yang dapat diambil oleh Nabi Muhammad dan umatnya dari kisah Nabi Isa. Dan ketika putra Maryam, yakni Nabi Isa, dijadikan oleh orang-orang musyrik perumpamaan untuk menentang kebenaran ayat-ayat Allah, tiba-tiba kaummu, suku Quraisy wahai Nabi Muhammad bersorak gembira karenanya.",
                        "long": "Ayat ini menerangkan bahwa Nabi Isa putra Maryam dijadikan contoh oleh kaum musyrikin Mekah untuk menjatuhkan dan memperolok-olokkan Nabi Muhammad saw. Hal itu terjadi ketika beliau menyampaikan ayat,\" \"Sungguh, kamu (orang kafir) dan apa yang kamu sembah selain Allah, adalah bahan bakar Jahanam.,\" (al-Anbiya'/21: 98). Mereka bersorak-sorai kegirangan, karena menyangka memperoleh alasan untuk membuktikan bahwa Nabi Muhammad bertindak salah berdasarkan ayat itu. Hal itu karena Nabi Isa disembah oleh sebagian manusia. Dengan begitu beliau juga akan masuk neraka bersama mereka yang menyembahnya. Untuk membantah pandangan itu Allah menurunkan ayat, \"Sungguh, sejak dahulu bagi orang-orang yang telah ada (ketetapan) yang baik dari Kami, mereka itu akan dijauhkan (dari neraka),\" (al-Anbiya'/21:101). Dengan demikian Nabi Isa, 'Uzair, dan pendeta-pendeta serta rahib-rahib yang taat dan hanya menyembah Allah, akan masuk surga, dan orang-orang sesat yang kemudian menjadikan mereka tuhan-tuhan selain Allah akan masuk neraka. Mengenai Isa sendiri yang disembah mereka yang sesat itu turun ayat ini untuk membantahnya, \"Dan tatkala putra Maryam dijadikan perumpamaan, tiba-tiba kaummu, ya Muhammad, bersorak karenanya,\" yaitu menyoraki kamu karena firman-Nya itu. Selanjutnya Allah menjelaskan, \"Dia (Isa) tidak lain hanyalah seorang hamba yang Kami anugerahi nikmat dan Kami jadikan tanda untuk Bani Israil. Dan jika Kami kehendaki, benar-benar Kami jadikan sebagian kalian malaikat-malaikat di bumi yang turun-temurun. Dan ia (Isa) sungguh merupakan bukti tentang adanya hari Kiamat¦.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4383,
                    "inSurah": 58
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالُوا أَآلِهَتُنَا خَيْرٌ أَمْ هُوَ ۚ مَا ضَرَبُوهُ لَكَ إِلَّا جَدَلًا ۚ بَلْ هُمْ قَوْمٌ خَصِمُونَ",
                    "transliteration": {
                        "en": "Wa qaalooo 'a-aalihatunaa khairun am hoo; maa daraboohu laka illaa jadalaa; balhum qawmun khasimoon"
                    }
                },
                "translation": {
                    "en": "And they said, \"Are your gods better, or is he?\" They did not present the comparison except for [mere] argument. But, [in fact], they are a people prone to dispute.",
                    "id": "Dan mereka berkata, “Manakah yang lebih baik tuhan-tuhan kami atau dia (Isa)?” Mereka tidak memberikan (perumpamaan itu) kepadamu melainkan dengan maksud membantah saja, sebenarnya mereka adalah kaum yang suka bertengkar."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4383",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4383.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4383.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan mereka berkata, “Manakah yang lebih baik tuhan-tuhan kami, berupa berhala-berhala yang kami sembah atau dia, yakni Isa?” Mereka tidak memberikannya, yakni perumpamaan itu, kepadamu, Muhammad, melainkan dengan maksud membantah saja, bukan untuk menunjukkan kebenaran keyakinan mereka, tetapi untuk memelesetkan apa yang disampaikan kepada mereka. Bahkan sebenarnya mereka adalah kaum yang suka bertengkar.",
                        "long": "Dalam ayat ini diterangkan bahwa kaum musyrikin Mekah itu membandingkan tuhan-tuhan mereka, yaitu berhala-berhala, dengan Nabi Isa yang telah dipertuhankan oleh orang-orang sesat sebelumnya, manakah yang lebih baik. Menurut pandangan mereka Nabi Isa tidak lebih baik dari berhala-berhala yang mereka sembah, karena Nabi Isa juga akan masuk neraka bersama mereka dan tuhan-tuhan mereka. Lalu Allah mematahkan pandangan itu dengan menerangkan bahwa mereka sebenarnya hanya berdebat dan menyanggah tak menentu, karena memang begitulah sifat yang sudah tertanam dalam diri mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4384,
                    "inSurah": 59
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنْ هُوَ إِلَّا عَبْدٌ أَنْعَمْنَا عَلَيْهِ وَجَعَلْنَاهُ مَثَلًا لِّبَنِي إِسْرَائِيلَ",
                    "transliteration": {
                        "en": "In huwa illaa 'abdun an'amnaa 'alaihi wa ja'alnaahu masalal li Baneee Israaa'eel"
                    }
                },
                "translation": {
                    "en": "Jesus was not but a servant upon whom We bestowed favor, and We made him an example for the Children of Israel.",
                    "id": "Dia (Isa) tidak lain hanyalah seorang hamba yang Kami berikan nikmat (kenabian) kepadanya dan Kami jadikan dia sebagai contoh pelajaran bagi Bani Israil."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4384",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4384.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4384.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Lalu Allah menunjukkan kepada mereka bahwa dia, yaitu Isa, tidak lain hanyalah seorang hamba, bukan tuhan seperti keyakinan orang-orang Nasrani, yang Kami berikan nikmat ke nabian kepadanya dan Kami jadikan dia sebagai contoh pelajaran yang sangat mengagumkan bagi Bani Israil, baik yang hidup pada masa Isa maupun yang sesudahnya.",
                        "long": "Allah menegaskan bahwa Nabi Isa sesungguhnya adalah hamba-Nya, bukan anak-Nya dan bukan Tuhan. Ia telah dikaruniai kemuliaan, yaitu menjadi nabi yang menyampaikan ajaran-ajaran Allah dalam kitab Injil. Di samping itu Nabi Isa dijadikan-Nya sebagai contoh bagi Bani Israil tentang bukti kekuasaan-Nya, bahwa Ia menciptakan sesuatu melalui proses yang tidak wajar, yaitu menciptakan manusia tanpa ayah. Dengan mengemukakan contoh itu, Bani Israil dan siapa pun sesudahnya tidak boleh memandangnya sebagai anak Tuhan dan mengangkatnya sebagai tuhan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4385,
                    "inSurah": 60
                },
                "meta": {
                    "juz": 25,
                    "page": 493,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَوْ نَشَاءُ لَجَعَلْنَا مِنكُم مَّلَائِكَةً فِي الْأَرْضِ يَخْلُفُونَ",
                    "transliteration": {
                        "en": "Wa law nashaaa'u laja'alnaa minkum malaaa'ikatan fil ardi yakhlufoon"
                    }
                },
                "translation": {
                    "en": "And if We willed, We could have made [instead] of you angels succeeding [one another] on the earth.",
                    "id": "Dan sekiranya Kami menghendaki, niscaya ada di antara kamu yang Kami jadikan malaikat-malaikat (yang turun temurun) sebagai pengganti kamu di bumi."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4385",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4385.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4385.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sekiranya Kami menghendaki, tetapi Kami tidak menghendaki dan tidak melakukannya, niscaya Kami menjadikan sebahagian di antara kamu malaikat-malaikat yang secara turun temurun dan silih berganti menggantikan kamu di bumi.",
                        "long": "Allah membantah kepercayaan kaum musyrikin Mekah bahwa malaikat adalah anak Allah yang harus disembah. Kepercayaan itu sama dengan kepercayaan sebagian Bani Israil dan orang-orang sesudah mereka tentang Nabi Isa. Allah menegaskan bahwa bila Ia mau, Ia dapat menciptakan manusia menjadi malaikat yang menghuni bumi ini secara turun-temurun, atau menggantikan manusia di bumi yang juga hidup beranak pinak sampai hari kiamat. Lalu apakah malaikat itu adalah anak-anak Allah dan pantas disembah? Dengan penjelasan itu Allah hendak menyampaikan kepada kaum musyrikin Mekah bahwa Ia mampu menciptakan apa saja termasuk yang jauh lebih hebat dari penciptaan Nabi Isa, karena itu hanya Allahlah yang pantas disembah, bukan ciptaan-Nya itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4386,
                    "inSurah": 61
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِنَّهُ لَعِلْمٌ لِّلسَّاعَةِ فَلَا تَمْتَرُنَّ بِهَا وَاتَّبِعُونِ ۚ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ",
                    "transliteration": {
                        "en": "Wa innahoo la'ilmul lis Saa'ati fala tamtarunna bihaa wattabi'oon; haazaa Siraatum Mustaqeem"
                    }
                },
                "translation": {
                    "en": "And indeed, Jesus will be [a sign for] knowledge of the Hour, so be not in doubt of it, and follow Me. This is a straight path.",
                    "id": "Dan sungguh, dia (Isa) itu benar-benar menjadi pertanda akan datangnya hari Kiamat. Karena itu, janganlah kamu ragu-ragu tentang (Kiamat) itu dan ikutilah Aku. Inilah jalan yang lurus."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4386",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4386.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4386.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sungguh dia, yakni Nabi Isa yang mengagumkan itu yang lahir tanpa ayah, dan dianugerahi kemampuan menghidupkan orang mati serta menyembuhkan berbagai macam penyakit, benar-benar menjadi pertanda akan datangnya hari Kiamat. Karena itu, janganlah kamu ragu-ragu sedikit pun tentang kepastian datangnya hari Kiamat itu dan ikutilah Aku dengan mengikuti ajaran-ajaran yang disampaikan oleh rasul-Ku. Inilah jalan yang lurus yang dapat menyelamatkan kamu dari siksaan-Ku di dunia dan di akhirat.",
                        "long": "Allah menerangkan lebih lanjut tentang kelebihan yang diberikan kepada Nabi Isa, yang akan menjadi bukti tentang adanya hari Kiamat. Hal itu karena Nabi Isa memiliki mukjizat-mukjizat besar, seperti menghidupkan orang mati, menyembuhkan kebutaan, dan sebagainya. Mukjizat-mukjizat itu merupakan bukti bahwa Allah yang memberikannya mampu menciptakan hari Kiamat. \n\nDi samping itu hadis-hadis sahih menginformasikan akan datangnya Nabi Isa menjelang hari Kiamat. Hadis itu diriwayatkan dari berbagai sumber, di antaranya Abu Hurairah, Ibnu 'Abbas , 'Ikrimah, al-hasan, Qatadah, dan adh-ahhak, sehingga dipandang mutawatir oleh sebagian ulama. Hadis itu di antaranya adalah: \n\nNabi saw bersabda, \"Demi (Allah)yang menguasai jiwaku, hampir saja turun kepada kalian Isa bin Maryam sebagai hakim yang adil. (Riwayat al-Bukhari dan Muslim)\n\nDengan demikian maksud ayat ini adalah bahwa munculnya Nabi Isa menjelang hari Kiamat merupakan tanda bahwa Kiamat akan datang.\n\nSelanjutnya Allah meminta manusia agar tidak meragukan datangnya hari Kiamat. Karena itu mereka harus mempersiapkan diri dengan cara beriman dan berbuat baik, supaya dapat memetik buah iman dan amalnya nanti di akhirat. Dengan begitu manusia akan hidup bahagia selamanya di hari akhirat nanti.\n\nAllah meminta Bani Israil agar mengikuti ajaran-ajaran yang Ia sampaikan kepada Nabi Isa mengenai adanya hari Kiamat. Ajaran tentang adanya kiamat meminta manusia agar berbuat baik sebagai persiapan untuk menghadapinya. Ajaran itu merupakan jalan yang lurus yang mutlak benar dan pasti dapat mengantarkan manusia ke kehidupan yang bahagia di akhirat. Jalan yang lurus itulah yang diajarkan Islam, yang merupakan agama yang dibawa semua nabi, termasuk nabi terakhir yaitu Muhammad saw."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4387,
                    "inSurah": 62
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَا يَصُدَّنَّكُمُ الشَّيْطَانُ ۖ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ",
                    "transliteration": {
                        "en": "Wa laa yasuddan nakumush Shaitaanu innahoo lakum 'aduwwum mubeen"
                    }
                },
                "translation": {
                    "en": "And never let Satan avert you. Indeed, he is to you a clear enemy.",
                    "id": "Dan janganlah kamu sekali-kali dipalingkan oleh setan; sungguh, setan itu musuh yang nyata bagimu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4387",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4387.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4387.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan oleh sebab itu, Allah dengan tegas memperingatkan mereka dengan mengatakan, “Janganlah kamu sekali-kali di palingkan oleh setan dari jalan-Ku yang lurus itu sehingga menyimpang dari ajaran-ajaran-Ku. Sungguh, setan itu merupakan musuh yang nyata bagimu yang selalu membawa kamu kepada kesesatan.”",
                        "long": "Selanjutnya Allah memperingatkan manusia agar tidak terjebak oleh tipu daya setan. Tugas manusia adalah beribadah, yaitu mengabdi kepada Allah dengan mempersembahkan kebaikan kepada seluruh alam. Dalam perjuangannya itu ia akan selalu dihalang-halangi dan dihadang oleh setan. Manusia harus melawannya supaya usaha dan perjuangannya dalam mewujudkan kebaikan tidak sampai dihentikan setan.\n\nDengan demikian setan juga bekerja keras, untuk menjatuhkan manusia. Karena ia memang musuh sejati manusia. Permusuhan sejati itu terjadi karena setan dendam akibat dilaknat Allah dan diusir dari surga, karena ia tidak mau sujud kepada nenek moyang manusia, yaitu Adam."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4388,
                    "inSurah": 63
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَمَّا جَاءَ عِيسَىٰ بِالْبَيِّنَاتِ قَالَ قَدْ جِئْتُكُم بِالْحِكْمَةِ وَلِأُبَيِّنَ لَكُم بَعْضَ الَّذِي تَخْتَلِفُونَ فِيهِ ۖ فَاتَّقُوا اللَّهَ وَأَطِيعُونِ",
                    "transliteration": {
                        "en": "Wa lammaa jaaa'a 'Eesaa bilbaiyinaati qaala qad ji'tukum bil Hikmati wa li-ubaiyina lakum ba'dal lazee takhtalifoona feehi fattaqul laaha wa atee'oon"
                    }
                },
                "translation": {
                    "en": "And when Jesus brought clear proofs, he said, \"I have come to you with wisdom and to make clear to you some of that over which you differ, so fear Allah and obey me.",
                    "id": "Dan ketika Isa datang membawa keterangan, dia berkata, “Sungguh, aku datang kepadamu dengan membawa hikmah dan untuk menjelaskan kepadamu sebagian dari apa yang kamu perselisihkan, maka bertakwalah kepada Allah dan taatlah kepadaku."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4388",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4388.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4388.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ketika Nabi Isa datang kepada kaumnya, Bani Israil, membawa keterangan yang nyata yang bersumber dari Allah, dia lalu berkata, “Sungguh, aku datang kepadamu, wahai kaumku dengan membawa hikmah, yakni ajaran-ajaran dan hukum-hukum yang bersumber dari Allah yang dapat menyelamatkan kamu dan untuk menjelaskan kepada-mu sebagian dari apa yang kamu perselisihkan dari ajaran-ajaran agama yang di turunkan Allah di dalam Taurat. Maka bertakwalah kamu kepada Allah dengan melaksanakan segala yang di perintahkan-Nya dan meninggalkan larangan-larangan-Nya dan taatlah pula kepadaku dengan mengikuti tuntunan yang aku sampaikan kepadamu.",
                        "long": "Ayat ini menjelaskan bagaimana sesungguhnya dakwah Nabi Isa kepada Bani Israil. Nabi Isa menyampaikan pokok-pokok ajaran yang diterimanya dari Allah swt, antara lain tentang iman kepada Allah sebagai Tuhan yang Maha Esa, iman kepada adanya hari kemudian, berbuat baik kepada sesama manusia, dan tidak melakukan perbuatan jahat. Nabi lsa menegaskan bahwa pokok-pokok ajaran yang disampaikannya itu adalah hikmah, yaitu beragama tauhid yang perlu dijalankan, yakni melakukan perbuatan-perbuatan mulia dan menjauhi perbuatan-perbuatan jahat yang akan menentukan kebahagiaan umat manusia di dunia dan akhirat. (Mengenai rincian apa itu hikmah, bacalah Surah al-Isra'/17: 23-39).\n\nNabi Isa juga menjelaskan tugasnya yang lain, yaitu menjelaskan apa yang diperselisihkan oleh Bani Israil. Perselisihan itu ada yang berkenaan dengan masalah agama, misalnya mengenai apakah hewan yang berkuku dan lemak sapi dan domba haram (al-An'am/6:146). Nabi Isa datang menjelaskan kehalalan semuanya itu (Ali 'Imran/3:50). Menurut Ibn Jarir, perselisihan itu mengenai persoalan-persoalan dunia, bukan mengenai agama. Hal itu tampaknya berkenaan dengan perpecahan Bani Israil menjadi berbagai sekte yang selalu baku hantam satu sama lainnya. \n\nSetelah itu Nabi Isa meminta mereka bertakwa yaitu mengerjakan apa yang diperintahkan Allah dan menjauhi apa yang dilarang-Nya. Takwa adalah konsekuensi iman, yaitu menjalankan nilai-nilai yang terkandung dalam hikmah di atas. Artinya, iman perlu dibuktikan dengan pelaksanaan perbuatan-perbuatan baik tersebut. Dan Nabi Isa meminta umatnya agar mematuhinya, yaitu menjalankan segala yang ia sampaikan dan tidak selalu memperselisihkan ajaran-ajaran agama."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4389,
                    "inSurah": 64
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّ اللَّهَ هُوَ رَبِّي وَرَبُّكُمْ فَاعْبُدُوهُ ۚ هَٰذَا صِرَاطٌ مُّسْتَقِيمٌ",
                    "transliteration": {
                        "en": "Innal laaha Huwa Rabbee wa Rabbukum fa'budooh; haaza Siraatum Mustaqeem"
                    }
                },
                "translation": {
                    "en": "Indeed, Allah is my Lord and your Lord, so worship Him. This is a straight path.\"",
                    "id": "Sungguh Allah, Dia Tuhanku dan Tuhanmu, maka sembahlah Dia. Ini adalah jalan yang lurus.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4389",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4389.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4389.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sungguh Allah yang kamu takuti, taati, dan patuhi itu, Dialah Tuhanku dan Tuhanmu yang telah menciptakan aku dan kamu dan telah memberikan berbagai nikmat kepadaku dan kepadamu, maka sembahlah Dia satu-satunya, jangan menyekutukan Dia dengan yang lain. Ini adalah jalan yang lurus yang dapat menyelamatkan kamu dari siksaan-Nya yang amat pedih.”",
                        "long": "Nabi Isa menegaskan inti ajaran yang disampaikannya, yaitu bahwa Tuhan hanyalah Allah. Allah adalah Tuhan semua makhluk, Tuhan dia dan Tuhan mereka juga. Konsekuensi mempertuhankan Allah adalah menyembah-Nya dan mengabdi kepada-Nya. Menyembah Allah adalah mengerjakan ibadah untuk-Nya, dan mengabdi kepada-Nya adalah melakukan perbuatan-perbuatan baik. Maka jangan menyembah selain dari Allah, karena hal itu akan membawa manusia kepada kesesatan. Itulah jalan yang lurus, yaitu jalan hidup benar yang menjamin kebahagiaan di dunia dan di akhirat. \"Jalan lurus\" dalam ayat ini adalah tauhid dan perbuatan baik. \"Jalan lurus\" dalam ayat 61 adalah percaya kepada adanya hari akhirat yang juga menghendaki perbuatan baik. Dengan demikian \"jalan yang lurus\" dalam kedua ayat itu sama hakikatnya, karena iman kepada Allah menghendaki manusia iman kepada hari akhirat dan berbuat baik, dan iman kepada hari akhirat juga menghendaki manusia iman kepada Allah dan berbuat baik."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4390,
                    "inSurah": 65
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَاخْتَلَفَ الْأَحْزَابُ مِن بَيْنِهِمْ ۖ فَوَيْلٌ لِّلَّذِينَ ظَلَمُوا مِنْ عَذَابِ يَوْمٍ أَلِيمٍ",
                    "transliteration": {
                        "en": "Fakhtalafal ahzaabu mim bainihim fawailul lillazeena zalamoo min 'azaabi Yawmin aleem"
                    }
                },
                "translation": {
                    "en": "But the denominations from among them differed [and separated], so woe to those who have wronged from the punishment of a painful Day.",
                    "id": "Tetapi golongan-golongan (yang ada) saling berselisih di antara mereka; maka celakalah orang-orang yang zalim karena azab pada hari yang pedih (Kiamat)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4390",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4390.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4390.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Akan tetapi, golongan-golongan yang ada saling berselisih di antara mereka mengenai pribadi Nabi Isa yang agung dan hamba Allah yang lahir tanpa ayah itu. Maka, celakalah orang-orang yang zalim itu karena perselisihan mereka dan mengingkari Isa sebagai utusan Allah dan menentang ajaran agama yang dibawanya karena azab hari yang amat pedih pada hari Kiamat kelak.",
                        "long": "Bani Israil berselisih pendapat mengenai Nabi Isa baik semasa ia hidup maupun setelah meninggal. Yang menjadi ajang perselisihan waktu ia masih hidup, adalah yang menerimanya sebagai nabi dan manusia suci, ada yang menuduhnya sebagai anak dari hubungan haram yang dilakukan ibunya. Dan setelah ia meninggal ada yang memandangnya anak Tuhan, atau Tuhan itu sendiri, dan ada yang memandangnya manusia biasa yang diutus sebagai rasul.\n\nPerselisihan itu sangat tajam sehingga terbentuk banyak sekali sekte yang berseberangan. Mereka tidak hanya berpecah belah tetapi juga berbunuh-bunuhan (berperang-perangan). Yang berpandangan salah di antara sekte-sekte itu berpandangan salah mengenai Nabi Isa sebagimana dijelaskan dalam ayat-ayat di atas, akan bernasib malang, yaitu azab yang pedih di dalam neraka di hari akhirat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4391,
                    "inSurah": 66
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هَلْ يَنظُرُونَ إِلَّا السَّاعَةَ أَن تَأْتِيَهُم بَغْتَةً وَهُمْ لَا يَشْعُرُونَ",
                    "transliteration": {
                        "en": "Hal yanzuroona illas Saa'ata an taatiyahum baghtatanw wa hum laa yash'uroon"
                    }
                },
                "translation": {
                    "en": "Are they waiting except for the Hour to come upon them suddenly while they perceive not?",
                    "id": "Apakah mereka hanya menunggu saja kedatangan hari Kiamat yang datang kepada mereka secara mendadak sedang mereka tidak menyadarinya?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4391",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4391.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4391.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dengan pembangkangan mereka untuk mengakui Nabi Isa sebagai rasul Allah dan pengingkaran mereka terhadap ajaran-Nya, lalu Allah mengatakan bahwa apakah mereka dengan keadaan yang demikian itu hanya menunggu saja kedatangan hari Kiamat yang datang kepada mereka secara mendadak, tanpa mereka mengetahui sebelumnya, sedang mereka tidak menyadarinya karena mereka selalu sibuk dengan pertengkaran mereka?",
                        "long": "Ayat ini membantah kaum musyrikin Mekah yang salah memahami Surah al-Anbiya'/21: 98, bahwa orang yang menyembah selain Allah akan bersama sembahannya itu nanti masuk neraka. Nabi Isa disembah, karena itu, menurut mereka, juga akan masuk neraka bersama mereka yang menyembahnya. Allah telah membantahnya dengan menjelaskan tentang Nabi Isa secara panjang lebar dalam ayat-ayat di atas. Nabi Isa memang disembah, tetapi yang menyembahnya adalah mereka yang sesat. Oleh karena itu Nabi Isa tidak akan masuk neraka. Yang akan masuk neraka adalah mereka yang sesat. Begitu juga orang-orang sesat yang menyembah berhala-berhala, yaitu kaum musyrikin Mekah. Mereka bersama sembahan-sembahan mereka itu yang akan masuk neraka. \n\nDalam ayat ini dijelaskan bahwa bila kaum musyrikin Mekah itu tetap tidak mau menerima penjelasan yang begitu gamblang, Allah bertanya apakah mereka tidak akan menyesal. Sebab kiamat pasti datang, dan bila datang ia akan terjadi secara tiba-tiba di saat mereka terlena oleh kenikmatan duniawi. Sebelum terlambat, di sini Allah meminta mereka agar beriman kepada Nabi Muhammad dan agama yang didakwahkannya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4392,
                    "inSurah": 67
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 429,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "الْأَخِلَّاءُ يَوْمَئِذٍ بَعْضُهُمْ لِبَعْضٍ عَدُوٌّ إِلَّا الْمُتَّقِينَ",
                    "transliteration": {
                        "en": "Al akhillaaa'u Yawma'izim ba'duhum liba'din 'aduwwun illal muttaqeen"
                    }
                },
                "translation": {
                    "en": "Close friends, that Day, will be enemies to each other, except for the righteous",
                    "id": "Teman-teman karib pada hari itu saling bermusuhan satu sama lain, kecuali mereka yang bertakwa."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4392",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4392.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4392.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Teman-teman karib pada hari Kiamat itu sebagian mereka menjadi musuh bagi yang lainnya karena hubungan pertemanan mereka terjalin atas dasar kezaliman, tidak atas dasar kebaikan dan kemaslahatan, kecuali orang-orang yang bertakwa yang tidak saling bermusuhan karena pertemanan dan persahabatan mereka terjalin atas dasar ketaatan kepada Allah.",
                        "long": "Ayat ini menerangkan bahwa pada hari Kiamat, persahabatan dan hubungan akrab antara orang-orang kafir, baik hubungan persahabatan yang terjadi antara mereka maupun hubungan mereka dengan sembahan-sembahan yang mereka sembah selain Allah; akan berubah menjadi permusuhan, dan mereka akan saling tuduh satu dengan yang lain. Seorang teman menuduh temannya yang lain yang menjadi sebab ia masuk neraka dan sengsara pada hari itu, sedangkan berhala-berhala mengingkari penyembahan yang dilakukan penyembah-penyembahnya semasa hidup di dunia karena berhala-berhala itu sebagai benda mati tidak tahu-menahu sedikit pun tentang apa yang telah dilakukan penyembah-penyembahnya semasa hidup di dunia. Masing-masing berlepas diri dari tuduhan pihak yang lain.\n\nApa yang disebutkan di atas diungkapkan Nabi Ibrahim kepada kaumnya sebagai berikut: \n\nDan dia (Ibrahim) berkata, \"Sesungguhnya berhala-berhala yang kamu sembah selain Allah, hanya untuk menciptakan perasaan kasih sayang di antara kamu dalam kehidupan di dunia, kemudian pada hari Kiamat sebagian kamu akan saling mengingkari dan saling mengutuk; dan tempat kembalimu ialah neraka, dan sama sekali tidak ada penolong bagimu.\" (al-'Ankabut/29: 25)\n\n'Ali bin Abi thalib berkata,\"Orang-orang yang berteman (sewaktu di dunia) akan menjadi bermusuhan antara sebagian mereka dengan sebagian yang lain pada hari Kiamat, kecuali orang-orang yang bertakwa.\" 'Ali melanjutkan, \"Ada dua orang Mukmin yang berteman, dan dua orang kafir yang berteman. Lalu salah seorang dari dua orang Mukmin itu meninggal dunia. Ia diberi kabar gembira dengan masuk surga, maka ia teringat teman-temannya. Ia berkata, \"Ya Allah, sesungguhnya si fulan temanku dahulu pernah mengajakku untuk taat kepada-Mu dan rasul-Mu. Ia mengajakku untuk kebaikan, serta melarangku dari keburukan, dan mengabarkan kepadaku bahwa kelak aku akan bertemu dengan-Mu. Oleh karena itu, ya Allah, jangan sesatkan dirinya setelah kepergianku, sampai saat Engkau memperlihatkan (surga)kepadanya, sebagaimana telah Engkau perlihatkan kepadaku, sampai Engkau rida kepadanya sebagaimana Engkau rida kepadaku.\" Kemudian dikatakan kepada Mukmin tersebut, \"Pergilah, seandainya kamu tahu apa yang Aku sediakan baginya disisi-Ku tentulah kamu akan banyak tertawa dan sedikit menangis.\" 'Ali melanjutkan, \"Lalu mukmin yang satu lagi meninggal, sehingga ruh mereka bertemu. Setelah itu, dikatakan kepada mereka, \"Hendaklah masing-masing kalian memuji temannya.\" Maka masing-masing mereka berkata, \"(Engkau)adalah sebaik-baiknya saudara, sahabat, dan teman.\" \n\nDan apabila meninggal dunia satu diantara dua teman yang kafir, maka ia dikabari akan masuk neraka. Lalu ia teringat temannya, maka ia berkata, \"Ya Allah, sesungguhnya si fulan temanku pernah mengajakku untuk durhaka kepada-Mu dan rasul-Mu.Ia mengajakku untuk berbuat jahat dan melarangku berbuat baik, memberitahu kepadaku bahwa aku tidak akan bertemu dengan-Mu. Oleh karena itu ya Allah, janganlah Engkau beri petunjuk kepadanya setelah kepergianku, sampai Engkau tunjukkan sesuatu (neraka) seperti yang Engkau tunjukkan kepadaku, dan murkailah dia seperti Engkau murka kepadaku.\" lalu 'Ali melanjutkan, \"lalu orang kafir yang satu lagi, maka ruh mereka bertemu. Setelah itu dikatakan kepada mereka, \"Hendaklah masing-masing kalian memuji temannya.\" Maka masing-masing mereka berkata, \"(Engkau) adalah seburuk-buruk saudara, teman dan kekasih. (Riwayat Ibn Abi hatim)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4393,
                    "inSurah": 68
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "يَا عِبَادِ لَا خَوْفٌ عَلَيْكُمُ الْيَوْمَ وَلَا أَنتُمْ تَحْزَنُونَ",
                    "transliteration": {
                        "en": "Yaa 'ibaadi laa khawfun 'alaikumul Yawma wa laaa antum tahzanoon"
                    }
                },
                "translation": {
                    "en": "[To whom Allah will say], \"O My servants, no fear will there be concerning you this Day, nor will you grieve,",
                    "id": "”Wahai hamba-hamba-Ku! Tidak ada ketakutan bagimu pada hari itu dan tidak pula kamu bersedih hati."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4393",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4393.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4393.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah telah menggambarkan dalam ayat-ayat yang lalu tentang keadaan Bani Israil yang memperoleh azab yang amat pedih di hari Kiamat karena ke zaliman mereka. Selanjutnya, Allah menggambarkan ke nikmatan yang akan di peroleh oleh orang-orang saleh di dalam surga. “Wahai hamba-hamba-Ku yang mengikuti jalan-Ku yang lurus! Tidak ada ketakutan bagimu pada hari Kiamat itu dan tidak pula kamu bersedih hati dalam menghadapi keadaan apa pun pada hari itu.",
                        "long": "Dalam ayat ini diterangkan pernyataan Allah kepada orang-orang yang beriman, di waktu terjadinya hari Kiamat, yang pada saat itu semua manusia berada dalam kebingungan dan ketakutan. Allah berkata kepada mereka, \"Wahai hamba-hamba-Ku, tidak ada sesuatu pun yang perlu kamu takutkan dan khawatirkan pada hari Kiamat, kamu semua telah menempuh jalan yang lurus selama hidup di dunia dan telah melakukan segala sesuatu karena cintamu kepada-Ku dan karena kamu mencari keridaan-Ku. Karena itu, pada hari ini, kamu semua berada di bawah perlindungan-Ku dan dalam jaminan keamanan dari-Ku. Wahai hamba-hamba-Ku, janganlah kamu bersedih hati karena berpisah dengan dunia dan janganlah khawatir menghadapi hidup pada masa yang akan datang. Hendaklah kamu yakin bahwa sejak saat ini, kamu telah lepas dari segala cobaan dan malapetaka yang akan menimpamu, dan pada saat ini pula kamu akan menempati tempat yang paling baik yang tak ada tandingannya, yaitu surga yang mempunyai kenikmatan yang sempurna.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4394,
                    "inSurah": 69
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "الَّذِينَ آمَنُوا بِآيَاتِنَا وَكَانُوا مُسْلِمِينَ",
                    "transliteration": {
                        "en": "Allazeena aamanoo bi Aayaatinaa wa kaanoo muslimeen"
                    }
                },
                "translation": {
                    "en": "[You] who believed in Our verses and were Muslims.",
                    "id": "(Yaitu) orang-orang yang beriman kepada ayat-ayat Kami dan mereka berserah diri."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4394",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4394.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4394.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Orang-orang yang tidak takut dan tidak bersedih hati itu ialah orang-orang yang beriman kepada ayat-ayat Kami yang tertulis yang dibawa oleh para rasul utusan Kami serta yang terhampar di alam ini, dan mereka berserah diri dengan sepenuhnya kepada Allah dengan melaksanakan ajaran-ajaran-Nya.",
                        "long": "Dalam ayat ini, diterangkan tentang hamba-hamba yang diseru Allah pada hari itu yaitu hamba-hamba yang telah beriman kepada ayat-ayat-Nya, yang jiwanya telah tunduk dan patuh kepada-Nya, yang melaksanakan semua perintah-Nya dan menjauhkan larangan-larangan-Nya.\n\nDalam Tafsir Ibnu Katsir disebutkan bahwa al-Mu'tamir bin Sulaiman dari ayahnya berkata, \"Pada waktu terjadinya hari Kiamat, ketika manusia dibangkitkan dari kuburnya, tidak ada seorang pun yang tidak merasa takut dan khawatir serta bingung. Ketika itu, terdengarlah suara, \"Wahai hamba-hamba-Ku, tidak ada yang perlu kamu takuti dan khawatirkan pada hari ini dan janganlah kamu risau hati.\" Setelah mendengar itu, semua manusia mengharapkan agar ia termasuk hamba-hamba Allah yang dimaksud dalam seruan itu, terdengar lagi seruan yang kedua, \"Wahai orang-orang yang beriman kepada ayat-ayat Kami, yang tunduk dan berserah diri kepada Allah.\" Mendengar seruan itu, maka orang-orang yang beriman bergembira dan hilanglah kesedihan, ketakutan dan kebingungan mereka. Sedangkan orang-orang kafir berputus asa."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4395,
                    "inSurah": 70
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "ادْخُلُوا الْجَنَّةَ أَنتُمْ وَأَزْوَاجُكُمْ تُحْبَرُونَ",
                    "transliteration": {
                        "en": "Udkhulul Jannata antum wa azwaajukum tuhbaroon"
                    }
                },
                "translation": {
                    "en": "Enter Paradise, you and your kinds, delighted.\"",
                    "id": "Masuklah kamu ke dalam surga, kamu dan pasanganmu akan digembirakan.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4395",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4395.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4395.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Di hari Kiamat kelak kami akan memerintahkan mereka, \"Masuklah kamu semua ke dalam surga, kamu dan pasangan-pasanganmu, yaitu suami atau istrimu yang berserah diri kepada Allah dengan sepenuhnya itu akan selalu di gembirakan dengan segala pelayanan dan ke nikmatan surga yang sangat menyenangkan.”",
                        "long": "Kemudian terdengar pula seruan berikutnya, \"Wahai orang-orang yang beriman, masuklah kamu dan istri-istrimu ke dalam surga yang telah dijanjikan kepadamu dahulu, bersenang-senang dan bersuka-rialah di dalamnya menikmati karunia Allah yang telah dilimpahkan kepada kamu semua. Karena Allah memuliakan mereka dengan memasukkan ke dalam surga.\n\nDalam ayat yang lain, diterangkan bahwa orang-orang yang beriman beserta istri dan anak cucu mereka yang beriman akan ditinggikan derajatnya di dalam surga, seperti derajat bapak-bapak mereka yang mantap dan kuat imannya. Allah berfirman:\n\nDan orang-orang yang beriman, beserta anak cucu mereka yang mengikuti mereka dalam keimanan, Kami pertemukan mereka dengan anak cucu mereka (di dalam surga), dan Kami tidak mengurangi sedikit pun pahala amal (kebajikan) mereka. Setiap orang terikat dengan apa yang dikerjakannya. (ath-thur/52: 21)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4396,
                    "inSurah": 71
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "يُطَافُ عَلَيْهِم بِصِحَافٍ مِّن ذَهَبٍ وَأَكْوَابٍ ۖ وَفِيهَا مَا تَشْتَهِيهِ الْأَنفُسُ وَتَلَذُّ الْأَعْيُنُ ۖ وَأَنتُمْ فِيهَا خَالِدُونَ",
                    "transliteration": {
                        "en": "Yutaafu 'alaihim bishaa fim min zahabinw wa akwaab, wa feehaa maatashtaheehil anfusu wa talazzul a'yunu wa antum feehaa khaalidoon"
                    }
                },
                "translation": {
                    "en": "Circulated among them will be plates and vessels of gold. And therein is whatever the souls desire and [what] delights the eyes, and you will abide therein eternally.",
                    "id": "Kepada mereka diedarkan piring-piring dan gelas-gelas dari emas, dan di dalam surga itu terdapat apa yang diingini oleh hati dan segala yang sedap (dipandang) mata. Dan kamu kekal di dalamnya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4396",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4396.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4396.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Di dalam surga nanti kepada mereka yang beriman dan bertakwa itu diedarkan piring-piring dari emas yang berisi aneka macam makanan yang lezat dan juga gelas-gelas minum yang berisi aneka macam minuman yang lezat, dan di dalamnya, yakni di dalam surga itu terdapat apa saja yang di ingini oleh hati dan segala yang sedap di pandang mata. Dan kamu sekalian, wahai orang-orang yang bertakwa dan menyerahkan diri sepenuhnya kepada Allah, akan menjadi orang-orang yang kekal di dalamnya.",
                        "long": "Setelah orang-orang yang beriman beserta keluarga mereka masuk surga, datanglah kepada mereka pelayan-pelayan membawa piring-piring emas yang berisi makanan-makanan yang lezat dan piala-piala yang berisi minuman yang menyegarkan jasmani dan rohani. Di dalam surga itu mereka memperoleh semua yang mereka inginkan, semua yang menyejukkan dan menenteramkan hati mereka, semua yang indah menurut pandangan dan pendengaran mereka. Tidaklah dapat digambarkan keadaan surga itu sebelumnya, karena semuanya itu belum pernah ada contoh dan bandingannya dalam kehidupan duniawi. Dinyatakan pula bahwa orang-orang yang beriman dan beramal saleh akan kekal di dalam surga mengecap kenikmatan hidup di dalamnya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4397,
                    "inSurah": 72
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَتِلْكَ الْجَنَّةُ الَّتِي أُورِثْتُمُوهَا بِمَا كُنتُمْ تَعْمَلُونَ",
                    "transliteration": {
                        "en": "Wa tilkal jannatul lateee ooristumoohaa bimaa kuntum ta'maloon"
                    }
                },
                "translation": {
                    "en": "And that is Paradise which you are made to inherit for what you used to do.",
                    "id": "Dan itulah surga yang diwariskan kepada kamu disebabkan amal perbuatan yang telah kamu kerjakan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4397",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4397.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4397.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan itulah surga dengan segala ke nikmatan yang kamu dapatkan di dalamnya yang di wariskan atau di anugerahkan kepada kamu di sebabkan karena amal-amal perbuatan baik yang senantiasa telah kamu kerjakan sewaktu kamu berada di dunia dahulu.",
                        "long": "Demikianlah surga yang akan diperoleh oleh orang-orang yang beriman sebagai balasan keimanan dan amal saleh yang telah mereka lakukan. Orang-orang yang beriman dan beramal saleh itu masuk surga, semata-mata karena rahmat Allah dan karunia-Nya. Karena iman dan amal yang dilakukan orang mukmin itu berbeda-beda, maka mereka akan menerima balasan yang berbeda-beda pula. Orang yang paling baik iman dan amalnya akan ditempatkan di dalam surga yang paling tinggi pula derajatnya, dan orang yang kurang iman dan amalnya akan ditempatkan di surga yang kurang pula derajatnya.\n\nAbu Hurairah meriwayatkan bahwa Rasulullah saw bersabda, \"Tidak ada seorang pun melainkan mempunyai sebuah tempat di dalam surga dan sebuah tempat di dalam neraka. Maka tempat orang Mukmin di dalam neraka diwariskan kepada orang kafir, dan tempat orang kafir di dalam surga diwariskan kepada orang Mukmin. Demikianlah yang dimaksud dengan firman Allah, \"Dan itulah surga yang diwariskan kepada kamu . . .\" (Riwayat Ibnu Abi hatim)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4398,
                    "inSurah": 73
                },
                "meta": {
                    "juz": 25,
                    "page": 494,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَكُمْ فِيهَا فَاكِهَةٌ كَثِيرَةٌ مِّنْهَا تَأْكُلُونَ",
                    "transliteration": {
                        "en": "Lakum feehaa faakihatun kaseeratum minhaa taakuloon"
                    }
                },
                "translation": {
                    "en": "For you therein is much fruit from which you will eat.",
                    "id": "Di dalam surga itu terdapat banyak buah-buahan untukmu yang sebagiannya kamu makan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4398",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4398.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4398.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Di dalam surga itu terdapat banyak buah-buahan yang lezat rasanya dan beraneka macam rupanya. Semua itu di siapkan untukmu, namun hanya sebagiannya yang dapat kamu makan karena begitu banyaknya sehingga kamu tidak mampu menghabiskannya.",
                        "long": "Dalam ayat ini diterangkan macam-macam buah-buahan yang akan diperoleh oleh orang-orang yang beriman di dalam surga. Mereka akan memperoleh buah-buahan yang tidak terhingga banyak dan jenisnya dengan bermacam-macam rasa. Mereka dapat memakannya pada waktu, tempat, dan keadaan yang mereka kehendaki."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4399,
                    "inSurah": 74
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّ الْمُجْرِمِينَ فِي عَذَابِ جَهَنَّمَ خَالِدُونَ",
                    "transliteration": {
                        "en": "Innal mujrimeena fee 'azaabi jahannama khaalidoon"
                    }
                },
                "translation": {
                    "en": "Indeed, the criminals will be in the punishment of Hell, abiding eternally.",
                    "id": "Sungguh, orang-orang yang berdosa itu kekal di dalam azab neraka Jahanam."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4399",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4399.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4399.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Apa yang telah di sebutkan pada ayat-ayat sebelumnya merupakan balasan bagi orang-orang yang beriman, bertakwa, dan menyerahkan diri secara tulus kepada Allah. Sebaliknya, pada ayat-ayat berikut digambarkan balasan bagi orang-orang yang berdosa. Sungguh, orang-orang yang berdosa itu, yakni yang melanggar aturan-aturan Allah, kekal di dalam azab neraka Jahanam sebagai balasan atas amal jahat yang mereka lakukan.",
                        "long": "Ayat ini menerangkan bahwa orang-orang yang mengingkari Allah di dunia, mengerjakan larangan dan mengingkari perintah-perintah Allah, mereka akan dimasukkan ke dalam neraka Jahanam, sebagai balasan kekafiran mereka; mereka kekal di dalamnya dan tidak dapat keluar walaupun sesaat.\n\nAzab yang ditimpakan kepada orang-orang kafir itu tidak akan diringankan walau sedikit pun, sehingga mereka terus-menerus dalam kesakitan dan kebingungan. Mereka putus asa karena permohonan yang mereka ajukan kepada Allah agar mereka dibebaskan dari azab itu tidak dikabulkan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4400,
                    "inSurah": 75
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَا يُفَتَّرُ عَنْهُمْ وَهُمْ فِيهِ مُبْلِسُونَ",
                    "transliteration": {
                        "en": "Laa yufattaru 'anhum wa hum feehi mublisoon"
                    }
                },
                "translation": {
                    "en": "It will not be allowed to subside for them, and they, therein, are in despair.",
                    "id": "Tidak diringankan (azab) itu dari mereka, dan mereka berputus asa di dalamnya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4400",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4400.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4400.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Azab neraka yang di timpakan kepada mereka itu tidak akan di ringankan dan di kurangi sedikit pun dari mereka. Karena azab dan siksa yang diterimanya itu, mereka selamanya berputus asa di dalamnya karena mereka tidak dapat melepaskan diri dari siksaan itu.",
                        "long": "Ayat ini menerangkan bahwa orang-orang yang mengingkari Allah di dunia, mengerjakan larangan dan mengingkari perintah-perintah Allah, mereka akan dimasukkan ke dalam neraka Jahanam, sebagai balasan kekafiran mereka; mereka kekal di dalamnya dan tidak dapat keluar walaupun sesaat.\n\nAzab yang ditimpakan kepada orang-orang kafir itu tidak akan diringankan walau sedikit pun, sehingga mereka terus-menerus dalam kesakitan dan kebingungan. Mereka putus asa karena permohonan yang mereka ajukan kepada Allah agar mereka dibebaskan dari azab itu tidak dikabulkan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4401,
                    "inSurah": 76
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَمَا ظَلَمْنَاهُمْ وَلَٰكِن كَانُوا هُمُ الظَّالِمِينَ",
                    "transliteration": {
                        "en": "Wa maa zalamnaahum wa laakin kaanoo humuz zaalimeen"
                    }
                },
                "translation": {
                    "en": "And We did not wrong them, but it was they who were the wrongdoers.",
                    "id": "Dan tidaklah Kami menzalimi mereka, tetapi merekalah yang menzalimi diri mereka sendiri."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4401",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4401.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4401.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan dengan siksaan yang mereka dapatkan itu, tidaklah Kami menzalimi atau menganiaya mereka sedikit pun, tetapi merekalah yang menzalimi diri mereka sendiri sehingga mereka mendapatkan azab itu.",
                        "long": "Dalam ayat ini diterangkan apa sebabnya mereka ditimpa azab itu, Allah menyatakan, \"Kami tidak bermaksud menganiaya orang-orang kafir dengan mengazab mereka, karena Kami telah memberikan peringatan yang cukup kepada mereka selama hidup di dunia, tetapi mereka tidak menghiraukannya sedikit pun. Bahkan mereka mendustakan rasul-rasul yang Kami utus kepada mereka dan menganiaya para rasul itu walaupun telah dikemukakan bukti-bukti yang cukup kepada mereka. Karena tindakan mereka itulah, mereka diazab, ini berarti bahwa mereka sendirilah yang menganiaya diri mereka sendiri."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4402,
                    "inSurah": 77
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَنَادَوْا يَا مَالِكُ لِيَقْضِ عَلَيْنَا رَبُّكَ ۖ قَالَ إِنَّكُم مَّاكِثُونَ",
                    "transliteration": {
                        "en": "Wa naadaw yaa Maaliku liyaqdi 'alainaa Rabbuka qaala innakum maakisson"
                    }
                },
                "translation": {
                    "en": "And they will call, \"O Malik, let your Lord put an end to us!\" He will say, \"Indeed, you will remain.\"",
                    "id": "Dan mereka berseru, “Wahai (Malaikat) Malik! Biarlah Tuhanmu mematikan kami saja.” Dia menjawab, “Sungguh, kamu akan tetap tinggal (di neraka ini).”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4402",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4402.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4402.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ketika para pendosa itu mendapatkan siksaan yang amat pedih di dalam neraka, mereka berseru kepada Malaikat Malik yang memimpin penjaga neraka dengan berkata, “Wahai malaikat Malik! Biarlah Tuhanmu, yaitu dengan memohon kepada-Nya agar Dia mematikan kami saja karena kalau kami sudah di matikan, kami tidak akan merasakan lagi siksaan yang amat pedih ini.” Dia, yakni malaikat Malik, menjawab, “Sungguh, kamu tidak akan dimatikan oleh Allah, dan kamu akan tetap tinggal di neraka ini untuk merasakan siksaan yang amat pedih ini.”",
                        "long": "Karena beratnya siksaan yang diderita mereka, maka mereka memanggil malaikat Malik, penjaga neraka, agar malaikat itu meminta kepada Allah supaya mereka dimatikan saja, sehingga mereka terbebas dari siksaan itu, mereka mengatakan, \"Hai malaikat Malik, mohonkanlah kepada Allah agar Dia mencabut saja nyawa kami, sehingga kami terlepas atau tidak merasakan lagi siksaan ini.\" Malaikat itu menjawab, \"Tidak ada satu jalan pun bagimu untuk keluar dari neraka ini karena Allah telah memutuskan, bahwa kamu tinggal di dalam neraka selama-lamanya.\"\n\nAllah berfirman:\n\nDan orang-orang yang kafir, bagi mereka neraka Jahanam. Mereka tidak dibinasakan hingga mereka mati, dan tidak diringankan dari mereka azabnya. Demikianlah Kami membalas setiap orang yang sangat kafir. (Fathir/35: 36)\n\nDalam ayat lain:\n\nDan orang-orang yang celaka (kafir) akan menjauhinya,(yaitu) orang yang akan memasuki api yang besar (neraka), selanjutnya dia di sana tidak mati dan tidak (pula) hidup. (al-A'la/87: 11-13)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4403,
                    "inSurah": 78
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "لَقَدْ جِئْنَاكُم بِالْحَقِّ وَلَٰكِنَّ أَكْثَرَكُمْ لِلْحَقِّ كَارِهُونَ",
                    "transliteration": {
                        "en": "Laqad ji'naakum bilhaqqi wa laakinna aksarakum lilhaqqi kaarihoon"
                    }
                },
                "translation": {
                    "en": "We had certainly brought you the truth, but most of you, to the truth, were averse.",
                    "id": "Sungguh, Kami telah datang membawa kebenaran kepada kamu tetapi kebanyakan di antara kamu benci pada kebenaran itu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4403",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4403.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4403.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ayat-ayat yang lalu menggambarkan siksaan yang amat pedih yang di rasakan di dalam neraka oleh orang-orang yang kafir terhadap wahyu-wahyu Allah. Ayat berikut menggambarkan pengingkaran orang-orang Mekah terhadap kebenaran yang dibawa oleh Rasulullah. Allah berfirman, “Sesungguhnya Kami melalui rasul yang telah Kami utus dan wahyu-wahyu yang Kami turunkan benar-benar telah membawa kebenaran yang amat sempurna kepada kamu yang bersumber dari Kami, tetapi kebanyakan di antara kamu benar-benar benci pada kebenaran itu sehingga kamu tidak mau mempercayainya.",
                        "long": "Kepada orang-orang yang sedang diazab dalam neraka itu dikatakan, \"Hai orang-orang kafir, sesungguhnya Kami telah menerangkan semua yang benar dan jalan yang lurus dengan perantaraan rasul-rasul dan kitab-kitab Kami waktu kamu di dunia dahulu. Akan tetapi kamu tidak menerima kebenaran itu, bahkan kamu membenci kebenaran itu serta orang-orang yang mengikuti kebenaran itu. Karena itu, celakalah dirimu sekarang dan sesalilah sendiri, pada saat semua penyesalan tidak berguna lagi dan tobat telah pula tertutup."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4404,
                    "inSurah": 79
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمْ أَبْرَمُوا أَمْرًا فَإِنَّا مُبْرِمُونَ",
                    "transliteration": {
                        "en": "Am abramooo amran fainnaa mubrimoon"
                    }
                },
                "translation": {
                    "en": "Or have they devised [some] affair? But indeed, We are devising [a plan].",
                    "id": "Ataukah mereka telah merencanakan suatu tipu daya (jahat), maka sesungguhnya Kami telah berencana (mengatasi tipu daya mereka)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4404",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4404.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4404.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Penduduk Mekah itu sebenarnya tidak hanya membenci kebenaran yang di bawa oleh rasul Kami itu, tetapi bahkan mereka telah merencanakan dengan mantap suatu tipu daya jahat untuk membendung dan menghalangi penyebaran ajaran Islam, menganiaya para pembela agama itu, dan bahkan merencanakan pembunuhan terhadap rasul Kami. Apa yang mereka rencanakan itu tidak akan Kami biarkan, maka untuk itu sesungguhnya Kami telah berencana dengan sangat baik dan rapi untuk mengalahkan dan mengatasi semua tipu daya mereka.”",
                        "long": "Dalam ayat ini, diterangkan sebab orang-orang kafir dimasukkan ke dalam neraka yaitu karena mereka selama hidup di dunia selalu berusaha menolak semua kebenaran dengan melakukaan bermacam tipu daya. Maka Allah menghancurkan dan menggagalkan semua tipu daya mereka itu.\n\nDalam ayat yang lain Allah berfirman:\n\nDan mereka membuat tipu daya, dan Kami pun menyusun tipu daya, sedang mereka tidak menyadari. (an-Naml/27: 50)\n\nFirman Allah:\n\nAtaukah mereka hendak melakukan tipu daya? Tetapi orang-orang yang kafir itu, justru merekalah yang terkena tipu daya. (ath-thur/52: 42)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4405,
                    "inSurah": 80
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمْ يَحْسَبُونَ أَنَّا لَا نَسْمَعُ سِرَّهُمْ وَنَجْوَاهُم ۚ بَلَىٰ وَرُسُلُنَا لَدَيْهِمْ يَكْتُبُونَ",
                    "transliteration": {
                        "en": "Am yahsaboona annaa laa nasma'u sirrahum wa najwaahum; balaa wa Rusulunaa ladaihim yaktuboon"
                    }
                },
                "translation": {
                    "en": "Or do they think that We hear not their secrets and their private conversations? Yes, [We do], and Our messengers are with them recording.",
                    "id": "Ataukah mereka mengira, bahwa Kami tidak mendengar rahasia dan bisikan-bisikan mereka? Sebenarnya (Kami mendengar), dan utusan-utusan Kami (malaikat) selalu mencatat di sisi mereka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4405",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4405.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4405.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dalam keadaan demikian, Allah mengajukan pertanyaan yang berisi kecaman atas rencana mereka dengan mengatakan, “Apakah mereka mengira bahwa Kami tidak mendengar rahasia dan bisikan-bisikan mereka? Apa yang mereka duga itu merupakan suatu kekeliruan yang amat besar karena sebenarnya Kami mendengar semua yang mereka rencanakan itu, dan utusan-utusan Kami, yakni malaikat yang mencatat amal baik dan buruk selalu mencatat di sisi mereka apa yang mereka niatkan, katakan, dan kerjakan.",
                        "long": "Diriwayatkan oleh Ibnu Jarir bahwa Muhammad bin Ka'ab al-Quradzi berkata, \"Ketika tiga orang berada di antara Ka'bah dan kelambunya, dua orang dari suku Quraisy dan seorang dari suku Saqafi, maka salah seorang dari mereka berkata, \"Bagaimanakah pendapatmu, apakah Allah mendengar pembicaraan kita?\" Orang yang kedua menjawab, \"Apabila kamu keraskan suaramu, Dia mendengarnya, sedangkan apabila engkau berbisik, Dia tidak mendengarnya.\" Orang yang ketiga berkata, \"Jika Dia mendengar bila kamu keraskan suaramu, tentu Dia mendengar pula, bila kamu berbisik.\" Maka turunlah ayat ini.\n\nMelihat sikap dan tindakan orang-orang kafir semasa hidup di dunia, mereka seakan-akan tidak percaya bahwa Allah mengetahui segala sesuatu; maka dikatakan tentang mereka. \"Apakah mereka menyangka bahwa Kami tidak mendengar bisikan-bisikan hati mereka, dan tidak mengetahui semua yang mereka perbincangkan secara rahasia dalam menyusun tipu daya itu?\"\n\nDengan ayat ini Allah menegaskan dengan mengatakan, \"Kami mengetahui segala yang mereka rencanakan dan mendengar semua bisikan-bisikan mereka, tidak ada sesuatu pun yang tidak kami ketahui, di samping itu, malaikat hafadzah selalu menulis dan mencatat semua perilaku mereka baik berupa perkataan maupun perbuatan. Firman Allah:\n\n(Ingatlah) ketika dua malaikat men-catat (perbuatannya), yang satu duduk di sebelah kanan dan yang lain di sebelah kiri. Tidak ada suatu kata yang diucapkannya melainkan ada di sisinya malaikat pengawas yang selalu siap (mencatat). (Qaf/50: 17-18)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4406,
                    "inSurah": 81
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قُلْ إِن كَانَ لِلرَّحْمَٰنِ وَلَدٌ فَأَنَا أَوَّلُ الْعَابِدِينَ",
                    "transliteration": {
                        "en": "Qul in kaana lir Rahmaani walad; fa-ana awwalul 'aabideen"
                    }
                },
                "translation": {
                    "en": "Say, [O Muhammad], \"If the Most Merciful had a son, then I would be the first of [his] worshippers.\"",
                    "id": "Katakanlah (Muhammad), “Jika benar Tuhan Yang Maha Pengasih mempunyai anak, maka akulah orang yang mula-mula memuliakan  (anak itu)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4406",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4406.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4406.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Pada ayat-ayat yang lalu, Allah menggambarkan pengingkaran orang-orang kafir Mekah terhadap kebenaran yang di bawa oleh Nabi Muhammad. Pada ayat ini, Allah menggambarkan bantahan terhadap kepercayaan mereka bahwa Tuhan mempunyai anak. “Katakanlah, wahai Muhammad, \"Jika benar dan terbukti bahwa Tuhan Yang Maha Pengasih mempunyai anak, seperti yang kamu duga, maka akulah orang yang mula-mula memuliakan anak itu.\" Akan tetapi, ternyata apa yang mereka duga itu tidak terbukti.",
                        "long": "Allah memerintahkan kepada Nabi Muhammad saw untuk mengatakan kepada orang-orang musyrik Mekah, bahwa seandainya ar-Rahman, Tuhan Yang Maha Pemurah mempunyai anak dan mereka dapat membuktikan kebenarannya dengan alasan-alasan yang kuat, maka Nabi Muhammad adalah orang pertama yang mengakui dan mengagungkan-Nya, sebagaimana orang memuliakan anak seorang raja karena memuliakan bapaknya. Pendapat ini berdasar karena bahwa anak tuhan merupakan bagian dari Tuhan, karena itu kedudukan putranya itu sama dengan kedudukan-Nya sendiri.\n\nPengertian di atas menunjukkan suatu penegasan bahwa hal tersebut sangat mustahil bagi Allah. Firman Allah:\n\nSekiranya Allah hendak mengambil anak, tentu Dia akan memilih apa yang Dia kehendaki dari apa yang telah diciptakan-Nya. Mahasuci Dia. Dialah Allah Yang Maha Esa, Mahaperkasa. (az-Zumar/39: 4)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4407,
                    "inSurah": 82
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "سُبْحَانَ رَبِّ السَّمَاوَاتِ وَالْأَرْضِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ",
                    "transliteration": {
                        "en": "Subhaana Rabbis samaawaati wal ardi Rabbil Arshi 'ammaa yasifoon"
                    }
                },
                "translation": {
                    "en": "Exalted is the Lord of the heavens and the earth, Lord of the Throne, above what they describe.",
                    "id": "Mahasuci Tuhan pemilik langit dan bumi, Tuhan pemilik ‘Arsy, dari apa yang mereka sifatkan itu.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4407",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4407.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4407.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Mahasuci Tuhan pemelihara langit dan bumi, Tuhan pemilik ‘Arsy, dari segala kekurangan, Mahasuci Allah Yang Maha Esa dari apa yang mereka sifatkan itu.",
                        "long": "Ayat ini menyatakan kesucian Allah dari anggapan orang-orang musyrik itu dengan menyatakan, \"Mahasuci Allah yang memiliki langit dan bumi beserta semua yang ada di dalamnya, Dia memiliki 'Arsy yang agung, mustahil bagi Allah mempunyai seorang anak seperti yang dikatakan mereka.\""
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4408,
                    "inSurah": 83
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَذَرْهُمْ يَخُوضُوا وَيَلْعَبُوا حَتَّىٰ يُلَاقُوا يَوْمَهُمُ الَّذِي يُوعَدُونَ",
                    "transliteration": {
                        "en": "Fazarhum yakhoodoo wa yal'aboo hattaa yulaaqoo Yawmahumul lazee yoo'adoon"
                    }
                },
                "translation": {
                    "en": "So leave them to converse vainly and amuse themselves until they meet their Day which they are promised.",
                    "id": "Maka biarkanlah mereka tenggelam (dalam kesesatan) dan bermain-main sampai mereka menemui hari yang dijanjikan kepada mereka."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4408",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4408.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4408.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Jika mereka tetap bersikeras dengan kesesatan itu, maka biarkanlah mereka, wahai Nabi Muhammad, tenggelam dalam kesesatannya dan bermain-main dengan kesesatan yang mereka yakini itu sampai mereka menemui hari yang di janjikan kepada mereka, yakni hari Kiamat di mana mereka akan mempertanggungjawabkan semua amal yang telah mereka lakukan.",
                        "long": "Karena orang-orang musyrik itu tidak mau mengubah kepercayaan mereka yang batil dan sesat itu, maka Allah menyampaikan pesan kepada Rasulullah, \"Ya Muhammad, biarkanlah orang-orang yang membuat dusta tentang Allah dengan mengatakan bahwa Dia mempunyai anak, membincangkan kebohongan mereka dan biarkanlah mereka hidup bersenang-senang dalam kekafiran di dunia ini, sampai datang azab yang dijanjikan Allah kepada mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4409,
                    "inSurah": 84
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَهُوَ الَّذِي فِي السَّمَاءِ إِلَٰهٌ وَفِي الْأَرْضِ إِلَٰهٌ ۚ وَهُوَ الْحَكِيمُ الْعَلِيمُ",
                    "transliteration": {
                        "en": "Wa Huwal lazee fissamaaa'i Ilaahunw wa fil ardi Ilaah; wa Huwal Hakeemul'Aleem"
                    }
                },
                "translation": {
                    "en": "And it is Allah who is [the only] deity in the heaven, and on the earth [the only] deity. And He is the Wise, the Knowing.",
                    "id": "Dan Dialah Tuhan (yang disembah) di langit dan Tuhan (yang disembah) di bumi dan Dialah Yang Mahabijaksana, Maha Mengetahui."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4409",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4409.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4409.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan Dialah Tuhan Yang Mahasuci dari segala kekurangan, Dialah Tuhan yang disembah di langit dan Dia pulalah Tuhan yang disembah di bumi dan Dialah Yang Mahabijaksana terhadap semua yang di ciptakan-Nya, Maha Mengetahui terhadap segala sesuatu yang nyata maupun yang tersembunyi.",
                        "long": "Dalam ayat ini ditegaskan lagi kemustahilan Allah mempunyai anak dengan menyatakan, \"Hanya Dialah yang disembah oleh penghuni langit dan penghuni bumi, hanya Dia sajalah yang berhak disembah, tidak ada yang lain, karena Dialah Tuhan yang segala tindakan-Nya mempunyai hikmah dalam menciptakan dan melakukan sesuatu sesuai dengan sifat, guna dan faedahnya, dan hanya Dia pula yang Maha Mengetahui keadaan mereka, baik yang nampak maupun yang tidak nampak, dan Dia Maha Mengetahui segala isi hati manusia.\n\nDalam ayat ini disebutkan dua macam sifat Allah yaitu hakim dan 'alim. Bila Allah mempunyai sifat hakim dan 'alim, tentulah putra-Nya mempunyai sifat-sifat itu pula. Namun jika diperhatikan sifat-sifat yang dipunyai oleh yang mereka katakan anak Tuhan itu, ternyata sifatnya berbeda dengan sifat-sifat Tuhan. Sebagaimana patung-patung al-Lata, al-Uzza dan Manat yang disembah oleh orang-orang musyrik Mekah, semuanya adalah benda-benda mati yang tidak dapat berbuat dan mengetahui sesuatu pun. Demikian pula Nabi Isa yang dipercayai sebagai anak Allah oleh orang Nasrani, padahal orang Nasrani sendiri mengakui bahwa Isa itu kadang-kadang tidak mengetahui dan tidak mempunyai hikmah dalam melakukan segala tindakan-tindakannya. Bukanlah Isa pernah menangis ketika mendengar berita terbunuhnya seseorang yang tidak bersalah sehingga ia minta kepada pengikut-pengikutnya supaya menunjukkan kuburan orang yang terbunuh itu. Sifat yang demikian tentu tidak wajar pada seseorang yang diyakini sebagai putra Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4410,
                    "inSurah": 85
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَتَبَارَكَ الَّذِي لَهُ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ وَمَا بَيْنَهُمَا وَعِندَهُ عِلْمُ السَّاعَةِ وَإِلَيْهِ تُرْجَعُونَ",
                    "transliteration": {
                        "en": "Wa tabaarakal lazee lahoo mulkus samaawaati wal ardi wa maa bainahumaa wa 'indahoo 'ilmus Saa'ati wa ilaihi turja'oon"
                    }
                },
                "translation": {
                    "en": "And blessed is He to whom belongs the dominion of the heavens and the earth and whatever is between them and with whom is knowledge of the Hour and to whom you will be returned.",
                    "id": "Dan Mahasuci (Allah) yang memiliki kerajaan langit dan bumi, dan apa yang ada di antara keduanya; dan di sisi-Nyalah ilmu tentang hari Kiamat dan hanya kepada-Nyalah kamu dikembalikan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4410",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4410.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4410.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan Mahasuci Allah yang keberkatan dan kebajikan-Nya amat banyak, Dia merupakan pemilik kerajaan langit dan bumi, dan juga pemilik apa yang ada di antara keduanya, baik yang diketahui oleh manusia maupun yang tersembunyi dari mereka. Dan, di sisi-Nyalah ilmu tentang segala keadaan yang menyangkut hari Kiamat dan hanya kepada-Nyalah kamu di kembalikan untuk mempertanggungjawabkan semua amal yang telah di lakukan.",
                        "long": "Mahasuci Allah yang memiliki dan menguasai kerajaan langit dan bumi beserta semua isinya, dan alam-alam lain yang tidak atau belum diketahui hakikat dan keadaannya. Dialah yang mempunyai pengetahuan tentang hari Kiamat. Tidak seorang pun yang mengetahui kapan terjadinya hari Kiamat itu. Kepada-Nyalah kembali segala sesuatu, kemudian Dia membalas semua amal perbuatan manusia dengan balasan yang setimpal."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4411,
                    "inSurah": 86
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَا يَمْلِكُ الَّذِينَ يَدْعُونَ مِن دُونِهِ الشَّفَاعَةَ إِلَّا مَن شَهِدَ بِالْحَقِّ وَهُمْ يَعْلَمُونَ",
                    "transliteration": {
                        "en": "Wa laa yamlikul lazeena yad'oona min doonihish shafaa'ata illaa man shahida bilhaqqi wa hum ya'lamoon"
                    }
                },
                "translation": {
                    "en": "And those they invoke besides Him do not possess [power of] intercession; but only those who testify to the truth [can benefit], and they know.",
                    "id": "Dan orang-orang yang menyeru kepada selain Allah tidak mendapat syafaat (pertolongan di akhirat); kecuali orang yang mengakui yang hak (tauhid) dan mereka meyakini."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4411",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4411.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4411.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan Allah menegaskan bahwa orang-orang yang menyeru kepada selain Allah dan menyembah selain-Nya, baik berhala, maupun malaikat, manusia, atau siapa pun tidak mendapat sedikit pun syafaat, yakni pertolongan di akhirat, kecuali orang yang menyaksikan dan mengakui yang hak (tauhid), yakni yang mengesakan Allah dan mereka meyakini apa yang mereka saksikan dan akui itu.",
                        "long": "Ayat ini menerangkan bahwa semua berhala dan dewa-dewa disembah oleh orang-orang musyrik untuk mendapat syafaatnya, padahal berhala itu tidak kuasa berbuat dan tidak memiliki sesuatu pun, bahkan mereka itu sendiri dikuasai dan dimiliki oleh penyembah-penyembahnya. Mungkinkah mereka memberikan syafaat dalam keadaan demikian? Adapun orang-orang yang mengucapkan kalimat tauhid, memahami serta meyakininya, ia berjalan sesuai dengan petunjuk Allah, seperti malaikat, Nabi Isa, maka syafaat mereka berfaedah di sisi Allah, dan Allah akan memberikan syafaat kepada orang-orang yang pantas menerimanya.\n\nSa'id bin Jubair berkata, \"Maksud ayat ini ialah: berhala-berhala itu tidak memberi syafaat sedikit pun, yang bisa memberi syafaat itu hanyalah orang yang mengakui kebenaran, beriman kepada Allah berdasarkan ilmu yang dipelajari, dan pandangannya yang jauh."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4412,
                    "inSurah": 87
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَئِن سَأَلْتَهُم مَّنْ خَلَقَهُمْ لَيَقُولُنَّ اللَّهُ ۖ فَأَنَّىٰ يُؤْفَكُونَ",
                    "transliteration": {
                        "en": "Wa la'in sa altahum man khalaqahum la yaqoolun nallaahu fa annaa yu'fakoon"
                    }
                },
                "translation": {
                    "en": "And if you asked them who created them, they would surely say, \"Allah.\" So how are they deluded?",
                    "id": "Dan jika engkau bertanya kepada mereka, “Siapakah yang menciptakan mereka, niscaya mereka menjawab, “Allah,” jadi bagaimana mereka dapat dipalingkan (dari menyembah Allah),”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4412",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4412.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4412.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan jika engkau, wahai Nabi Muhammad, bertanya kepada mereka, yakni kaum musyrik Mekah mengenai siapakah yang menciptakan mereka, niscaya mereka menjawab bahwa yang menciptakan mereka adalah Allah. Jadi, bagaimana mereka dapat dipalingkan dari menyembah Allah pada hal mereka mengakui Allah sebagai pencipta mereka, dan Allah mengetahui ucapan mereka itu dan,",
                        "long": "Dalam ayat ini diterangkan bahwa perkataan dan perbuatan orang-orang musyrik itu saling bertentangan. Jika ditanyakan kepada mereka, siapakah yang menciptakan seluruh makhluk ini, maka mereka menjawab dan mengakui, \"Hanya Allah sajalah yang menciptakannya, tidak berserikat dengan seorang pun.\" Mereka tidak sanggup membantah kenyataan itu, tetapi perbuatan dan tindakan mereka membuktikan bahwa mereka mempersekutukan Allah. Mengapa orang-orang musyrik itu berpaling sehingga menyembah selain Allah atau hanya menyembah Allah saja sesuai dengan pengakuan mereka. Hal tersebut menunjukkan kebodohan mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4413,
                    "inSurah": 88
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقِيلِهِ يَا رَبِّ إِنَّ هَٰؤُلَاءِ قَوْمٌ لَّا يُؤْمِنُونَ",
                    "transliteration": {
                        "en": "Wa qeelihee yaa Rabbi inna haa'ulaaa'i qawmul laa yu'minoon"
                    }
                },
                "translation": {
                    "en": "And [Allah acknowledges] his saying, \"O my Lord, indeed these are a people who do not believe.\"",
                    "id": "dan (Allah mengetahui) ucapannya (Muhammad), “Ya Tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4413",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4413.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4413.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "ucapannya, yakni ucapan Nabi Muhammad ketika mengadu kepada Allah dengan mengatakan, “Ya Tuhanku, sesungguhnya mereka itu adalah kaum yang tidak beriman kepada-Mu dan kepada apa yang diturunkan untuk mereka.",
                        "long": "Muhammad saw berkata, \"Wahai Tuhanku, sesungguhnya orang-orang yang aku seru untuk mengikuti ajaranmu sesuai dengan perintahmu adalah orang-orang yang telah terkunci mati hatinya sehingga mereka tidak mau beriman.\"Firman Allah:\n\nSesungguhnya orang-orang kafir, sama saja bagi mereka, engkau (Muhammad) beri peringatan atau tidak engkau beri peringatan, mereka tidak akan beriman. (al-Baqarah/2: 6)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4414,
                    "inSurah": 89
                },
                "meta": {
                    "juz": 25,
                    "page": 495,
                    "manzil": 6,
                    "ruku": 430,
                    "hizbQuarter": 198,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَاصْفَحْ عَنْهُمْ وَقُلْ سَلَامٌ ۚ فَسَوْفَ يَعْلَمُونَ",
                    "transliteration": {
                        "en": "Fasfah 'anhum wa qul salaam; fasawfa ya'lamoon"
                    }
                },
                "translation": {
                    "en": "So turn aside from them and say, \"Peace.\" But they are going to know.",
                    "id": "Maka berpalinglah dari mereka dan katakanlah, “Salam (selamat tinggal).” Kelak mereka akan mengetahui (nasib mereka yang buruk)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4414",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4414.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4414.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah menyambut pengaduan Nabi Muhammad dengan berfirman, “Maka berpalinglah dari mereka, wahai Nabi Muhammad, dan katakanlah kepada mereka, ‘Salam (selamat tinggal).’ Kelak di dunia ini atau di akhirat nanti, mereka akan mengetahui nasib mereka yang buruk, berupa azab yang amat pedih.1. Hà Mìm",
                        "long": "Setelah Allah mendengar ucapan Rasulullah saw itu, Dia berfirman, \"Hai Muhammad, berpalinglah engkau dari mereka, janganlah engkau berputus asa karena keangkuhan mereka untuk beriman, janganlah engkau melayani perkataan-perkataan mereka yang buruk itu, dan tindakan-tindakan yang menghinakanmu dan pengikutmu, maafkanlah mereka, kelak mereka akan mengakui kesalahannya dan merasakan akibat kekafiran mereka.\"\n\nAyat ini merupakan janji Allah kepada kaum Muslimin, dan janji itu ditepati-Nya, dengan penaklukan kota Mekah. Peristiwa tersebut menyebabkan manusia masuk Islam secara berbondong-bondong. Maka tersebarlah agama Islam ke seluruh penjuru dunia dalam waktu yang singkat.\n\nAllah berfirman:\n\nApabila telah datang pertolongan Allah dan kemenangan, dan engkau melihat manusia berbondong-bondong masuk agama Allah, maka bertasbihlah dengan memuji Tuhanmu dan mohonlah ampunan kepada-Nya. Sungguh, Dia Maha Penerima tobat. (an-Nasr/110: 1-3)"
                    }
                }
            }
        ]
    }
}