{
    "code": 200,
    "status": "OK.",
    "message": "Success fetching surah.",
    "data": {
        "number": 45,
        "sequence": 65,
        "numberOfVerses": 37,
        "name": {
            "short": "الجاثية",
            "long": "سورة الجاثية",
            "transliteration": {
                "en": "Al-Jaathiya",
                "id": "Al-Jasiyah"
            },
            "translation": {
                "en": "Crouching",
                "id": "Berlutut"
            }
        },
        "revelation": {
            "arab": "مكة",
            "en": "Meccan",
            "id": "Makkiyyah"
        },
        "tafsir": {
            "id": "Surat Al Jaatsiyah terdiri atas 37 ayat, termasuk golongan surat-surat Makkiyyah, diturunkan sesudah surat Ad Dukhaan. Dinamai dengan Al Jaatsiyah (yang berlutut) diambil dari perkataan Jaatsiyah yang terdapat pada ayat 28 surat ini. Ayat tersebut menerangkan tentang keadaan manusia pada hari kiamat, yaitu semua manusia dikumpulkan ke hadapan mahkamah Allah Yang Maha Tinggi yang memberikan keputusan terhadap perbuatan yang telah mereka lakukan di dunia. Pada hari itu semua manusia berlutut di hadapan Allah. Dinamai juga dengan Asy Syari'ah diambil dari perkataan Syari'ah (Syari'at) yang terdapat pada ayat 18 surat ini."
        },
        "preBismillah": {
            "text": {
                "arab": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
                "transliteration": {
                    "en": "Bismillaahir Rahmaanir Raheem"
                }
            },
            "translation": {
                "en": "In the name of Allah, the Entirely Merciful, the Especially Merciful.",
                "id": "Dengan nama Allah Yang Maha Pengasih, Maha Penyayang."
            },
            "audio": {
                "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/1",
                "secondary": [
                    "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1.mp3",
                    "https://cdn.islamic.network/quran/audio/64/ar.alafasy/1.mp3"
                ]
            }
        },
        "verses": [
            {
                "number": {
                    "inQuran": 4474,
                    "inSurah": 1
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "حم",
                    "transliteration": {
                        "en": "Haa-Meeem"
                    }
                },
                "translation": {
                    "en": "Ha, Meem.",
                    "id": "Ha Mim"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4474",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4474.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4474.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Hà Mìm",
                        "long": "Ayat pertama terdiri dari huruf-huruf hijaiah, sebagaimana terdapat pada permulaan beberapa surah Al-Qur'an. Para ahli tafsir berbeda pendapat tentang maksud huruf-huruf itu. Selanjutnya dipersilahkan menelaah masalah ini pada \"Al-Qur'an dan Tafsirnya\" jilid I yaitu tafsir ayat pertama Surah al-Baqarah.\"\n\nPada ayat berikutnya Allah Yang Mahaperkasa dan Mahabijaksana menjelaskan bahwa kitab Al-Qur'an yang sempurna itu diturunkan kepada Rasul-Nya, Muhammad saw. Disebutkan sifat Allah \"Mahaperkasa\" dalam ayat ini agar tergambar dalam pikiran orang yang membaca atau mendengarnya, bahwa yang menurunkan kitab Al-Qur'an itu ialah Zat yang mempunyai kekuasaan yang tidak terbatas, tidak dapat ditandingi dan tidak dapat dibantah kehendak-Nya. Keinginan dan kehendak-Nya pasti terlaksana sesuai dengan rencana-Nya, tidak ada kekuasaan lain yang mampu menghalang-halangi dan mengubahnya.\n\nDemikian pula ditonjolkan sifat \"Mahabijaksana\" dalam ayat ini agar dipahami, bahwa dalam melaksanakan kehendak dan kekuasaan-Nya itu, Dia melaksanakan keadilan yang merata pada setiap makhluk-Nya. Dia bertindak, menciptakan dan melaksanakan sesuatu sesuai dengan guna dan faedahnya. Kebijaksanaan ini dapat disaksikan pada seluruh tindakan dan semua makhluk yang diciptakan-Nya, dari tingkat yang paling sederhana sampai ke tingkat yang paling sempurna.\n\nPada tumbuh-tumbuhan, binatang, manusia, dan susunan serta ketentuan-ketentuan yang berlaku pada tata surya, orang dapat mengetahui bahwa pada tiap-tiap makhluk ada hukum-hukum dan ketentuan-ketentuan yang tidak dapat dilanggar; semuanya harus tunduk dan patuh baik secara sukarela maupun terpaksa. Tidak satu makhluk pun yang melanggar dan menyalahi hukum dan ketentuan yang telah ditetapkan Allah baginya, kecuali akan mengakibatkan kerusakan dan kehancuran.\n\nApabila orang mau menggunakan pikirannya yang jernih dan sehat tentu akan mengakui kekuasaan dan kebijaksanaan Allah terhadap semua makhluk-Nya. Dan apabila ia telah yakin akan hal itu, tentu ia akan menerima dan mengamalkan Al-Qur'an sebagai wahyu dan petunjuk Allah. Hal ini juga berarti bahwa diturunkannya Al-Qur'an kepada Nabi Muhammad saw dalam bahasa Arab, disampaikan untuk pertama kalinya kepada orang-orang Quraisy, kemudian baru tersebar ke seluruh penjuru dunia, ada hikmatnya sesuai dengan guna dan faedahnya. Hikmah, guna dan faedahnya itu diketahui manusia dengan perantaraan Al-Qur'an sendiri. Ada yang diketahui berdasarkan pengetahuan dan pengalaman yang dipunyai oleh seseorang, dan ada yang belum diketahui oleh manusia, karena Yang Mahatahu hanyalah Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4475,
                    "inSurah": 2
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "تَنزِيلُ الْكِتَابِ مِنَ اللَّهِ الْعَزِيزِ الْحَكِيمِ",
                    "transliteration": {
                        "en": "Tanzeelul Kitaabi minal laahil 'Azeezil Hakeem"
                    }
                },
                "translation": {
                    "en": "The revelation of the Book is from Allah, the Exalted in Might, the Wise.",
                    "id": "Kitab (ini) diturunkan dari Allah Yang Mahaperkasa, Mahabijaksana."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4475",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4475.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4475.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kitab, yaitu Al-Qur’an ini diturunkan secara berangsur-angsur dari Allah Yang Mahaperkasa terhadap ketentuan-Nya, lagi Mahabijaksana terhadap semua keputusan dan ketentuan-Nya.",
                        "long": "Ayat pertama terdiri dari huruf-huruf hijaiah, sebagaimana terdapat pada permulaan beberapa surah Al-Qur'an. Para ahli tafsir berbeda pendapat tentang maksud huruf-huruf itu. Selanjutnya dipersilahkan menelaah masalah ini pada \"Al-Qur'an dan Tafsirnya\" jilid I yaitu tafsir ayat pertama Surah al-Baqarah.\"\n\nPada ayat berikutnya Allah Yang Mahaperkasa dan Mahabijaksana menjelaskan bahwa kitab Al-Qur'an yang sempurna itu diturunkan kepada Rasul-Nya, Muhammad saw. Disebutkan sifat Allah \"Mahaperkasa\" dalam ayat ini agar tergambar dalam pikiran orang yang membaca atau mendengarnya, bahwa yang menurunkan kitab Al-Qur'an itu ialah Zat yang mempunyai kekuasaan yang tidak terbatas, tidak dapat ditandingi dan tidak dapat dibantah kehendak-Nya. Keinginan dan kehendak-Nya pasti terlaksana sesuai dengan rencana-Nya, tidak ada kekuasaan lain yang mampu menghalang-halangi dan mengubahnya.\n\nDemikian pula ditonjolkan sifat \"Mahabijaksana\" dalam ayat ini agar dipahami, bahwa dalam melaksanakan kehendak dan kekuasaan-Nya itu, Dia melaksanakan keadilan yang merata pada setiap makhluk-Nya. Dia bertindak, menciptakan dan melaksanakan sesuatu sesuai dengan guna dan faedahnya. Kebijaksanaan ini dapat disaksikan pada seluruh tindakan dan semua makhluk yang diciptakan-Nya, dari tingkat yang paling sederhana sampai ke tingkat yang paling sempurna.\n\nPada tumbuh-tumbuhan, binatang, manusia, dan susunan serta ketentuan-ketentuan yang berlaku pada tata surya, orang dapat mengetahui bahwa pada tiap-tiap makhluk ada hukum-hukum dan ketentuan-ketentuan yang tidak dapat dilanggar; semuanya harus tunduk dan patuh baik secara sukarela maupun terpaksa. Tidak satu makhluk pun yang melanggar dan menyalahi hukum dan ketentuan yang telah ditetapkan Allah baginya, kecuali akan mengakibatkan kerusakan dan kehancuran.\n\nApabila orang mau menggunakan pikirannya yang jernih dan sehat tentu akan mengakui kekuasaan dan kebijaksanaan Allah terhadap semua makhluk-Nya. Dan apabila ia telah yakin akan hal itu, tentu ia akan menerima dan mengamalkan Al-Qur'an sebagai wahyu dan petunjuk Allah. Hal ini juga berarti bahwa diturunkannya Al-Qur'an kepada Nabi Muhammad saw dalam bahasa Arab, disampaikan untuk pertama kalinya kepada orang-orang Quraisy, kemudian baru tersebar ke seluruh penjuru dunia, ada hikmatnya sesuai dengan guna dan faedahnya. Hikmah, guna dan faedahnya itu diketahui manusia dengan perantaraan Al-Qur'an sendiri. Ada yang diketahui berdasarkan pengetahuan dan pengalaman yang dipunyai oleh seseorang, dan ada yang belum diketahui oleh manusia, karena Yang Mahatahu hanyalah Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4476,
                    "inSurah": 3
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّ فِي السَّمَاوَاتِ وَالْأَرْضِ لَآيَاتٍ لِّلْمُؤْمِنِينَ",
                    "transliteration": {
                        "en": "Innaa fis samaawaati wal ardi la Aayaatil lilmu'mineen"
                    }
                },
                "translation": {
                    "en": "Indeed, within the heavens and earth are signs for the believers.",
                    "id": "Sungguh, pada langit dan bumi benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang-orang mukmin."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4476",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4476.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4476.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sesungguhnya, pada penciptaan langit dan bumi benar-benar terdapat tanda-tanda ke-Esaan, kekuasaan, dan kebesaran Allah bagi orang-orang mukmin yang imannya mantap.",
                        "long": "Ayat ini menerangkan bahwa sebagai bukti Allah Mahaperkasa lagi Mahabijaksana, dapat dilihat pada kejadian langit, bumi, pada diri manusia dan pada binatang yang beraneka ragam macamnya. Ditegaskan bahwa di langit dan di bumi, banyak sekali terdapat tanda-tanda kekuasaan dan keperkasaan Allah. Orang yang berpikiran sederhana, pasti akan berkesimpulan bahwa di balik kejadian langit dan bumi beserta semua yang ada di antaranya, tentu ada zat yang Maha Pencipta lagi Mahakuasa. Apalagi orang yang tinggi ilmunya, tentu lebih dapat memahaminya lagi.\n\nPenciptaan langit, bumi dan isinya yang sangat menakjubkan sebagai tanda keagungan dan kekuasaan Allah bagi orang beriman, dan menunjukkan Allah-lah yang berhak disembah bukan selain Dia.\n\nDalam ayat ini disebutkan orang yang beriman bukan yang lainnya, karena merekalah yang dapat mengambil manfaat bahwa pencipta langit dan bumi adalah Allah, maka mereka tidak menyembah kecuali kepada-Nya.\n\nPada akhir ayat ini, Allah menjelaskan bahwa tanda-tanda kekuasaan Allah yang ada di langit dan di bumi itu menjadi tanda dan bukti wujud dan kekuasaan Allah bagi orang-orang yang beriman. Dengan memperhatikan tanda-tanda kekuasaan Allah yang ada di langit dan di bumi itu, orang yang berjiwa bersih, berpikiran sehat yang ingin mencari kebenaran dan tidak dipengaruhi oleh godaan setan tentulah akan menjadi orang yang menerima kenyataan bahwa Al-Qur'an yang diturunkan kepada Muhammad saw itu benar-benar wahyu dari Allah yang harus dilaksanakan oleh setiap manusia yang ingin hidup bahagia di dunia dan di akhirat nanti. Sebaliknya, jiwa seseorang yang dikotori oleh noda-noda kemaksiatan, pikiran yang telah dibelenggu oleh kepercayaan syirik telah tergoda oleh tipu daya setan, maka bagaimana pun jelas dan cerahnya tanda-tanda kekuasaan dan kebesaran Allah, mereka tidak akan dapat merasakan dan menghayatinya. Karena itu, mereka tetap bergelimang dalam kekafiran dan kemaksiatan.\n\nTanda-tanda kekuasaan Allah tersebar baik di langit maupun di bumi. Sebagai contoh adalah berkaitan dengan benda-benda langit seperti terurai pada Surah al-An'am/6: 96-97. \n\nDia menyingsingkan pagi dan menjadikan malam untuk beristirahat, dan (menjadikan) matahari dan bulan untuk perhitungan. Itulah ketetapan Allah Yang Mahaperkasa, Maha Mengetahui. Dan Dialah yang menjadikan bintang-bintang bagimu, agar kamu menjadikannya petunjuk dalam kegelapan di darat dan di laut. Kami telah menjelaskan tanda-tanda (kekuasaan Kami) kepada orang-orang yang mengetahui. (al-An'am/6: 96-97).\n\nMenurut kajian saintis, manusia sejak awal peradaban telah mengunakan benda-benda di langit seperti matahari dan bumi sebagai perhitungan penanggalan. Penanggalan berbasis pada 'gerak dan posisi matahari di langit bumi, atau yang dikenal dengan Solar Calendar, telah dilakukan oleh peradaban Barat (berasal dari Romawi dan Yunani), India; sedang peradaban Yahudi, Arab, Cina, juga India menggunakan Lunar Calendar, yaitu perhitungan berbasiskan kepada 'gerak dan posisi bulan di langit bumi. Dalam bahasa astronomi, Solar Calendar berbasiskan pada lintasan-orbit bumi terhadap posisi matahari, sedang Lunar Calendar berbasis pada lintasan-orbit bulan terhadap posisi bumi dan matahari. Demikian halnya bintang-bintang di langit sebagai yang digunakan sebagai indikator navigasi. Dalam bahasa ilmiah, indikator navigasi yang menggunakan atau berbasiskan posisi bintang-bintang di langit ini disebut stellar navigation. Stellar navigation juga telah digunakan oleh para pengembara darat untuk menentukan arah perjalanannya. Dalam dunia modern sekarang ini, ternyata stellar navigation juga telah digunakan oleh pesawat antariksa, seperti jenis pesawat Ulang-alik (Space Shuttle): Columbia, Challenger, dan Enterprise.\n\nDemikan halnya tanda-tanda kekuasaan Allah yang dapat dijumpai di bumi. Salah satunya adalah seperti disebut dalam Surah asy-Syura/42: 32 di atas, di mana gunung-gunung yang menurut awam tetap di tempatnya, ternyata mengapung dan bergerak."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4477,
                    "inSurah": 4
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَفِي خَلْقِكُمْ وَمَا يَبُثُّ مِن دَابَّةٍ آيَاتٌ لِّقَوْمٍ يُوقِنُونَ",
                    "transliteration": {
                        "en": "Wa fee khalaqikum wa maa yabussu min daaabbatin Aayaatul liqawminy-yooqinoon"
                    }
                },
                "translation": {
                    "en": "And in the creation of yourselves and what He disperses of moving creatures are signs for people who are certain [in faith].",
                    "id": "Dan pada penciptaan dirimu dan pada makhluk bergerak yang bernyawa yang bertebaran (di bumi) terdapat tanda-tanda (kebesaran Allah) untuk kaum yang meyakini,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4477",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4477.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4477.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan juga pada penciptaan dirimu, wahai manusia, dengan bentuk yang fungsi yang sempurna dan pada apa yang di tebarkan-Nya di permukaan bumi dari aneka jenis binatang melata, terdapat tanda-tanda keesaan, kekuasaan, dan kebesaran Allah untuk kaum yang meyakini,",
                        "long": "Allah menunjukkan tanda-tanda kekuasaan dan kebesaran-Nya pada kejadian manusia sendiri dan pada penciptaan binatang yang beraneka ragam jenis dan bentuknya.\n\nManusia diciptakan Allah dari unsur-unsur yang terdapat di dalam tanah. Berbagai zat yang terdiri dari karbohidrat, protein, zat lemak, zat gula, berbagai macam garam, berbagai macam vitamin, zat besi, dan sebagainya terkumpul dalam tubuh manusia, melalui makanan dan minuman yang berasal dari tumbuh-tumbuhan dan hewan. Tumbuh-tumbuhan dan hewan itu semua berasal dari tanah. Allah berfirman:\n\nDan di antara tanda-tanda (kebesaran)-Nya ialah Dia menciptakan kamu dari tanah, kemudian tiba-tiba kamu (menjadi) manusia yang berkembang biak. (ar-Rum/30: 20)\n\nSebagian dari zat yang dimakan manusia itu ada yang menjadi spermatozoa pada diri laki-laki dan ovum pada diri perempuan. Sperma dan ovum itu bertemu, pada saat terjadinya senggama antara laki-laki dan perempuan. Dengan demikian terjadilah pembuahan. Benih itu makin lama makin besar. Empatpuluh hari kemudian, terbentuklah jaringan-jaringan yang dipenuhi pembuluh-pembuluh darah. Empatpuluh hari kemudian, terlihatlah calon janin yang berbentuk seperti darah yang mengental. Kemudian setelah empatpuluh hari terbentuklah janin yang melekat pada dinding rahim. Pada saat itulah, mulai terlihat tanda-tanda kehidupan dan jantung bayi itu mulai berdenyut. Denyut jantung bayi itu telah dapat didengar apabila orang menempelkan telinganya ke bagian perut ibu yang sedang mengandung. Sejak terjadinya pembuahan dalam kandungan ibu sampai kepada terlihatnya tanda-tanda kehidupan, diperlukan waktu empat bulan. Lima bulan sepuluh hari setelah itu, lahirlah janin dari kandungan. Sejak itulah bayi itu bernapas dengan paru-parunya yang telah mulai bekerja, dan sejak itu pula ia berangsur-angsur melepaskan diri dari ketergantungannya kepada orang tuanya, terutama kepada ibunya. Dia telah diberi akal, perasaan dan kemampuan bekerja sehingga dengan kemampuan yang diberikan itu, ia telah dapat melaksanakan tugas hidupnya sebagai khalifah Allah di muka bumi. Akhirnya ia menjadi tua dan meninggal dunia.\n\nPenciptaan manusia Allah jelaskan dalam firman-Nya:\n\nDialah yang menciptakanmu dari tanah, kemudian dari setetes mani, lalu dari segumpal darah, kemudian kamu dilahirkan sebagai seorang anak, kemudian dibiarkan kamu sampai dewasa, lalu menjadi tua. Tetapi di antara kamu ada yang dimatikan sebelum itu. (Kami perbuat demikian) agar kamu sampai kepada kurun waktu yang ditentukan, agar kamu mengerti. (Gafir/40: 67)\n\nDengan memperhatikan proses penciptaan manusia, bagaimana sulit dan ruwetnya hukum-hukum yang berlaku dalam penciptaan itu, orang yang sadar akan mengakui kekuasaan dan keagungan Allah, Tuhan Yang Maha Esa.\n\nAllah menunjukkan juga tanda-tanda kekuasaan dan keagungan-Nya yang terdapat pada kejadian dan kehidupan binatang melata yang beraneka ragam, jenis, macamnya, dan cara-cara kehidupannya. Dengan memperhatikan bentuknya, orang dapat membedakan binatang. Ada binatang yang beruas tulang belakang yang dalam Ilmu Hayat disebut \"vertebrata\", ada yang tidak beruas tulang belakang (invertebrata). Binatang yang beruas tulang belakang dibagi atas beberapa bagian seperti mamalia (binatang menyusui), jenis burung (aves), jenis binatang melata (reptilia), jenis binatang yang hidup di darat dan di air (amphibia), jenis ikan (pisces).\n\nBinatang yang tidak beruas tulang belakang dibeda-bedakan lagi menjadi beberapa bahagian seperti binatang berkutu (insektifora), binatang lunak (mollusca), hingga binatang yang bersel satu (protozoa). Tiap-tiap jenis dan macam binatang itu mempunyai hukum-hukum dan ketentuan-ketentuan sendiri-sendiri yang disusun dengan rapi seperti cara hidup, makanannya, cara berkembang biak, cara mempertahankan hidup, sampai kepada keagungan dan faedahnya. Dan hal-hal yang diterangkan itu akan menjadi i'tibar dan pelajaran bagi orang-orang yang mau berpikir dan ingin mengetahui betapa Maha Tingginya Ilmu penciptanya; dengan demikian, akan memperkuat iman di hatinya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4478,
                    "inSurah": 5
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَاخْتِلَافِ اللَّيْلِ وَالنَّهَارِ وَمَا أَنزَلَ اللَّهُ مِنَ السَّمَاءِ مِن رِّزْقٍ فَأَحْيَا بِهِ الْأَرْضَ بَعْدَ مَوْتِهَا وَتَصْرِيفِ الرِّيَاحِ آيَاتٌ لِّقَوْمٍ يَعْقِلُونَ",
                    "transliteration": {
                        "en": "Wakhtilaafil laili wannahaari wa maaa anzalal laahu minas samaaa'i mir rizqin fa ahyaa bihil arda ba'da mawtihaa wa tasreefir riyaahi Aayaatul liqawminy ya'qiloon"
                    }
                },
                "translation": {
                    "en": "And [in] the alternation of night and day and [in] what Allah sends down from the sky of provision and gives life thereby to the earth after its lifelessness and [in His] directing of the winds are signs for a people who reason.",
                    "id": "dan pada pergantian malam dan siang dan hujan yang diturunkan Allah dari langit lalu dengan (air hujan) itu dihidupkan-Nya bumi setelah mati (kering); dan pada perkisaran angin terdapat pula tanda-tanda (kebesaran Allah) bagi kaum yang mengerti."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4478",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4478.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4478.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "dan pada perbedaan malam dan siang, yang datang silih berganti, malam datang lalu siang pergi, dan pada apa yang di turunkan Allah dari langit, seperti hujan sebagai rezeki lalu dengan air hujan itu di hidupkan-Nya bumi setelah matinya, yaitu kering, dan demikian pula pada perkisaran angin ke berbagai arah, perbedaan suhu dan kekuatannya serta manfaat dan bahayanya, terdapat pula tanda-tanda keesaan, kekuasaan, dan kebesaran Allah bagi kaum yang mengerti.",
                        "long": "Pada ayat ini, Allah mengingatkan manusia akan tanda-tanda kebesaran dan kekuasaan-Nya yang terdapat pada pergantian siang dan malam baik dari segi panjang dan pendeknya.\n\nDari segi pergantian, orang dapat menyaksikan sejak matahari terbit di kaki langit sebelah timur hingga terbenam di kaki langit sebelah barat. Di siang hari, orang tidak menyaksikan apa pun di langit, terkecuali matahari yang bersinar dengan terangnya. Pada waktu itu, kebanyakan manusia bekerja dan berusaha mencari nafkah, memenuhi kebutuhan hidupnya.\n\nMatahari bergerak meninggalkan ufuk sebelah timur makin lama makin meninggi. Kemudian ia terlihat di meridian. Sesudah itu, makin menurun menuju ufuk langit sebelah barat. Akhirnya ia tenggelam di ufuk sebelah barat. Sejak itu, hari berangsur-angsur gelap, kadang-kadang terlihat awan kemerah-merahan, lalu mulailah bermunculan binatang-binatang satu demi satu, dari bintang yang paling terang cahayanya sampai kepada bintang yang bercahaya redup. Setelah gelap menyelubungi permukaan bumi seluruhnya, bertambah jelaslah nampak bintang-bintang bertaburan di angkasa raya, berbagai macam rasi dan aneka warna cahayanya. Pada penghujung malam, mulailah kelihatan fajar menyingsing di ufuk timur, sebagai tanda tidak lama lagi matahari akan terbit kembali. Sejak itulah, cahaya bintang mulai redup kembali karena cahayanya mulai dikalahkan oleh cahaya matahari.\n\nBegitulah seterusnya orang dapat menyaksikan keadaan itu berulang-ulang. Suasana yang seperti itu terjadi di negeri-negeri yang berada di daerah khatulistiwa, sedangkan belahan bumi bahagian selatan dan utara akan mengalami keadaan siang lebih panjang atau lebih pendek dari malam, sesuai dengan lintang dan deklinasi matahari.\n\nDari segi panjang pendeknya malam dan siang, orang yang berada di khatulistiwa selamanya akan menyaksikan panjang pendeknya siang malam yang hampir sama. Daerah yang berada di selatan khatulistiwa akan mengalami siang lebih panjang apabila matahari berada di sebelah selatan, tetapi akan mengalami siang yang lebih pendek apabila matahari berada di sebelah utara khatulistiwa. Demikian pula orang yang berada di sebelah utara khatulistiwa akan mengalami siang yang lebih panjang apabila matahari berada di sebelah selatan. Makin jauh suatu tempat baik ke utara maupun selatan khatulistiwa, makin jauh pula perbedaan panjang pendek waktu antara malam dan siang. Bagi orang yang berada di kutub utara dan kutub selatan, dalam satu tahun ada masa malam yang terus menerus dan ada pula masa siang yang terus menerus. Pada masa siang terus menerus matahari selalu berada di atas cakrawala, selalu kelihatan tidak pernah masuk ke bawah kaki langit, sedangkan pada masa malam terus menerus, matahari selalu berada di bawah kaki langit, tidak pernah kelihatan dan tidak pernah melewati kaki langit ke atas.\n\nDengan memperhatikan pergantian siang dan malam, dan panjang pendeknya yang selalu berubah-ubah sepanjang tahun, akan terlihat tanda-tanda kekuasaan dan kebesaran Allah, serta akan nampak adanya hukum-hukum yang mengaturnya dengan sangat rapi, tidak pernah menyimpang dari ketentuan-ketentuan yang telah ditentukan.\n\nKemudian Allah menunjukkan tanda-tanda kekuasaan dan kebesaran-Nya yang terlihat pada turunnya hujan dari langit. Karena panas matahari, air pun menguap ke atas. Angin yang selalu bertiup mempercepat proses penguapan itu dan menghalaunya ke suatu tempat dan lama-kelamaan terkumpullah uap air itu di angkasa sebagai awan. Apabila awan yang berarak dihalau angin itu tertahan oleh gunung, maka terkumpullah ia di sana, semakin lama semakin tebal. Warnanya yang semula keputih-putihan berubah menjadi hitam. Dan apabila suhu udara telah mencapai kedinginan sedemikian rupa, turunlah uap air itu sebagai hujan yang menyirami permukaan bumi. Karena air hujan itu, tumbuhlah beraneka macam tumbuh-tumbuhan, dan karena air hujan itu pula, binatang dan manusia dapat hidup. Manusia dengan hasil pemikirannya dapat mengatur aliran air itu sehingga tidak mengalir seluruhnya ke laut. Sebahagian dimanfaatkan dan sebagian lagi dapat digunakan pada musim kemarau. Pada tiap daerah, di permukaan bumi, curah hujan tidak sama; bergantung kepada faktor-faktor yang menentukan. Ada daerah yang curah hujannya sangat lebat dan ada pula yang sangat tipis dan ada yang sedang. Dengan memperhatikan turunnya hujan itu dan manfaatnya bagi kehidupan makhluk, orang dapat mengetahui betapa luasnya kekuasaan penciptanya.\n\nSesudah itu Allah menunjukkan pula tanda-tanda kekuasaan-Nya yang dapat dilihat pada perkisaran tiupan angin yaitu perkisaran angin darat dan angin laut yang selalu berhembus berganti arah. Telah menjadi hukum alam bahwa daratan lebih cepat menjadi panas bila ditimpa sinar matahari dibandingkan dengan lautan yang lambat menjadi panas bila ditimpa sinar matahari. Sebaliknya daratan lebih cepat pula melepaskan panas di malam hari, pada waktu panas matahari tidak ada lagi dibandingkan dengan lautan yang lambat melepasnya. Dengan demikian, terdapatlah daerah maksimum dan minimum udaranya. Pada siang hari daratan lebih panas dari lautan sehingga udaranya menjadi minimum, sedangkan lautan kurang panas udaranya dibandingkan dengan daratan sehingga udaranya menjadi maksimum. Udara mengalir dari daerah maksimum ke daerah minimum, maka bertiuplah pada siang hari angin laut menuju daratan. Akan tetapi, di waktu malam, terjadi kebalikannya; daratan menjadi maksimum dan lautan menjadi minimum karena daratan lebih cepat menjadi dingin daripada lautan sehingga bertiuplah angin dari daratan menuju lautan.\n\nKeadaan yang demikian menguntungkan para nelayan. Mereka berangkat pada waktu malam, berlayar ke tengah lautan mengikuti arah hembusan angin laut. Di samping itu, perubahan letak matahari berada di lintang- balik -utara belahan bumi bagian selatan. Karena itu, udara maksimum di belahan bumi bahagiana selatan. Maka bertiuplah angin dari belahan bumi selatan ke belahan bumi bagian utara. Waktu itu di Indonesia mengalami musim kemarau. Akan tetapi, bila matahari berada pada lintang balik selatan, belahan bumi bagian selatan menerima panas lebih banyak dari bagian bumi sebelah utara. Karena itu, udara maksimum di bagian utara, maka bertiuplah angin dari utara ke selatan. Untuk Indonesia, angin bertiup dari padang pasir Gobi ke Tiongkok, menyusur Semenanjung Malaysia karena pengaruh perputaran bumi membelok ke timur, ke Indonesia, menuju Padang Pasir Victoria di Australia. Pada saat itu, di Indonesia mengalami musim hujan.\n\nDi samping itu, terdapat angin yang bertiup dari kutub utara dan kutub selatan secara tetap, karena daerah kutub selalu mengalami udara yang lebih dingin daripada khatulistiwa maka daerah-daerah kutub, udaranya selalu maksimum. Akan tetapi karena perputaran bumi pada porosnya dari barat ke timur, maka angin yang bertiup dari kutub itu mengalami pembelokan ke barat. Itulah sebabnya angin itu di Indonesia bertiup dari tenggara. Untuk daerah-daerah kutub sendiri, bertiuplah selalu angin barat yang tetap sepanjang masa.\n\nDari perkisaran angin itu, orang akan mengetahui betapa Mahabijaksana dan Mahaperkasa-Nya Allah yang menciptakan alam semesta ini.\n\nItulah sebabnya pada bagian akhir surah ini, Allah menegaskan bahwa tanda-tanda kekuasaan-Nya yang dapat dilihat pada jagat raya, pada diri manusia, pada perkisaran angin, pada turunnya hujan, dan sebagainya menjadi bukti kekuasaan-Nya bagi orang yang mempergunakan akalnya dan bagi orang yang benar-benar mau mencari kebenaran.\n\nDengan bermacam-macam himbauan itulah, Allah menunjukkan tanda-tanda kekuasaan-Nya agar manusia meyakini Kemahaesaan dan kemahakuasaan-Nya. Dengan mengetahui semuanya itu dengan benar, niscaya bertambah mantaplah iman mereka dan bertambah pulalah gairahnya untuk memanfaatkan pengetahuannya itu bagi kemaslahan umat manusia.\n\nDari keterangan di atas, dipahami pula amat banyak yang dapat dijadikan bukti adanya Allah, Mahakuasa dan Mahabijaksana, asal saja orang mau mengikuti cara berpikir yang digariskan Allah dalam Al-Qur'an, hal ini juga berarti bahwa sebenarnya, semakin tinggi ilmu seseorang semakin banyak ia mempunyai bukti-bukti itu. Jika ada seorang yang berilmu yang tidak mempercayai adanya Tuhan, berarti ia belum lagi mempergunakan ilmunya itu menurut yang semestinya.\n\nDalam ayat-ayat ini terdapat tiga kalimat berbeda, pertama yu'minun, kedua yuqinun, dan ketiga ya'qilun, hal ini dimaksudkan; jika kalian beriman maka pahamilah tanda-tanda keagungan Allah ini dan jika tidak beriman namun mencari kebenaran dan keyakinan maka pahamilah tanda-tanda ini, dan jika tidak beriman dan tidak mencari kenyataan maka jadilah kalian orang yang berakal dan pahamilah tanda-tanda ini. \n\nAyat ini dengan singkat menggambarkan adanya mekanisme-mekanisme perputaran dan peredaran bumi yang berkaitan dengan perubahan cuaca serta perkisaran angin. Ilmu pengetahuan saat ini menerangkan adanya siang dan malam di bumi disebabkan oleh perputaran (rotasi) bumi pada porosnya. Disamping berotasi, bumi juga beredar pada garis lintasannya (evolusi) yang berbentuk elips. Bumi memerlukan waktu satu tahun untuk beredar pada lintasan ini sampai berada kembali pada posisi yang sama. Proses rotasi dan evolusi bumi, di samping berkaitan dengan cuaca dan iklim di berbagai tempat di permukaan bumi, berkaitan pula dengan perubahan-perubahan arah angin. Hujan-hujan setempat umumnya terjadi setelah tengah hari, ketika suhu mulai mendingin, setelah pada pagi dan siang hari sebelumnya permukaan bumi mendapatkan panas matahari yang banyak dan cukup menghasilkan uap air untuk menghasilkan awan yang menurunkan hujan. \n\nPoros perputaran bumi membuat sudut sebesar 23,5o terhadap garis lintasan peredarannya, sehingga jumlah intensitas cahaya matahari yang diterima belahan bumi utara dan selatan selalu berbeda, kecuali pada posisi bidang lintasan tegak lurus terhadap bidang penampang setengah bola bumi, ketika itu matahari berada persis di atas khatulistiwa. Adanya tempat-tempat yang mendapatkan intensitas cahaya yang berbeda menyebabkan panas permukaan bumi berbeda-beda pula. Dengan adanya perbedaan panas di permukaan bumi maka terjadilah aliran udara (angin) dari tempat yang dingin ke tempat yang lebih panas. Di daerah sekitar khatulistiwa (ekuatorial) terdapat angin yang berhembus sepanjang tahun ke arah khatulistiwa yang selalu panas yang dikenal dengan angin pasat. Di Indonesia yang terletak di antara dua samudera besar dan dua benua berhembus angin yang berganti arah setiap setengah tahun, dikenal dengan angin muson (moonsoon). Pada bulan Oktober sampai April, angin berhembus dari barat laut ke arah tenggara (angin barat) yang membawa serta kelembaban dan menyebabkan musim hujan. Pada bulan April sampai Oktober, angin yang berhembus dari tenggara ke arah barat laut, bersifat kering, menyebabkan musim kemarau. \n\nDi permukaan laut, perbedaan panas cahaya matahari ini menyebabkan adanya arus laut dan perbedaan produksi uap air. Perpaduan dinamika arah angin dan produksi uap air di permukaan bumi menghasilkan siklus perubahan iklim, yang pada dasarnya akan berulang setiap tahun. Pada perioda perulangan tertentu biasa terjadi pula kasus-kasus ekstrim seperti misalnya fenomena El Nino dan La Nina."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4479,
                    "inSurah": 6
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ ۖ فَبِأَيِّ حَدِيثٍ بَعْدَ اللَّهِ وَآيَاتِهِ يُؤْمِنُونَ",
                    "transliteration": {
                        "en": "Tilka Aayatul laahi natloohaa 'alika bilhaqq, fabiayyi hadeesim ba'dal laahi wa Aayaatihee yu'minoon"
                    }
                },
                "translation": {
                    "en": "These are the verses of Allah which We recite to you in truth. Then in what statement after Allah and His verses will they believe?",
                    "id": "Itulah ayat-ayat Allah yang Kami bacakan kepadamu dengan sebenarnya; maka dengan perkataan mana lagi mereka akan beriman setelah Allah dan ayat-ayat-Nya."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4479",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4479.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4479.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Itulah ayat-ayat Allah yang dihamparkan di alam ini untuk menggambarkan keesaan, kekuasaan, dan kebesaran-Nya yang Kami bacakan melalui malaikat Jibril kepadamu, wahai Nabi Muhammad, dengan sebenarnya untuk engkau sampaikan kepada umatmu; maka dengan perkataan mana lagi mereka akan beriman setelah firman Allah dan ayat-ayat-Nya itu? Kalau ayat-ayat Al-Qur’an dan tanda-tanda kekuasaan Allah di muka bumi tidak mereka percayai, maka yang lain pun mereka lebih tidak percaya lagi.",
                        "long": "Allah menyatakan kepada Rasulullah saw, bahwa ayat Al-Qur'an yang dibacakan kepadanya itu adalah ayat-ayat yang mengandung bukti, dan dalil-dalil yang kuat baik dari segi asal Al-Qur'an itu (dari Allah) maupun dari segi isi dan gaya bahasanya. Pernyataan Allah itu telah disampaikan oleh Nabi Muhammad saw kepada kaum musyrik Mekah, tetapi semuanya itu tidak dapat mereka terima, bahkan mereka bertambah ingkar kepada Rasulullah saw.\n\nPada waktu Al-Qur'an dibacakan kepada orang kafir Mekah, hati mereka mengakui ketinggian isi dan gaya bahasanya. Pengakuan ini langsung diucapkan 'Utbah bin Rabi'ah dan Abu al-Walid, sastrawan kenamaan orang Arab waktu itu. Kepada mereka diperintahkan agar memperhatikan kejadian alam semesta ini, kejadian diri mereka sendiri, air hujan yang turun dari langit yang menyirami bumi sehingga bumi yang tandus menjadi subur, angin yang bertiup, dan sebagainya, semuanya itu dapat dijadikan bukti bahwa Allah adalah Maha Esa, Mahakuasa lagi Mahaperkasa. \n\nKepada mereka pun telah diutus seorang rasul yang akan menyampaikan agama Allah kepada seluruh manusia. Rasul itu adalah orang yang paling mereka percayai di antara mereka, orang yang mereka segani dan orang yang selalu mereka mintai nasihat dalam menyelesaikan perselisihan-perselisihan yang terjadi di antara mereka. Rasul yang diutus itu dapat pula membuktikan bahwa ia benar-benar Rasul yang diutus Allah kepada manusia, misalnya dengan mengemukakan beberapa mukjizat yang diberikan Allah kepadanya. Sudah banyak bukti yang dikemukakan kepada mereka, tetapi mereka tidak juga beriman. Sebenarnya, bagi orang yang mau menggunakan pikirannya, cukup banyak bukti untuk menjadikan dia seorang yang beriman.\n\nItulah sebabnya maka Rasulullah saw diperintahkan oleh Allah menanyakan kepada kaum musyrik Mekah tentang keterangan apalagi yang mereka minta yang dapat mengubah hati mereka sehingga menjadi beriman.\n\nTelah lengkap keterangan yang diberikan kepada mereka. Tidak ada lagi dalil-dalil dan bukti-bukti yang lebih kuat daripada yang telah dikemukakan itu. Jika mereka tidak mau juga memahaminya dan tidak mau menerima bukti dan dalil-dalil itu, terserah kepada mereka sendiri. Mereka akan mendapatkan balasan yang setimpal akibat sikap kepala batu mereka itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4480,
                    "inSurah": 7
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَيْلٌ لِّكُلِّ أَفَّاكٍ أَثِيمٍ",
                    "transliteration": {
                        "en": "Wailul likulli affaakin aseem"
                    }
                },
                "translation": {
                    "en": "Woe to every sinful liar",
                    "id": "Celakalah bagi setiap orang yang banyak berdusta lagi banyak berdosa,"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4480",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4480.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4480.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kecelakaan yang amat besar bagi setiap orang yang banyak berdusta, yaitu mengada-adakan kebohongan terhadap Allah, lagi banyak berdosa, yakni melakukan pelanggaran,",
                        "long": "Kemudian Allah mengancam kaum musyrikin yang selalu mengingkari kebenaran ayat-ayat Al-Qur'an dengan ancaman yang sangat mengerikan. Mereka tetap mendustakan kebenaran ayat-ayat Al-Qur'an, padahal di dalamnya terdapat keterangan tentang dalil-dalil dan bukti-bukti keesaan dan kekuasaan-Nya yang cukup jelas. Bukti dan keterangan itu telah mereka dengar sendiri. Menurut ukuran yang wajar, tentu mereka telah memahaminya. Akan tetapi, yang terjadi adalah sebaliknya. Itulah sebabnya mereka disebut dalam ayat ini orang-orang yang banyak berdusta dan banyak melakukan perbuatan dosa.\n\nSelanjutnya diterangkan bahwa keadaan orang-orang musyrik sebelum dan sesudah mendengar ayat-ayat Al-Qur'an tetap sama, tidak ada perubahan dalam sikap dan perilaku mereka, bahkan mereka bertambah ingkar dan menyombongkan diri. Itulah sebabnya dalam ayat ini mereka dikatakan seolah-olah tidak pernah mendengar ayat-ayat Al-Qur'an yang disampaikan kepada mereka.\n\nDalam ayat yang lain, diterangkan bahwa mereka sendiri mengakui tidak pernah merasa mendengar Al-Qur'an yang disampaikan kepada mereka. Allah berfirman:\n\nDan mereka berkata, \"Hati kami sudah tertutup dari apa yang engkau seru kami kepadanya dan telinga kami sudah tersumbat, dan di antara kami dan engkau ada dinding, karena itu lakukanlah (sesuai kehendakmu), sesungguhnya kami akan melakukan (sesuai kehendak kami).\" (Fussilat/41: 5)\n\nDalam ayat lain:\n\nDan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan (Al-Qur'an) itu merupakan kegelapan bagi mereka. (Fussilat/41: 44)\n\nPada akhir ayat ini, Allah memerintahkan kepada Rasul-Nya menyampaikan kabar gembira kepada mereka bahwa mereka akan memperoleh azab yang pedih di neraka nanti. Dalam ayat ini disebutkan bahwa memberitakan adanya azab yang pedih merupakan suatu berita gembira, bukan suatu berita duka. Ungkapan ini sengaja dibuat demikian untuk membalas sikap mereka yang memperolok-olokkan ayat-ayat Al-Qur'an yang disampaikan kepadanya dan untuk menunjukkan bahwa sikap mereka itu merupakan sikap yang sudah melampaui batas. Karena itu, yang dimaksud dengan kabar gembira di sini ialah lawan daripada kabar gembira itu, yaitu kabar sedih sebagai penghinaan kepada mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4481,
                    "inSurah": 8
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "يَسْمَعُ آيَاتِ اللَّهِ تُتْلَىٰ عَلَيْهِ ثُمَّ يُصِرُّ مُسْتَكْبِرًا كَأَن لَّمْ يَسْمَعْهَا ۖ فَبَشِّرْهُ بِعَذَابٍ أَلِيمٍ",
                    "transliteration": {
                        "en": "Yasma'u Aayaatil laahi tutlaa 'alaihi summa yusirru mustakbiran ka-al lam yasma'haa fabashshirhu bi'azaabin aleem"
                    }
                },
                "translation": {
                    "en": "Who hears the verses of Allah recited to him, then persists arrogantly as if he had not heard them. So give him tidings of a painful punishment.",
                    "id": "(yaitu) orang yang mendengar ayat-ayat Allah ketika dibacakan kepadanya namun dia tetap menyombongkan diri seakan-akan dia tidak mendengarnya. Maka peringatkanlah dia dengan azab yang pedih."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4481",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4481.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4481.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "yaitu orang yang selalu mendengar ayat-ayat Allah dengan begitu jelas ketika di bacakan kepadanya dengan lisan, namun tetap saja dia tidak mempercayainya, bahkan kemudian dia tetap mengingkarinya sambil menyombongkan diri seakan-akan dia tidak pernah mendengarnya. Karena sikap dan tindakannya yang demikian itulah, maka wahai Nabi Muhammad, peringatkanlah dia dengan azab yang pedih akibat perbuatan buruknya",
                        "long": "Kemudian Allah mengancam kaum musyrikin yang selalu mengingkari kebenaran ayat-ayat Al-Qur'an dengan ancaman yang sangat mengerikan. Mereka tetap mendustakan kebenaran ayat-ayat Al-Qur'an, padahal di dalamnya terdapat keterangan tentang dalil-dalil dan bukti-bukti keesaan dan kekuasaan-Nya yang cukup jelas. Bukti dan keterangan itu telah mereka dengar sendiri. Menurut ukuran yang wajar, tentu mereka telah memahaminya. Akan tetapi, yang terjadi adalah sebaliknya. Itulah sebabnya mereka disebut dalam ayat ini orang-orang yang banyak berdusta dan banyak melakukan perbuatan dosa.\n\nSelanjutnya diterangkan bahwa keadaan orang-orang musyrik sebelum dan sesudah mendengar ayat-ayat Al-Qur'an tetap sama, tidak ada perubahan dalam sikap dan perilaku mereka, bahkan mereka bertambah ingkar dan menyombongkan diri. Itulah sebabnya dalam ayat ini mereka dikatakan seolah-olah tidak pernah mendengar ayat-ayat Al-Qur'an yang disampaikan kepada mereka.\n\nDalam ayat yang lain, diterangkan bahwa mereka sendiri mengakui tidak pernah merasa mendengar Al-Qur'an yang disampaikan kepada mereka. Allah berfirman:\n\nDan mereka berkata, \"Hati kami sudah tertutup dari apa yang engkau seru kami kepadanya dan telinga kami sudah tersumbat, dan di antara kami dan engkau ada dinding, karena itu lakukanlah (sesuai kehendakmu), sesungguhnya kami akan melakukan (sesuai kehendak kami).\" (Fussilat/41: 5)\n\nDalam ayat lain:\n\nDan orang-orang yang tidak beriman pada telinga mereka ada sumbatan, dan (Al-Qur'an) itu merupakan kegelapan bagi mereka. (Fussilat/41: 44)\n\nPada akhir ayat ini, Allah memerintahkan kepada Rasul-Nya menyampaikan kabar gembira kepada mereka bahwa mereka akan memperoleh azab yang pedih di neraka nanti. Dalam ayat ini disebutkan bahwa memberitakan adanya azab yang pedih merupakan suatu berita gembira, bukan suatu berita duka. Ungkapan ini sengaja dibuat demikian untuk membalas sikap mereka yang memperolok-olokkan ayat-ayat Al-Qur'an yang disampaikan kepadanya dan untuk menunjukkan bahwa sikap mereka itu merupakan sikap yang sudah melampaui batas. Karena itu, yang dimaksud dengan kabar gembira di sini ialah lawan daripada kabar gembira itu, yaitu kabar sedih sebagai penghinaan kepada mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4482,
                    "inSurah": 9
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِذَا عَلِمَ مِنْ آيَاتِنَا شَيْئًا اتَّخَذَهَا هُزُوًا ۚ أُولَٰئِكَ لَهُمْ عَذَابٌ مُّهِينٌ",
                    "transliteration": {
                        "en": "Wa izaa 'alima min Aayaatinaa shai'anit takhazahaa huzuwaa; ulaaa'ika lahum 'azaabum muheen"
                    }
                },
                "translation": {
                    "en": "And when he knows anything of Our verses, he takes them in ridicule. Those will have a humiliating punishment.",
                    "id": "Dan apabila dia mengetahui sedikit tentang ayat-ayat Kami, maka (ayat-ayat itu) dijadikan olok-olok. Merekalah yang akan menerima azab yang menghinakan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4482",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4482.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4482.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan apabila dia telah mengetahui dengan cara apa pun sedikit tentang ayat-ayat Kami, maka dia menjadikannya sebagai bahan olok-olokan. Merekalah, yaitu para pembohong dan pendosa itu, yang akan menerima azab yang menghinakan.",
                        "long": "Pada ayat ini diterangkan sikap yang lain dari orang musyrik Mekah sewaktu mendengar ayat-ayat Al-Qur'an disampaikan kepada mereka. Apabila ada di antara kawan-kawan mereka yang menyampaikan berita tentang ayat-ayat Al-Qur'an, mereka pun memperolok-olok ayat-ayat itu.\n\nDiriwayatkan bahwa ketika Abu Jahal mendengar firman Allah:\n\nSungguh pohon zaqqum itu, makanan bagi orang yang banyak dosa. (ad-Dukhan/44: 43-44)\n\nia meminta korma dan keju, seraya berkata kepada kawan-kawannya, \"Makanlah buah zaqqum ini, yang diancamkan Muhammad saw kepadamu itu tidak lain adalah makanan yang manisnya seperti madu.\" Dan ketika ia mendengar firman Allah:\n\nDi atasnya ada sembilan belas (malaikat penjaga). (al-Muddatstsir/74: 30)\n\nAbu Jahal berkata, \"Kalau penjaganya hanya sembilan belas, maka saya sendiri akan melemparkan mereka itu.\" Banyak lagi cara-cara dan sikap lain yang bernada menghina dari orang-orang kafir Mekah pada waktu mereka mendengar bacaan Al-Qur'an. Bahkan Abu Jahal menantang sebagaimana yang diterangkan Al-Qur'an:\n\nDan (ingatlah), ketika mereka (orang-orang musyrik) berkata, \"Ya Allah, jika (Al-Qur'an) ini benar (wahyu) dari Engkau, maka hujanilah kami dengan batu dari langit, atau datangkanlah kepada kami azab yang pedih.\" (al-Anfal/8: 32)\n\nKarena mereka selalu mendustakan ayat-ayat Allah dan memperolok-olokkannya, maka dalam ayat ini Allah menegaskan balasan yang akan mereka terima nanti di akhirat. Mereka akan dimasukkan ke dalam neraka yang menghinakan dan menyiksa mereka sebagai balasan dari sikap dan perbuatan mereka itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4483,
                    "inSurah": 10
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مِّن وَرَائِهِمْ جَهَنَّمُ ۖ وَلَا يُغْنِي عَنْهُم مَّا كَسَبُوا شَيْئًا وَلَا مَا اتَّخَذُوا مِن دُونِ اللَّهِ أَوْلِيَاءَ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌ",
                    "transliteration": {
                        "en": "Minw waraaa'ihim Jahannamu wa laa yughnee 'anhum maa kasaboo shai'anw wa laa mat takhazoo min doonil laahi awliyaaa'a wa lahum 'azaabun 'azeem"
                    }
                },
                "translation": {
                    "en": "Before them is Hell, and what they had earned will not avail them at all nor what they had taken besides Allah as allies. And they will have a great punishment.",
                    "id": "Di hadapan mereka neraka Jahanam dan tidak akan berguna bagi mereka sedikit pun apa yang telah mereka kerjakan, dan tidak pula (bermanfaat) apa yang mereka jadikan sebagai pelindung-pelindung (mereka) selain Allah. Dan mereka akan mendapat azab yang besar."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4483",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4483.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4483.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Di hadapan mereka kini sudah disiapkan neraka Jahanam dan tidak akan berguna bagi mereka sedikit pun apa yang telah mereka kerjakan, dan tidak pula bermanfaat apa yang mereka jadikan sebagai pelindung-pelindung mereka, yaitu sesembahan mereka selain Allah. Dan mereka akan mendapat azab yang besar sebagai akibat dari perbuatan dosa yang mereka lakukan.",
                        "long": "Pada ayat ini Allah menjelaskan bahwa kaum musyrikin di akhirat kelak akan berhadapan dengan neraka Jahanam yang telah disediakan untuk mereka, sebab mereka selalu bersikap sombong untuk menerima petunjuk yang disampaikan oleh Nabi Muhammad. Segala sesuatu yang mereka usahakan di dunia sedikit pun tidak dapat menyelamatkan mereka dari Jahanam, demikian pula apa yang mereka sembah selain Allah, tidak dapat memberikan perlindungan sedikit pun dan mereka akan memperoleh azab yang sangat besar."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4484,
                    "inSurah": 11
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 434,
                    "hizbQuarter": 199,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هَٰذَا هُدًى ۖ وَالَّذِينَ كَفَرُوا بِآيَاتِ رَبِّهِمْ لَهُمْ عَذَابٌ مِّن رِّجْزٍ أَلِيمٌ",
                    "transliteration": {
                        "en": "Haazaa hudanw wal lazeena kafaroo bi aayaati Rabbihim lahum 'azaabum mir rijzin aleem"
                    }
                },
                "translation": {
                    "en": "This [Qur'an] is guidance. And those who have disbelieved in the verses of their Lord will have a painful punishment of foul nature.",
                    "id": "Ini (Al-Qur'an) adalah petunjuk. Dan orang-orang yang mengingkari ayat-ayat Tuhannya mereka akan mendapat azab berupa siksaan yang sangat pedih."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4484",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4484.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4484.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Al-Qur\\'an ini adalah petunjuk yang menunjukkan dan mengarahkan mereka ke jalan yang benar. Dan orang-orang yang mengingkari ayat-ayat Tuhan mereka akan mendapat azab berupa siksaan yang sangat pedih.",
                        "long": "Dalam ayat ini dijelaskan bahwa Al-Qur'an adalah petunjuk yang berasal dari Allah, yang disampaikan-Nya kepada Muhammad saw, agar disampaikan kepada seluruh umat manusia. Petunjuk itu yang menuntun manusia ke jalan yang benar menuju kebahagiaan dunia dan akhirat.\n\nDiterangkan orang yang mengingkari petunjuk Al-Qur'an itu akan menempuh jalan yang sesat, jalan yang menuju kepada penderitaan hidup dunia dan akhirat.\n\nAl-Qur'an sebagai petunjuk dapat mengeluarkan manusia dari kesesatan menuju kebenaran, dari kekafiran menuju keimanan. Oleh karena itu, orang yang tidak beriman akan mendapat siksa yang sangat pedih."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4485,
                    "inSurah": 12
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 435,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "۞ اللَّهُ الَّذِي سَخَّرَ لَكُمُ الْبَحْرَ لِتَجْرِيَ الْفُلْكُ فِيهِ بِأَمْرِهِ وَلِتَبْتَغُوا مِن فَضْلِهِ وَلَعَلَّكُمْ تَشْكُرُونَ",
                    "transliteration": {
                        "en": "Allaahul lazee sahkhara lakumul bahra litajriyal fulku feehi bi amrihee wa litabtaghoo min fadlihee wa la'allakum tashkuroon"
                    }
                },
                "translation": {
                    "en": "It is Allah who subjected to you the sea so that ships may sail upon it by His command and that you may seek of His bounty; and perhaps you will be grateful.",
                    "id": "Allah-lah yang menundukkan laut untukmu agar kapal-kapal dapat berlayar di atasnya dengan perintah-Nya, dan agar kamu dapat mencari sebagian karunia-Nya dan agar kamu bersyukur."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4485",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4485.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4485.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Tidakkah kalian perhatikan, wahai manusia, bahwa Allah Yang Maha Esa lagi Mahakuasa lah yang telah menundukkan laut, yakni memudahkannya untuk kemaslahatan kamu agar kapal-kapal dapat berlayar di atasnya membawa kamu dan barang-barang keperluanmu hingga ke tempat tujuan dengan izin dan perintah-Nya, dan agar kamu dapat mencari sebagian karunia-Nya, yang berupa hasil laut, seperti ikan dan hasil laut lainnya, dan juga agar kamu bersyukur atas nikmat-nikmat Allah yang di anugerahkan-Nya itu.",
                        "long": "Allah menyatakan bahwa Dia-lah yang menundukkan laut untuk keperluan manusia. Hal ini berarti bahwa Allah menciptakan laut hanyalah untuk manusia. Dalam ayat yang lain diterangkan bahwa Allah menjadikan bumi dan semua isinya untuk manusia.\n\nAllah berfirman:\n\nDialah (Allah) yang menciptakan segala apa yang ada di bumi untukmu kemudian Dia menuju ke langit, lalu Dia menyempurnakannya menjadi tujuh langit. Dan Dia Maha Mengetahui segala sesuatu. (al-Baqarah/2: 29)\n\nKarena itu, ayat ini seakan-akan mendorong manusia berusaha dan berpikir semaksimal mungkin, di mana laut dan segala isinya itu dapat dimanfaatkan untuk berbagi keperluan, demikian pula alam semesta ini. Sebagai contoh dikemukakan beberapa hasil pemikiran manusia yang telah digunakan dalam memanfaatkan lautan, misalnya kapal yang berlayar dari sebuah negeri ke negeri yang lain, mengangkut manusia dan barang-barang keperluan hidup mereka sehari-hari. Tentu saja lalu-lintas di laut itu akan dapat mempererat hubungan antara penduduk suatu negeri dengan penduduk negeri yang lain.\n\nManusia juga dapat memanfaatkan laut ini sebagai sumber penghidupan. Di dalamnya terdapat bahan-bahan yang dapat dijadikan makanan, seperti ikan, rumput-rumput laut, dan sebagainya. Juga terdapat bahan perhiasan seperti mutiara, marjan, dan semacamnya. Air laut dapat diuapkan sehingga menghasilkan garam yang berguna untuk menambah tenaga dan menyedapkan makanan, dan dapat diusahakan menjadi tawar untuk dijadikan air minum dan untuk mengairi tanaman, dan untuk lain-lain.\n\nBatu karang yang beraneka warna dan ragam bentuk dan jenisnya dikeluarkan dari laut, dijadikan kapur untuk bahan bangunan rumah tangga.\n\nPada masa sekarang, semakin banyak yang ditemukan dari dalam laut seperti minyak, besi dan logam yang bermacam-macam. Dalam menghadapi ledakan perkembangan penduduk dewasa ini, orang telah mulai mengarahkan pikirannya ke lautan. Mereka telah mulai memikirkan kemungkinan-kemungkinan memanfaatkan dan menggali hasil lautan sebagai sumber bahan makanan karena produksi bahan makanan di daratan di duga dalam waktu yang tidak lama lagi akan berkurang dan tidak seimbang dengan jumlah dan pertambahan penduduk.\n\nSemua itu adalah karunia Allah yang dianugerahkan kepada manusia sebagai tanda kemurahan-Nya, agar dengan demikian manusia mensyukurinya. Amat banyak lagi karunia Allah yang lain yang belum diketemukan manusia, karena itu hendaklah manusia berusaha dan berpikir bagaimana menemukannya.\n\nAllah menundukkan lautan supaya kapal-kapal dapat berlayar padanya. Salah satu yang merupakan sekian banyak karunia-Nya adalah kemampuan manusia dengan izin Allah untuk menyelam pada kapal selam. Kapal selam, yang kini juga banyak digunakan dalam penelitian, merupakan suatu kendaraan air yang bisa beroperasi di dalam air pada tekanan-tekanan yang mampu ditahan oleh manusia. Kapal selam berada dalam keadaan terapung secara positif dan bobotnya lebih kecil dari volume air yang dipindahkannya. Untuk menyelam secara hidrostatis, suatu kapal harus mendapatkan keterapungan negatif dengan cara menambah bobotnya sendiri atau dengan memperkecil volume air yang dipindahkan. Untuk mengendalikan bobotnya, suatu kapal selam harus dilengkapi dengan tangki ballast yang dapat diisi baik dengan air dari sekelilingnya, atau dengan udara tekan. Untuk gerakan penyelaman dan pengapungan secara umum, maka kapal selam menggunakan tangki maju dan mundur yang dinamakan Tangki Balas Utama (Main Ballast Tank) yang bisa dibuka dan diisi penuh dengan air untuk bisa menyelam atau diisi dengan udara tekan untuk mengapung."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4486,
                    "inSurah": 13
                },
                "meta": {
                    "juz": 25,
                    "page": 499,
                    "manzil": 6,
                    "ruku": 435,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَسَخَّرَ لَكُم مَّا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ جَمِيعًا مِّنْهُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَاتٍ لِّقَوْمٍ يَتَفَكَّرُونَ",
                    "transliteration": {
                        "en": "Wa sakhkhara lakum maa fis samaawaati wa maa fil ardi jamee'am minh; inna feezaalika la Aayaatil liqawminy yatafakkaroon"
                    }
                },
                "translation": {
                    "en": "And He has subjected to you whatever is in the heavens and whatever is on the earth - all from Him. Indeed in that are signs for a people who give thought.",
                    "id": "Dan Dia menundukkan apa yang ada di langit dan apa yang ada di bumi untukmu semuanya (sebagai rahmat) dari-Nya. Sungguh, dalam hal yang demikian itu benar-benar terdapat tanda-tanda (kebesaran Allah) bagi orang-orang yang berpikir."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4486",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4486.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4486.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan hanya Dia Yang Maha Esa lagi Mahakuasa yang dapat menundukkan bagi kemaslahatan kamu apa yang ada di langit, seperti bintang-bintang dan planet-planet serta apa yang ada di bumi, seperti tanah yang subur, air, dan lain-lainnya untuk kemaslahatan kamu semuanya sebagai rahmat dari-Nya. Sesungguhnya, dalam hal yang demikian itu benar-benar terdapat tanda-tanda kekuasaan dan kebesaran Allah bagi orang-orang yang berpikir dan merenungkan ayat-ayat-Nya.",
                        "long": "Selanjutnya Allah menjelaskan bahwa Dia-lah yang menundukkan semua makhluk ciptaan-Nya yang ada di langit dan di bumi agar manusia dapat menggunakan dan memanfaatkannya untuk kepentingan mereka dalam melaksanakan tugas sebagai khalifah Allah di bumi. Hal ini berarti bahwa manusia wajib berusaha mencari manfaat dan kegunaan ciptaan Allah bagi mereka. Kunci dari semuanya adalah kemauan berusaha dan keinginan mengetahui sebagian pengetahuan Allah. Hal ini telah dimulai oleh manusia sejak zaman dahulu sampai sekarang sehingga semakin lama umur bumi ini didiami manusia, semakin banyak pula ilmu Allah yang diketahui manusia dan manfaat alam semesta. Semua ini untuk kepentingan hidup dan kehidupan manusia. Namun, baru sebagian kecil saja dari ilmu Allah yang telah diketahui manusia.\n\nCiptaan Allah yang ada di langit seperti matahari, bulan, bintang-bintang, awan, angin, air hujan, dan ciptaan-Nya yang ada di bumi seperti tumbuh-tumbuhan, binatang, gunung, lautan dan sebagiannya semua diciptakan-Nya di samping sebagai rahmat dan karunia-Nya kepada manusia juga mengandung tanda-tanda kekuasaan dan keagungan-Nya, yang menunjukkan bahwa penciptanya adalah Zat Yang Maha Esa. Tidak ada Tuhan yang lain selain Dia, yang selalu menjaga makhluk-Nya dan tidak layak dipersekutukan dengan sesuatu pun. Kesimpulan seperti ini hanya akan diperoleh oleh hamba Allah yang melakukan pengamatan dengan cermat, menggunakan pikiran yang sehat dan mau mencari kebenaran.\n\nApabila seseorang mau memperhatikan alam semesta, mau memperhatikan hubungan kesatuan satu jenis makhluk dengan makhluk yang lain, tentulah ia akan sampai kepada kesimpulan bahwa masing-masing kesatuan itu ada kaitannya antara yang satu dengan yang lain, tidak dapat lepas atau berdiri sendiri. Terlihat dalam proses terjadinya hujan, erat hubungannya dengan adanya laut, adanya gunung-gunung, adanya panas yang dipancarkan matahari, adanya angin dan sebagainya. Demikian pula perkisaran arah angin ditentukan oleh banyak hal, seperti adanya awan, gunung dan panas matahari.\n\nKapal yang berlayar di laut memerlukan hembusan angin atau bahan bakar seperti batubara atau minyak. Semakin tinggi ilmu pengetahuan seseorang semakin banyak pula ia mengetahui hubungan antara satu makhluk dengan makhluk-makhluk yang lain. Bulan tidak dapat melepaskan lintasannya dari bumi, seolah-olah tertawan oleh bumi, demikian pula bumi dan planet-planet yang lain menjadi tawanan matahari. Planet-planet itu selalu mengitari matahari pada garis edarnya masing-masing. Selanjutnya matahari dan planet-planet yang mengikuti tidak dapat melepaskan diri dari kesatuan yang lebih besar, yaitu Galaksi Bimasakti. Akhirnya Galaksi Bimasakti bersama-sama galaksi-galaksi yang lain terikat pula kepada tata susunan tertentu pula. Maka dengan pemikiran dan penelitian orang akan sampai kepada kesimpulan bahwa penciptanya tentulah Zat Yang Maha Esa lagi Mahakuasa.\n\nAyat di atas sebagaimana banyak ayat senada memperlihatkan bagaimana Allah menundukkan langit dan bumi untuk manusia. Seperti diketahui alam memiliki sifat-sifat fisis yang semuanya merupakan ketetapan Allah, Sunatullah, dan merupakan manifestasi ketertundukan alam. Sebagai contoh, bumi memiliki sifat-sifat fisis seperti kelistrikan, kemagnetan, elastisitas dan kerapatan massa. Dari sifat-sifat fisis tersebut manusia, khususnya para ahli kebumian, dapat mempelajari bumi bahkan sampai jauh menembus bumi. Dengan memanfaatkan sifat elastisitas bumi, manusia bisa menangkap gelombang-gelombang gempa yang menjalar dalam perut bumi dan mengetahui karakter fisis lapisan bumi yang dilaluinya. Dengan gelombang gempa ini manusia dapat mengetahui lapisan-lapisan bumi dari atas hingga inti bumi yang berada sekitar 6000 km di bawah kita. Pada penggunaan praktis, pencarian minyak bumi menggunakan sifat elsatisitas bumi ini yakni dengan mengirim gelombang yang sumbernya berasal 'gempa buatan\", yang di masa lalu menggunakan dinamit.\n\nDi bagian dalam bumi terdapat intibumi, yang bagian luarnya bersifat cair. Inti inilah yang menyebabkan bumi memiliki medan magnet kuat yang berperan penting dalam menjaga kelangsungan kehidupan. Menyebar jauh di atas permukaan, medan magnet ini melindungi bumi dari radiasi yang merusak dan berasal dari angkasa luar. Radiasi dari bintang selain matahari tidak dapat melewati perisai ini, yang disebut dengan nama Sabuk Van Allen. Perisai ini merentang hingga sekitar 18.000 km dari bumi, melindungi bola ini dari energi mematikan. Dalam aspek praktis, dengan mengetahui sifat kemagnetan ini pula para ahli-ahli kebumian mengembangkan metoda-metoda eksplorasi baik mineral maupun minyak bumi. \n\nPernyataan mengenai penciptaan yang dilakukan bukan untuk main-main, banyak di kemukakan dalam banyak ayat Al-Qur'an. Pernyataan inilah yang menjamin bahwa bumi layak huni. Bumi dimudahkan Allah untuk dihuni umat manusia.\n\nDialah yang menjadikan bumi untuk kamu yang mudah dijelajahi. (al-Mulk/67: 15)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4487,
                    "inSurah": 14
                },
                "meta": {
                    "juz": 25,
                    "page": 500,
                    "manzil": 6,
                    "ruku": 435,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قُل لِّلَّذِينَ آمَنُوا يَغْفِرُوا لِلَّذِينَ لَا يَرْجُونَ أَيَّامَ اللَّهِ لِيَجْزِيَ قَوْمًا بِمَا كَانُوا يَكْسِبُونَ",
                    "transliteration": {
                        "en": "Qul lillazeena aamanoo yaghfiroo lillazeena laa yarjoona ayyaamal laahi liyajziya qawmam bimaa kaanoo yaksiboon"
                    }
                },
                "translation": {
                    "en": "Say, [O Muhammad], to those who have believed that they [should] forgive those who expect not the days of Allah so that He may recompense a people for what they used to earn.",
                    "id": "Katakanlah (Muhammad) kepada orang-orang yang beriman hendaklah mereka memaafkan orang-orang yang tidak takut akan hari-hari Allah karena Dia akan membalas suatu kaum sesuai dengan apa yang telah mereka kerjakan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4487",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4487.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4487.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Katakanlah, wahai Nabi Muhammad, kepada orang-orang yang ber iman kepada Allah dan rasul-Nya, hendaklah mereka memaafkan orang-orang yang melakukan perbuatan jahat yang tidak takut akan hari-hari di mana Allah menimpakan siksaan kepada mereka karena Dia akan membalas suatu kaum di akhirat nanti sesuai dengan apa yang telah mereka kerjakan di dunia ini.",
                        "long": "Al-Wahidi dan al-Qusyairi meriwayatkan dari Ibnu 'Abbas bahwa ayat ini turun berhubungan dengan persoalan yang terjadi antara 'Umar bin al-Khaththab dan Abdullah bin Ubay dalam peperangan Bani Musthalik. Mereka singgah di sebuah sumur yang disebut Al-Muraisi', kemudian Abdullah mengutus seorang anak muda mengambil air, tetapi pemuda itu lama sekali kembali, Abdullah bin Ubay bertanya kepada pemuda itu mengapa begitu lama ia baru kembali. Pemuda itu menjawab bahwa Umar duduk di pinggir sumur. Ia tidak membiarkan seorang pun mengambil air sebelum ia mengisi girbai (tempat air dari kulit) Nabi Muhammad saw, girbai Abu Bakar, dan girbai bekas budak Umar, lalu Abdullah bin Ubay berkata, \"Kami dan mereka tidak ubahnya seperti perumpamaan: Gemukkan anjingmu, maka ia akan memakan engkau.\" Kemudian kata-kata Abdullah itu sampai kepada Umar. Beliau menjadi marah, lalu menghunus pedangnya untuk membunuh Abdullah bin Ubay, maka turunlah ayat ini yang melunakkan hati Umar.\n\nSelanjutnya Allah memerintahkan kepada Rasulullah saw dan para pengikutnya agar berlapang dada dalam menghadapi sikap kaum musyrikin dan memaafkan tindakan mereka yang memperolok-olokkan ayat-ayat Allah. Mereka adalah orang yang menentang Allah dan tidak takut kepada ancaman-Nya.\n\nDari ayat ini dipahami nilai budi pekerti yang tinggi yang diajarkan agama Islam kepada penganutnya yaitu berlapang dada dan memaafkan orang-orang yang pernah bertindak tidak baik terhadap dirinya atau berusaha menghancurkan agamanya. Memaafkan kesalahan keluarga, teman sejawat, tetangga dan kenalan dapat dengan mudah dilakukan seseorang, tetapi berlapang dada dan memaafkan perbuatan orang yang selalu ingin merusak diri dan agamanya pada setiap kesempatan memerlukan kebesaran jiwa.\n\nAyat ini mengajarkan dan mendidik kaum Muslimin agar dapat berlapang dada, suka memaafkan, dan berjiwa besar dalam menghadapi segala sesuatu dalam hidupnya.\n\nPada akhir ayat ini Allah menerangkan mengapa Rasulullah saw dan pengikut-pengikutnya harus berlapang dada dan memaafkan tindakan orang Quraisy yang memperolok-olok ayat-ayat Allah itu. Sebabnya ialah karena Allah yang akan memberikan pembalasan yang setimpal kepada mereka sesuai dengan perbuatannya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4488,
                    "inSurah": 15
                },
                "meta": {
                    "juz": 25,
                    "page": 500,
                    "manzil": 6,
                    "ruku": 435,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "مَنْ عَمِلَ صَالِحًا فَلِنَفْسِهِ ۖ وَمَنْ أَسَاءَ فَعَلَيْهَا ۖ ثُمَّ إِلَىٰ رَبِّكُمْ تُرْجَعُونَ",
                    "transliteration": {
                        "en": "Maa 'amila saalihan falinafsihee wa man asaaa'a fa'alaihaa summa ilaa Rabbikum turja'oon"
                    }
                },
                "translation": {
                    "en": "Whoever does a good deed - it is for himself; and whoever does evil - it is against the self. Then to your Lord you will be returned.",
                    "id": "Barangsiapa mengerjakan kebajikan maka itu adalah untuk dirinya sendiri, dan barangsiapa mengerjakan kejahatan, maka itu akan menimpa dirinya sendiri, kemudian kepada Tuhanmu kamu dikembalikan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4488",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4488.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4488.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Pembalasan yang mereka dapatkan ialah bahwa barang siapa mengerjakan kebajikan sekecil apa pun, maka pahala dan ganjarannya itu adalah untuk dirinya sendiri, dan barang siapa mengerjakan kejahatan sekecil apa pun juga, maka dosa dan sanksi amalnya itu akan menimpa dirinya sendiri, kemudian setelah kehidupan dunia ini kepada Tuhanmu kamu di kembalikan.",
                        "long": "Pada ayat ini Allah menjelaskan bahwa tiap-tiap orang akan mendapat balasan masing-masing sesuai dengan amal perbuatannya di dunia. Maka barang siapa di antara hamba-Nya menaati segala perintah-Nya dan menjauhi segala larangan-Nya dengan penuh keikhlasan dan kesadaran, maka hasilnya itu adalah untuk dirinya sendiri. Ia akan memperoleh tempat kembali yang penuh kenikmatan. Sebaliknya barang siapa yang mengingkari perintah-perintah-Nya dan tidak menghentikan larangan-larangan-Nya, maka akibat buruk sebagai balasan perbuatannya itu akan menimpa dirinya sendiri. Ia akan mendapat tempat kembali yang buruk, hina, dan azab yang sangat berat di dalam neraka.\n\nPada akhir ayat ini Allah menerangkan bahwa hanya kepada Allah dikembalikan semua makhluk, tidak kepada yang lain. Semuanya akan dikumpulkan di Padang Mahsyar untuk menerima keputusan yang adil dari Allah. Di antara mereka ada yang berseri-seri wajahnya kegirangan karena ia akan bertemu dengan Allah yang selalu diharapkan selama hidup di dunia. Mereka yakin bahwa Allah mengasihi hamba-Nya yang tabah, sabar dan selalu tunduk dan patuh kepada-Nya. Sebaliknya, ada pula orang yang muram mukanya karena hatinya penuh ketakutan dan penyesalan. Mereka takut menemui Allah karena akan menerima kemurkaan-Nya serta akan merasakan siksaan yang sangat pedih di dalam neraka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4489,
                    "inSurah": 16
                },
                "meta": {
                    "juz": 25,
                    "page": 500,
                    "manzil": 6,
                    "ruku": 435,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَقَدْ آتَيْنَا بَنِي إِسْرَائِيلَ الْكِتَابَ وَالْحُكْمَ وَالنُّبُوَّةَ وَرَزَقْنَاهُم مِّنَ الطَّيِّبَاتِ وَفَضَّلْنَاهُمْ عَلَى الْعَالَمِينَ",
                    "transliteration": {
                        "en": "Wa laqad aatainaa Baneee Israaa'eelal Kitaaba walhukma wan Nubuwwata wa razaqnaahum minat taiyibaati wa faddalnaahum;alal 'aalameen"
                    }
                },
                "translation": {
                    "en": "And We did certainly give the Children of Israel the Scripture and judgement and prophethood, and We provided them with good things and preferred them over the worlds.",
                    "id": "Dan sungguh, kepada Bani Israil telah Kami berikan Kitab (Taurat), kekuasaan dan kenabian, Kami anugerahkan kepada mereka rezeki yang baik dan Kami lebihkan mereka atas bangsa-bangsa (pada masa itu)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4489",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4489.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4489.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan sungguh, kepada Bani Israil telah Kami berikan Kitab, yaitu Taurat, Injil, dan Zabur masing-masing melalui Nabi Musa, Nabi Isa, dan Nabi Daud, kekuasaan, syariat dan ketetapan hukum, dan kenabian, yaitu Kami jadikan sebahagian di antara mereka sebagai nabi. Kami anugerahkan kepada mereka aneka macam rezeki yang baik-baik, seperti al-mann dan al-salwa, dan Kami lebihkan mereka atas seluruh alam, yakni atas bangsa-bangsa lain pada masa itu.",
                        "long": "Dalam ayat ini Allah menerangkan bahwa Bani Israil telah diberi Kitab Taurat, kemampuan memahami agama, kenabian, rezeki yang berlimpah dan keutamaan yang melebihi bangsa-bangsa lain pada masanya itu.\n\nAnugerah yang diberikan Allah kepada Bani Israil pada waktu itu adalah seimbang dengan sikap dan usaha Bani Israil menegakkan agama Allah. Karena itu, keutamaan yang diberikan itu juga merupakan keutamaan dunia dan akhirat. Dalam ayat yang ini disebutkan enam macam anugerah yang telah diberikan kepada mereka, yaitu:\n\nPertama : Kitab Taurat.\n\nKitab ini diturunkan kepada Nabi Musa. Di dalamnya terdapat petunjuk, pelajaran dan ketentuan-ketentuan yang dapat membimbing Bani Israil ke jalan yang benar. Kitab ini khusus diturunkan Allah untuk Bani Israil.\n\nKedua : Kemampuan memahami agama Allah.\n\nDengan kemampuan ini, Musa, Harun beserta pemimpin kaumnya dapat menjelaskan persengketaan yang terjadi di antara kaumnya dan dengan kemampuan ini pula dapat diterangkan agama Allah kepada Bani Israil dengan baik.\n\nKetiga : Kenabian\n\nBanyak di antara para rasul dan para nabi yang diutus Allah diangkat dari Bani Israil; ada di antara mereka sebagai Nabi saja seperti Nabi Khidir, ada pula sebagai nabi dan rasul seperti Musa, Harun, Ayyub, dan lain-lain, dan ada pula nabi dan rasul yang diangkat dari kalangan mereka di samping bertugas sebagai nabi dan rasul, juga sebagai kepala negara seperti Nabi Daud dan Nabi Sulaiman. Dengan demikian, terhimpunlah kekuasaan dunia dan agama pada mereka.\n\nKeempat : Rezeki yang berlimpah-limpah\n\nBani Israil telah dianugerahi Allah masa kejayaan dan keemasan pada masa-masa pemerintahan Nabi Daud dan pada masa pemerintahan putranya Sulaiman. Banyak kisah yang menceritakan keagungan dan kejayaan Bani Israil pada masa kedua pemerintahan anak dan bapak itu. Kekuasaan dan kebijaksanaan Nabi Daud dan Nabi Sulaiman diterangkan dalam Al-Qur'an. Apa yang pernah dicapai Bani Israil pada waktu itu tidak diperoleh oleh bangsa lain yang sezaman dengannya.\n\nKelima : Keutamaan mereka yang melebihi bangsa-bangsa lain pada zamannya yaitu pada zaman Nabi Daud dan Nabi Sulaiman.\n\nKeenam:Allah telah memberikan kepada mereka hukum-hukum dan ajaran-ajaran yang diperkuat dengan mukjizat-mukjizat. Hal ini yang mendorong mereka untuk bersatu dan mereka tidak berselisih melainkan hanya perselisihan yang ringan yang tidak membawa kemudaratan. Akan tetapi tatkala datang ilmu kepada mereka, mereka berselisih sebagaimana dinyatakan dalam firman Allah tersebut di atas. Perselisihan di antara mereka itu timbul setelah datang hujjah (argumen) yang nyata karena perebutan soal pimpinan dan kedengkian di antara mereka.\n\nSehubungan dengan keutamaan yang diperoleh Bani Israil ini, Ibnu 'Abbas pernah berkata, \"Tidak ada seorang pun di antara orang-orang di dunia ini yang dicintai Allah melebihi mereka itu.\" Allah telah menampakkan tanda-tanda kekuasaan-Nya yang dapat dilihat, didengar, dan dipahami mereka. Mereka pun mengikuti segala petunjuk Allah. Demikian keadaan Bani Israil pada zaman itu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4490,
                    "inSurah": 17
                },
                "meta": {
                    "juz": 25,
                    "page": 500,
                    "manzil": 6,
                    "ruku": 435,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَآتَيْنَاهُم بَيِّنَاتٍ مِّنَ الْأَمْرِ ۖ فَمَا اخْتَلَفُوا إِلَّا مِن بَعْدِ مَا جَاءَهُمُ الْعِلْمُ بَغْيًا بَيْنَهُمْ ۚ إِنَّ رَبَّكَ يَقْضِي بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ",
                    "transliteration": {
                        "en": "Wa aatainaahum baiyinaatim minal amri famakh talafooo illaa mim ba'di maa jaaa'ahumul 'ilmu baghyam bainahum; inna Rabbaka yaqdee bainahum Yawmal Qiyaamati feemaa kaanoo feehi yakhtalifoon"
                    }
                },
                "translation": {
                    "en": "And We gave them clear proofs of the matter [of religion]. And they did not differ except after knowledge had come to them - out of jealous animosity between themselves. Indeed, your Lord will judge between them on the Day of Resurrection concerning that over which they used to differ.",
                    "id": "Dan Kami berikan kepada mereka keterangan-keterangan yang jelas tentang urusan (agama); maka mereka tidak berselisih kecuali setelah datang ilmu kepada mereka, karena kedengkian (yang ada) di antara mereka. Sungguh, Tuhanmu akan memberi putusan kepada mereka pada hari Kiamat terhadap apa yang selalu mereka perselisihkan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4490",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4490.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4490.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan juga Kami telah berikan kepada mereka keterangan-keterangan, sebagai bukti-bukti yang jelas tentang urusan agama; maka sangat buruk sikap mereka karena mereka tidak berselisih kecuali setelah datang kepada mereka ilmu, pengetahuan yang sebenarnya dapat menyatukan mereka. Perselisihan mereka itu terjadi karena kedengkian yang ada di antara me-reka. Sungguh, Tuhanmu, yang memelihara dan membimbingmu, wahai Nabi Muhammad, akan memberi putusan kepada mereka pada hari Kiamat terhadap apa yang selalu mereka perselisihkan sewaktu mereka hidup di dunia.",
                        "long": "Pada ayat ini, dijelaskan keutamaan yang keenam yang pernah diberikan Allah kepada Bani Israil yaitu bahwa Allah telah memberikan kepada mereka kemampuan memahami dalil-dalil dan keterangan-keterangan tentang agama. Keterangan itu adakalanya berupa hukum, peringatan, dan ada pula yang berupa mukjizat. Semua dipahami dan dilaksanakan dengan baik sehingga kehidupan mereka menjadi baik, tidak terjadi perselisihan sesama mereka dan ikatan masyarakat mereka menjadi baik pula, karena itu banyak usaha besar yang dapat mereka lakukan waktu itu.\n\nSebenarnya ketentuan seperti di atas tidak saja berlaku bagi Bani Israil, tetapi juga berlaku bagi semua bangsa yang mau melaksanakan perintah-perintah Allah dan menjauhkan larangan-Nya serta tunduk, patuh dan berserah diri kepada-Nya. Jika demikian, maka kebahagiaan yang diperoleh tidak saja berupa kebahagiaan dunia, tetapi juga kebahagiaan akhirat. Seakan-akan dengan ayat ini Allah mengingatkan manusia agar mencontoh kehidupan Bani Israil pada zaman dahulu itu.\n\nPada akhir ayat ini Allah menerangkan sebab-sebab terjadinya perselisihan di kalangan Bani Israil yang datang kemudian. Nabi-nabi mereka dahulu pernah menerangkan bahwa akan datang Nabi penutup nanti, yang diutus kepada semua manusia. Nabi itu termasuk keturunan Ibrahim dari anaknya Ismail. Setelah Nabi yang dimaksud itu datang dan memberikan keterangan sesuai dengan keterangan yang disampaikan nabi-nabi mereka dahulu, mereka pun mengingkarinya, dan tidak mempercayainya. Kedengkian itu timbul karena Nabi yang diutus itu bukan dari keturunan Ishak, dan mereka menganggap bahwa keturunan Ishak lebih mulia dari keturunan Ismail walaupun keduanya adalah saudara seayah (Nabi Ibrahim). Karena itu, tidak pantas nabi dan rasul terakhir diangkat dari keturunannya. Allah berfirman:\n\nDan mereka (Ahli Kitab) tidak berpecah belah kecuali setelah datang kepada mereka ilmu (kebenaran yang disampaikan oleh para nabi) karena kedengkian antara sesama mereka. (asy-Syura/42: 14)\n\nMengenai masalah yang mereka persengketakan itu, Allah akan memberikan keputusan-Nya pada hari Kiamat dan akan menjelaskan alasan yang sebenarnya yang menyebabkan terjadinya perselisihan di antara mereka. Pada saat itu, tampak dengan jelas hasad dan kedengkian mereka, yang menjurus kepada fanatik golongan sehingga nikmat yang semula harus disyukuri, malah menjadikan mereka sombong dan takabur."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4491,
                    "inSurah": 18
                },
                "meta": {
                    "juz": 25,
                    "page": 500,
                    "manzil": 6,
                    "ruku": 435,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "ثُمَّ جَعَلْنَاكَ عَلَىٰ شَرِيعَةٍ مِّنَ الْأَمْرِ فَاتَّبِعْهَا وَلَا تَتَّبِعْ أَهْوَاءَ الَّذِينَ لَا يَعْلَمُونَ",
                    "transliteration": {
                        "en": "Summa ja'alnaaka 'alaa sharee'atim minal amri fattabi'haa wa laa tattabi'ahwaaa'al-lazeena laa ya'lamoon"
                    }
                },
                "translation": {
                    "en": "Then We put you, [O Muhammad], on an ordained way concerning the matter [of religion]; so follow it and do not follow the inclinations of those who do not know.",
                    "id": "Kemudian Kami jadikan engkau (Muhammad) mengikuti syariat (peraturan) dari agama itu, maka ikutilah (syariat itu) dan janganlah engkau ikuti keinginan orang-orang yang tidak mengetahui."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4491",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4491.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4491.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Kemudian setelah terjadi perselisihan di antara mereka, Kami jadikan engkau, wahai Nabi Muhammad, mengikuti syariat peraturan dari agama itu yang mengantarkan engkau kepada kebenaran, maka ikutilah, yakni laksanakanlah syariat yang diturunkan kepadamu itu dan janganlah engkau ikuti keinginan orang-orang kafir Quraisy dan orang-orang yang ingkar seperti mereka yang tidak mengetahui kebenaran, ke-Esaan Allah, dan syariat yang di turunkan kepadamu.",
                        "long": "Kemudian Allah memerintahkan kepada Rasulullah saw agar jangan terpengaruh oleh sikap orang-orang Quraisy karena Allah telah menetapkan urusan syariat yang harus dijadikan pegangan dalam menetapkan urusan agama dengan perantara wahyu. Maka peraturan yang termuat dalam wahyu itulah yang harus diikuti, tidak boleh mengikuti hawa nafsu orang-orang yang tidak mengetahuinya. Syariat yang dibawa oleh para rasul terdahulu dan syariat yang dibawa Nabi Muhammad pada asas dan hakikatnya sama, sama-sama berasaskan tauhid, membimbing manusia ke jalan yang benar, mewujudkan kemaslahatan dalam masyarakat, menyuruh berbuat baik dan mencegah berbuat mungkar. Jika terdapat perbedaan, maka perbedaan itu bukan masalah pokok, hanya dalam pelaksanaan ibadah dan cara-caranya. Hal itu disesuaikan dengan keadaan, tempat dan waktu."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4492,
                    "inSurah": 19
                },
                "meta": {
                    "juz": 25,
                    "page": 500,
                    "manzil": 6,
                    "ruku": 435,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "إِنَّهُمْ لَن يُغْنُوا عَنكَ مِنَ اللَّهِ شَيْئًا ۚ وَإِنَّ الظَّالِمِينَ بَعْضُهُمْ أَوْلِيَاءُ بَعْضٍ ۖ وَاللَّهُ وَلِيُّ الْمُتَّقِينَ",
                    "transliteration": {
                        "en": "Innahum lany yughnoo 'anka minal laahi shai'aa; wa innaz zaalimeena ba'duhum awliyaaa'u ba'dinw wallaahu waliyyul muttaqeen"
                    }
                },
                "translation": {
                    "en": "Indeed, they will never avail you against Allah at all. And indeed, the wrongdoers are allies of one another; but Allah is the protector of the righteous.",
                    "id": "Sungguh, mereka tidak akan dapat menghindarkan engkau sedikit pun dari (azab) Allah. Dan sungguh, orang-orang yang zalim itu sebagian menjadi pelindung atas sebagian yang lain, sedangkan Allah pelindung bagi orang-orang yang bertakwa."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4492",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4492.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4492.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Sungguh, mereka yang kafir dan tidak mengikuti kebenaran itu tidak akan dapat menghindarkan engkau, wahai Nabi Muhammad, sedikit pun dari azab Allah. Dan sungguh, orang-orang yang zalim itu sebagian mereka menjadi pelindung atas sebagian yang lain dalam melakukan perbuatan dosa, sedangkan Allah pelindung bagi orang-orang yang bertakwa.",
                        "long": "Pada ayat ini Allah menjelaskan bahwa orang-orang musyrik tidak mengetahui syariat Allah dan tidak mengakui keesaan-Nya. Karenanya mereka tidak akan dapat menolak atau menghindari azab Allah yang ditimpakan kepada mereka di akhirat.\n\nKemudian diterangkan bahwa orang-orang musyrik itu saling menolong antara yang satu dengan yang lain dalam melakukan kemungkaran dan kemaksiatan. Ditegaskan bahwa tipu muslihat mereka dijalankan dengan bersekongkol untuk merintangi dan merusak agama Islam dan memecah belah kaum Muslimin. Hal seperti ini dapat mereka lakukan selama hidup di dunia saja, sedangkan di akhirat nanti hal itu tidak dapat mereka lakukan. Pada hari itu, seseorang tidak dapat menolong orang lain dan tidak dapat menanggung dosa orang lain; tiap-tiap orang bertanggung jawab terhadap perbuatannya sendiri-sendiri.\n\nPada akhir ayat, Allah menegaskan bahwa Dia pelindung orang yang bertakwa. Takwa yang mereka lakukan untuk mencari keridaan Allah itu dibalas oleh-Nya dengan pahala yang berlipat ganda di akhirat."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4493,
                    "inSurah": 20
                },
                "meta": {
                    "juz": 25,
                    "page": 500,
                    "manzil": 6,
                    "ruku": 435,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هَٰذَا بَصَائِرُ لِلنَّاسِ وَهُدًى وَرَحْمَةٌ لِّقَوْمٍ يُوقِنُونَ",
                    "transliteration": {
                        "en": "Haazaa basaaa'iru linnaasi wa hudanw wa rahmatul liqawminy yooqinoon"
                    }
                },
                "translation": {
                    "en": "This [Qur'an] is enlightenment for mankind and guidance and mercy for a people who are certain [in faith].",
                    "id": "(Al-Qur'an) ini adalah pedoman bagi manusia, petunjuk dan rahmat bagi kaum yang meyakini."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4493",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4493.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4493.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Wahyu berupa Al-Qur’an ini dan tuntunan yang diturunkan kepadamu adalah pedoman dan bukti bagi manusia, petunjuk dan rahmat bagi kaum yang meyakini adanya Tuhan Yang Maha Esa.",
                        "long": "Pada ayat ini, Allah menerangkan bahwa Al-Qur'an itu adalah pedoman hidup bagi manusia, petunjuk dan rahmat yang dikaruniakan kepada hamba-Nya yang meyakininya.\n\nAl-Qur'an disebut pedoman karena di dalamnya terdapat dalil-dalil dan keterangan-keterangan agama yang sangat mereka perlukan untuk kesejahteraan manusia di dunia dan kebahagiaan mereka di akhirat. Petunjuk dan rahmat Allah itu hanya akan dapat dirasakan oleh orang-orang yang benar-benar yakin dan percaya kepada Allah dan Rasul-Nya dalam melaksanakan isi Al-Qur'an."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4494,
                    "inSurah": 21
                },
                "meta": {
                    "juz": 25,
                    "page": 500,
                    "manzil": 6,
                    "ruku": 435,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَمْ حَسِبَ الَّذِينَ اجْتَرَحُوا السَّيِّئَاتِ أَن نَّجْعَلَهُمْ كَالَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ سَوَاءً مَّحْيَاهُمْ وَمَمَاتُهُمْ ۚ سَاءَ مَا يَحْكُمُونَ",
                    "transliteration": {
                        "en": "Am hasibal lazeenaj tarahus saiyiaati an naj'alahum kallazeena aamanoo wa 'amilu saalihaati sawaaa'am mahyaahum wa mamaatuhum; saaa'a maa yahkumoon"
                    }
                },
                "translation": {
                    "en": "Or do those who commit evils think We will make them like those who have believed and done righteous deeds - [make them] equal in their life and their death? Evil is that which they judge.",
                    "id": "Apakah orang-orang yang melakukan kejahatan itu mengira bahwa Kami akan memperlakukan mereka seperti orang-orang yang beriman dan yang mengerjakan kebajikan, yaitu sama dalam kehidupan dan kematian mere-ka? Alangkah buruknya penilaian mereka itu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4494",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4494.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4494.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Allah kemudian mempertanyakan sikap orang-orang kafir Apakah orang-orang yang melakukan kejahatan itu di dunia ini mengira bahwa Kami akan memperlakukan mereka di akhirat kelak sama seperti orang-orang yang ber iman dan yang mengerjakan kebajikan, yaitu sama dalam kehidupan dan kematian mereka? Tentulah tidak sama. Alangkah buruknya penilaian mereka itu.",
                        "long": "Allah memerintahkan Rasul-Nya agar menanyakan kepada orang-orang kafir Mekah tentang persengketaan mereka dengan maksud menyangkal dugaan mereka. Mereka menduga bahwa Allah akan memperlakukan dan akan memberikan balasan yang sama kepada mereka seperti yang diberikan kepada orang-orang yang beriman. Apakah Allah akan mempersamakan orang yang beriman kepada-Nya tetapi tidak melaksanakan syariat-Nya dengan orang yang beriman yang melakukan syariat-Nya. Jawabannya tentu, tidak, sekali-kali tidak, sebagaimana firman Allah:\n\nTidak sama para penghuni neraka dengan para penghuni-penghuni surga; penghuni-penghuni surga itulah orang-orang yang memperoleh kemenangan. (al-hasyr/59: 20)\n\nDalam ayat-ayat lain, diterangkan bahwa tidaklah sama orang-orang yang beriman yang melaksanakan perintah-perintah Allah dan menjauhkan larangan-larangan-Nya dengan orang-orang fasik, yaitu orang yang beriman dan mengakui adanya perintah-perintah dan adanya larangan Allah, tetapi tidak melaksanakannya, Allah berfirman:\n\nMaka apakah orang yang beriman seperti orang yang fasik (kafir)? Mereka tidak sama. (as-Sajdah/32: 18)\n\nPada akhir ayat ini, Allah menegaskan bahwa semua dugaan dan sangkaan orang-orang kafir itu adalah dugaan dan sangkaan yang tidak benar dan mustahil terjadi. Karena itu, hendaklah kaum Muslimin waspada terhadap sangkaan itu sehingga tidak terpengaruh olehnya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4495,
                    "inSurah": 22
                },
                "meta": {
                    "juz": 25,
                    "page": 500,
                    "manzil": 6,
                    "ruku": 436,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَخَلَقَ اللَّهُ السَّمَاوَاتِ وَالْأَرْضَ بِالْحَقِّ وَلِتُجْزَىٰ كُلُّ نَفْسٍ بِمَا كَسَبَتْ وَهُمْ لَا يُظْلَمُونَ",
                    "transliteration": {
                        "en": "Wa khalaqal laahus samaawaati wal arda bilhaqqi wa litujzaa kullu nafsim bimaa kasabat wa hum laa yuzlamoon"
                    }
                },
                "translation": {
                    "en": "And Allah created the heavens and earth in truth and so that every soul may be recompensed for what it has earned, and they will not be wronged.",
                    "id": "Dan Allah menciptakan langit dan bumi dengan tujuan yang benar dan agar setiap jiwa diberi balasan sesuai dengan apa yang dikerjakannya, dan mereka tidak akan dirugikan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4495",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4495.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4495.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan Allah menciptakan langit dan bumi dengan tujuan yang benar, yakni penuh hikmah dan aturan untuk menunjukkan ke-Esaan dan kekuasaan-Nya, dan agar setiap jiwa, yakni manusia, diberi balasan sesuai dengan apa, yakni amal yang dikerjakannya, dan mereka tidak akan di rugikan dalam menerima balasan amalnya itu.",
                        "long": "Allah menjelaskan bahwa langit dan bumi diciptakan dengan benar, dan memiliki tujuan penciptaan sesuai dengan kehendaknya. Tidak ada satu bendapun diadakan Tuhan tanpa mempunyai tujuan. Tujuan kehadiran satu ciptaan adalah untuk dimanfaatkan oleh ciptaan yang lain, dalam rangka mencapai tujuan ciptaan yang lain itu. Apabila suatu kegiatan tidak memiliki tujuan, maka yang terjadi adalah la'ib, permainan. Kata sebaliknya bathil, kebalikan kata haq banyak digunakan untuk menjelaskan hal yang sama, sebagaimana ayat di bawah: \n\nDan Kami tidak menciptakan langit dan bumi dan apa yang ada di antara keduanya dengan sia-sia. Itu anggapan orang-orang kafir, maka celakalah orang-orang yang kafir itu karena mereka akan masuk neraka. (shad/38: 27)\n\nSeperti yang kita saksikan, sifat fisis bumi, seperti massa, struktur, suhu, dan seterusnya begitu tepat bagi kehidupan. Namun, sifat-sifat itu saja tidak cukup untuk memungkinkan adanya kehidupan di bumi, faktor penting lain adalah susunan atmosfer [lihat Surah Ibrahim/14:19 dan Surah al-Jatsiyah/45: 3].\n\nTidak ada satu pun kekuatan lain yang dapat mengubah kehendak Allah. Ketentuan yang demikian berlaku bagi seluruh ciptaan-Nya sesuai dengan keadilan dan sunah-Nya. Di antara keadilan Allah ialah memberikan balasan yang setimpal kepada para hamba-Nya atas amal dan perbuatannya pada hari pembalasan.\n\nBarang siapa yang melakukan perbuatan yang baik akan menerima ganjarannya sesuai dengan ketentuan yang telah ditetapkan-Nya, demikian pula barang siapa yang melakukan perbuatan jahat akan menerima balasan yang setimpal dengan perbuatan jahatnya itu.\n\nMengapa dikatakan bahwa pemberian balasan yang setimpal itu sesuai dengan keadilan Allah. Karena Allah menciptakan manusia sebagai makhluk-Nya, dilengkapi dengan kecenderungan dan kemampuan untuk berbuat baik dan berbuat jahat. Kedua-duanya atau salah satu daripada kedua potensi itu dapat berkembang pada diri seseorang. Perkembangannya itu banyak ditentukan oleh keadaan, lingkungan, dan waktu. Di samping itu, Allah menganugerahi manusia akal pikiran. Dengan akal pikirannya itu manusia mempunyai kesanggupan-kesanggupan untuk menilai rangsangan-rangsangan yang mempengaruhi tindakan dan perilakunya. Sebelum seseorang menentukan sikap untuk melakukan suatu perbuatan atau tidak melakukannya, maka dalam dirinya terjadi gejolak dalam mempertimbangkan dan menetapkan suatu pilihan, sikap mana atau tindakan mana yang akan diambilnya dari kedua tindakan itu.\n\nPada saat-saat yang demikian itu, manusia diberi kemerdekaan memilih antara yang baik dan yang buruk. Dalam pergolakan yang demikian, maka jiwa manusia mendapat tekanan-tekanan yang disebut tekanan-tekanan kejiwaan. Apabila ia memilih dan memutuskan melakukan suatu kebaikan, maka perbuatan itu terjadi berdasarkan pilihannya sendiri. Bila ia memilih keputusan melakukan keburukan, maka itu pun terjadi karena pilihannya sendiri pula. Saat-saat yang seperti itu adalah saat-saat yang menentukan apakah ia sengaja melakukan suatu perbuatan atau ia tidak sengaja melakukannya. Dan juga membedakan antara perbuatan yang dilakukan; apakah perbuatan itu dilakukan dengan sadar atau tidak. Itulah sebabnya dikatakan bahwa balasan Allah terhadap hamba-Nya sesuai dengan amal dan perbuatannya, itulah gambaran keadilan Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4496,
                    "inSurah": 23
                },
                "meta": {
                    "juz": 25,
                    "page": 501,
                    "manzil": 6,
                    "ruku": 436,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "أَفَرَأَيْتَ مَنِ اتَّخَذَ إِلَٰهَهُ هَوَاهُ وَأَضَلَّهُ اللَّهُ عَلَىٰ عِلْمٍ وَخَتَمَ عَلَىٰ سَمْعِهِ وَقَلْبِهِ وَجَعَلَ عَلَىٰ بَصَرِهِ غِشَاوَةً فَمَن يَهْدِيهِ مِن بَعْدِ اللَّهِ ۚ أَفَلَا تَذَكَّرُونَ",
                    "transliteration": {
                        "en": "Afara'ayta manit takhaza ilaahahoo hawaahu wa adal lahul laahu 'alaa 'ilminw wa khatama 'alaa sam'ihee wa qalbihee wa ja'ala 'alaa basarihee ghishaawatan famany yahdeehi mim ba'dil laah; afalaa tazakkaroon"
                    }
                },
                "translation": {
                    "en": "Have you seen he who has taken as his god his [own] desire, and Allah has sent him astray due to knowledge and has set a seal upon his hearing and his heart and put over his vision a veil? So who will guide him after Allah? Then will you not be reminded?",
                    "id": "Maka pernahkah kamu melihat orang yang menjadikan hawa nafsunya sebagai tuhannya dan Allah membiarkannya sesat dengan sepengetahuan-Nya, dan Allah telah mengunci pendengaran dan hatinya serta meletakkan tutup atas penglihatannya? Maka siapa yang mampu memberinya petunjuk setelah Allah (membiarkannya sesat?) Mengapa kamu tidak mengambil pelajaran?"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4496",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4496.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4496.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka pernahkah kamu, wahai Nabi Muhammad, melihat dan menyaksikan orang yang menyimpang dari fitrahnya dengan menjadikan hawa nafsunya sebagai tuhannya, dengan mengikuti dan menurutinya dan Allah membiarkannya sesat dan larut dalam kesesatannya itu dengan sepengetahuan-Nya, yakni ilmu Allah Yang Mahaluas, dan Allah telah mengunci pendengaran sehingga mereka tidak dapat mendengar kebenaran dan mengunci hatinya sehingga dia enggan meyakini kebenaran serta meletakkan tutup atas penglihatannya sehingga tidak dapat melihat bukti-bukti ke-Esaan Allah di muka bumi ini? Maka siapakah yang mampu memberinya petunjuk setelah Allah berpaling dan membiarkannya sesat? Mengapa kamu, wahai kaum musyrik atau siapa pun juga, tidak meng-ambil pelajaran dari apa yang terjadi pada orang-orang yang sesat itu?",
                        "long": "Muqatil mengatakan bahwa ayat ini turun berhubungan dengan peristiwa percakapan Abu Jahal dengan al-Walid bin al-Mugirah. Pada suatu malam Abu Jahal tawaf di Baitullah bersama Walid. Kedua orang itu membicarakan keadaan Nabi Muhammad. Abu Jahal berkata, \"Demi Allah, sebenarnya aku tahu bahwa Muhammad itu adalah orang yang benar. \"Al-Walid berkata kepadanya, \"Biarkan saja, apa pedulimu dan apa alasan pendapatmu itu?\" Abu Jahal menjawab, \"Hai Abu Abdisy Syams, kita telah menamainya orang yang benar, jujur, dan terpercaya dimasa mudanya, tetapi sesudah ia dewasa dan sempurna akalnya, kita menamakannya pendusta lagi pengkhianat. Demi Allah, sebenarnya aku tahu bahwa dia itu adalah benar.\" Al-Walid berkata, \"Apakah gerangan yang menghalangimu untuk membenarkan dan mempercayai seruannya?\" Abu Jahal menjawab, \"Nanti gadis-gadis Quraisy akan menggunjingkan bahwa aku pengikut anak yatim Abu thalib, padahal aku dari suku yang paling tinggi. Demi Al-Lata da Al-Uzza, saya tidak akan menjadi pengikutnya selama-lamanya.\" Kemudian turunlah ayat ini.\n\nSelanjutnya, pada ayat ini Allah menerangkan keadaan orang-orang kafir Mekah yang sedang tenggelam dalam perbuatan jahat. Semua yang mereka lakukan itu disebabkan oleh dorongan hawa nafsunya karena telah tergoda oleh tipu daya setan. Tidak ada lagi nilai-nilai kebenaran yang mendasari tingkah laku dan perbuatan mereka. Apa yang baik menurut hawa nafsu mereka itulah yang mereka perbuat. Seakan-akan mereka menganggap hawa nafsu mereka itu sebagai tuhan yang harus mereka ikuti perintahnya.\n\nMereka telah lupa bahwa kehadiran mereka di dunia yang fana ini ada maksud dan tujuannya. Ada misi yang harus mereka bawa yaitu sebagai khalifah Allah di muka bumi. Mereka telah menyia-nyiakan kedudukan yang diberikan Allah kepada mereka sebagai makhluk Tuhan yang paling baik bentuknya dan mempunyai kemampuan yang paling baik pula. Mereka tidak menyadari bahwa mereka harus mempertanggungjawabkan semua perbuatannya kepada Allah kelak dan bahwa Allah akan membalas setiap perbuatan dengan balasan yang setimpal. Inilah yang dimaksud dengan firman Allah:\n\nMaka barang siapa mengerjakan kebaikan seberat zarrah, niscaya dia akan melihat (balasan)nya, dan barang siapa mengerjakan kejahatan seberat zarrah, niscaya dia akan melihat (balasan)nya. (az-Zalzalah/99: 7-8)\n\nSebenarnya hawa nafsu yang ada pada manusia itu merupakan anugerah yang tidak ternilai harganya yang diberikan Allah kepada manusia. Di samping Allah memberikan akal dan agama kepada manusia agar dengan keduanya manusia dapat mengendalikan hawa nafsunya. Jika seseorang mengendalikan hawa nafsunya sesuai dengan pertimbangan akal yang sehat dan tidak bertentangan dengan tuntunan agama, maka orang yang demikian itu telah berbuat sesuai dengan fitrahnya. Tetapi apabila seseorang memperturutkan hawa nafsunya tanpa pertimbangan akal yang sehat dan tidak lagi berpedoman kepada tuntutan agama, maka orang itu telah diperbudak oleh hawa nafsunya. Hal itu berarti bahwa ia telah berbuat menyimpang dari fitrahnya dan terjerumus dalam kesesatan.\n\nBerdasarkan keterangan di atas, maka dalam mengikuti hawa nafsunya, manusia terbagi atas dua kelompok. Kelompok pertama ialah kelompok yang dapat mengendalikan hawa nafsunya; mereka itulah orang yang bertakwa. Sedangkan kelompok kedua ialah orang yang dikuasai hawa nafsunya. Mereka itulah orang-orang yang berdosa dan selalu bergelimang dalam lumpur kejahatan.\n\nIbnu 'Abbas berkata, \"Setiap kali Allah menyebut hawa nafsu dalam Al-Qur'an, setiap kali itu pula Ia mencelanya.\" Allah berfirman:\n\nDan sekiranya Kami menghendaki niscaya Kami tinggikan (derajat)nya dengan (ayat-ayat) itu, tetapi dia cenderung kepada dunia dan mengikuti keinginannya (yang rendah), maka perumpamaannya seperti anjing, jika kamu menghalaunya dijulurkan lidahnya dan jika kamu membiarkannya dia menjulurkan lidahnya (juga). Demikianlah perumpamaan orang-orang yang mendustakan ayat-ayat Kami. Maka ceritakanlah kisah-kisah itu agar mereka berpikir. (al-A'raf/7: 176)\n\nPada ayat lain :\n\nDan janganlah engkau mengikuti hawa nafsu, karena akan menyesatkan engkau dari jalan Allah. (shad/38: 26)\n\nDalam ayat ini, Allah memuji orang-orang yang dapat menguasai hawa nafsunya dan menjanjikan baginya tempat kembali yang penuh kenikmatan. Allah berfirman:\n\nDan adapun orang-orang yang takut kepada kebesaran Tuhannya dan menahan diri dari (keinginan) hawa nafsunya, maka sungguh, surgalah tempat tinggal(nya). (an-Nazi'at/79: 40-41)\n\nBanyak hadis-hadis Nabi saw yang mencela orang-orang yang memperturutkan hawa nafsunya. Diriwayatkan oleh 'Abdullah bin 'Amr bin 'As bahwa Nabi saw berkata.\n\nTidak beriman seseorang dari antara kamu sehingga hawa nafsunya itu tunduk kepada apa yang saya bawa (petunjuk).(Riwayat al-Khathib al-Bagdadi)\n\nSyaddad bin Aus meriwayatkan hadis dari Nabi saw :\n\n‡)\n\nOrang yang cerdik ialah orang yang menguasai hawa nafsunya dan berbuat untuk kepentingan masa sesudah mati. Tetapi orang yang zalim ialah orang yang memperturutkan hawa nafsunya dan mengharap-harap sesuatu yang mustahil dari Allah. (Riwayat at-Tirmidhi dan Ibnu Majah)\n\nOrang yang selalu memperturutkan hawa nafusnya biasanya kehilangan kontrol dirinya. Itulah sebabnya ia terjerumus dalam kesesatan karena ia tidak mau memperhatikan petunjuk yang diberikan kepadanya, dan akibat perbuatan jahat yang telah dilakukannya karena memperturutkan hawa nafsu.\n\nKeadaan orang yang memperturutkan hawa nafsunya itu diibaratkan seperti orang yang terkunci mati hatinya sehingga tidak mampu lagi menilai mana yang baik mana yang buruk, dan seperti orang yang telinganya tersumbat sehingga tidak mampu lagi memperhatikan tanda-tanda kekuasaan Allah yang terdapat di langit dan di bumi, dan seperti orang yang matanya tertutup tidak dapat melihat dan mengetahui kebenaran adanya Allah Yang Maha Pencipta segala sesuatu.\n\nSelanjutnya, Allah memerintahkan kepada Rasul-Nya agar tidak membenarkan sikap orang-orang kafir Mekah dengan mengatakan bahwa tidak ada kekuasaan yang akan memberikan petunjuk selain Allah setelah mereka tersesat dari jalan yang lurus. \n\nPada akhir ayat ini, Allah mengingatkan mereka mengapa mereka tidak mengambil pelajaran dari alam semesta, kejadian pada diri mereka sendiri, dan azab yang menimpa umat-umat terdahulu sebagai bukti bahwa Allah Mahakuasa lagi berhak disembah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4497,
                    "inSurah": 24
                },
                "meta": {
                    "juz": 25,
                    "page": 501,
                    "manzil": 6,
                    "ruku": 436,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقَالُوا مَا هِيَ إِلَّا حَيَاتُنَا الدُّنْيَا نَمُوتُ وَنَحْيَا وَمَا يُهْلِكُنَا إِلَّا الدَّهْرُ ۚ وَمَا لَهُم بِذَٰلِكَ مِنْ عِلْمٍ ۖ إِنْ هُمْ إِلَّا يَظُنُّونَ",
                    "transliteration": {
                        "en": "Wa qaaloo maa hiya illaa hayaatunad dunyaa namootu wa nahyaa wa maa yuhlikunaaa illad dahr; wa maa lahum bizaalika min 'ilmin in hum illaayazunnoon"
                    }
                },
                "translation": {
                    "en": "And they say, \"There is not but our worldly life; we die and live, and nothing destroys us except time.\" And they have of that no knowledge; they are only assuming.",
                    "id": "Dan mereka berkata, “Kehidupan ini tidak lain hanyalah kehidupan di dunia saja, kita mati dan kita hidup, dan tidak ada yang membinasakan kita selain masa.” Tetapi mereka tidak mempunyai ilmu tentang itu, mereka hanyalah menduga-duga saja."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4497",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4497.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4497.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan mereka, orang-orang musyrik dan yang mengingkari kebangkitan, berkata, “Ia, yakni kehidupan ini, tidak lain hanyalah kehidupan dunia kita saja, tidak ada kehidupan akhirat, sebahagian kita mati karena sampai ajalnya dan sebahagian kita hidup, yakni lahir lagi dan tidak ada yang membinasakan kita selain masa, yakni akhir dari kehidupan kita.” Tetapi mereka tidak mempunyai ilmu, yakni pengetahuan yang pasti, tentang itu, mereka hanyalah menduga-duga saja.",
                        "long": "Pada ayat ini Allah menjelaskan keingkaran orang-orang musyrik terhadap hari kebangkitan. Menurut anggapan mereka kehidupan itu hanya di dunia saja. Di dunia mereka dilahirkan dan di dunia pula mereka dimatikan dan di situlah akhir dari segala sesuatu, dan demikian pula terjadi pada nenek moyang mereka. Menurut mereka, yang menyebabkan kematian dan kebinasaan segala sesuatu ialah pertukaran masa. Dari pendapat mereka, dapat diambil kesimpulan bahwa mereka mengingkari terjadinya hari kebangkitan.\n\nKeterangan itu diperkuat oleh adat kebiasaan orang Arab Jahiliah yaitu apabila mereka ditimpa bencana atau musibah, terlontarlah kata-kata dari mulut mereka, \"Aduhai celakalah masa.\" Mereka mengumpat-umpat masa karena menurut mereka masa itulah sumber dari segala musibah.\n\nDalam hadis Qudsi dari Abu Hurairah, Rasulullah bersabda:\n\nAllah berfirman, \"Manusia telah menyakitiku dengan mengatakan wahai masa yang sial. Maka janganlah salah seorang kalian mengatakan 'masa yang sial karena Akulah (Pencipta dan Pengatur)masa. Aku menanti malam menjadi siang, dan jika Aku menghendakinya niscaya Aku genggam keduanya.\" (Riwayat Muslim)\n\nKemudian Allah menyayangkan sikap kaum musyrikin Mekah yang tidak didasarkan pada pengetahuan yang benar. Allah menyatakan bahwa mereka sama sekali tidak mempunyai pengetahuan sedikit pun tentang hal yang menyangkut masa itu. Pendapat mereka itu hanyalah didasarkan pada sangkaan dan dugaan saja."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4498,
                    "inSurah": 25
                },
                "meta": {
                    "juz": 25,
                    "page": 501,
                    "manzil": 6,
                    "ruku": 436,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِذَا تُتْلَىٰ عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ مَّا كَانَ حُجَّتَهُمْ إِلَّا أَن قَالُوا ائْتُوا بِآبَائِنَا إِن كُنتُمْ صَادِقِينَ",
                    "transliteration": {
                        "en": "Wa izaa tutlaa 'alaihim aayaatuna baiyinaatim maa kaana hujjatahum illaaa an qaalu'too bi aabaaa'inaaa in kuntum saadiqeen"
                    }
                },
                "translation": {
                    "en": "And when Our verses are recited to them as clear evidences, their argument is only that they say, \"Bring [back] our forefathers, if you should be truthful.\"",
                    "id": "Dan apabila kepada mereka dibacakan ayat-ayat Kami yang jelas, tidak ada bantahan mereka selain mengatakan, “Hidupkanlah kembali nenek moyang kami, jika kamu orang yang benar.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4498",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4498.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4498.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan apabila kepada mereka dibacakan ayat-ayat Kami yang sangat jelas pembuktiannya, yaitu ayat-ayat Al-Qur’an atau tanda-tanda keesaan dan kekuasaan Allah di alam ini, tidak ada bantahan mereka terhadap ayat-ayat itu selain mengatakan, “Datangkanlah atau hidupkanlah kembali, wahai para pembaca ayat-ayat itu, nenek moyang kami yang sudah mati, jika kamu orang yang benar meyakini bahwa di akhirat nanti ada kebangkitan.”",
                        "long": "Pada ayat ini, Allah menerangkan dan menegaskan bahwa pendapat mereka itu benar-benar berdasarkan dugaan dan sangkaan belaka, yang menjurus kepada pengingkaran terjadinya hari kebangkitan. Apabila dibacakan kepada mereka ayat-ayat Allah yang mengandung keterangan tentang bukti-bukti terjadinya hari kebangkitan, mereka tidak mau memahami keterangan yang dikemukakan itu, dan juga mereka menantang Rasulullah saw agar beliau menghidupkan kembali orang-orang yang telah mati. Jika hal itu dapat dilakukan oleh Rasulullah, barulah mereka mau beriman.\n\nDari sikap mereka yang demikian itu, dapat diambil kesimpulan bahwa mereka benar-benar telah dikendalikan oleh hawa nafsu mereka, tidak lagi mempergunakan pikiran mereka dengan baik sehingga mereka tidak mau menerima segala kebenaran yang disampaikan oleh Rasulullah saw, bahwa hari kebangkitan itu akan datang pada saat yang telah ditentukan yaitu setelah semua manusia yang hidup dimatikan dan jagat raya serta segala isinya hancur-lebur. Namun hal ini tidak membuat mereka mengerti dan mengakui."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4499,
                    "inSurah": 26
                },
                "meta": {
                    "juz": 25,
                    "page": 501,
                    "manzil": 6,
                    "ruku": 436,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "قُلِ اللَّهُ يُحْيِيكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يَجْمَعُكُمْ إِلَىٰ يَوْمِ الْقِيَامَةِ لَا رَيْبَ فِيهِ وَلَٰكِنَّ أَكْثَرَ النَّاسِ لَا يَعْلَمُونَ",
                    "transliteration": {
                        "en": "Qulil laahu yuhyeekum summa yumeetukum summa yajma'ukum ilaa Yawmil Qiyaamati laa raiba feehi wa laakinna aksaran naasi laa ya'lamoon"
                    }
                },
                "translation": {
                    "en": "Say, \"Allah causes you to live, then causes you to die; then He will assemble you for the Day of Resurrection, about which there is no doubt, but most of the people do not know.\"",
                    "id": "Katakanlah, “Allah yang menghidupkan kemudian mematikan kamu, setelah itu mengumpulkan kamu pada hari Kiamat yang tidak diragukan lagi; tetapi kebanyakan manusia tidak mengetahui.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4499",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4499.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4499.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Keingkaran mereka terhadap kebangkitan ini dibantah oleh Allah, Wahai Nabi Muhammad, Katakanlah kepada mereka yang mengingkari kebangkitan itu, ‘Allah yang Mahakuasa yang menciptakan dan menghidupkan kamu padahal kamu sebelumnya tidak ada, kemudian Dia pulalah yang mematikan kamu pada saat ajalmu datang, setelah itu Dia mengumpulkan kamu untuk dihisab pada hari Kiamat yang tidak diragukan lagi, pasti akan terjadi; tetapi kebanyakan manusia tidak mengetahui kekuasaan Allah untuk membangkitkan mereka.”",
                        "long": "Pada ayat ini Allah memerintahkan kepada Rasul-Nya agar menjelaskan kepada orang-orang musyrik Mekah, bahwa Allah-lah yang berkuasa menghidupkan dan mematikan makhluk-Nya. Dahulu mereka belum ada dan merupakan benda mati, sesudah itu atas kuasa Allah mereka dijadikan makhluk hidup di dunia untuk jangka waktu yang ditentukan. Apabila telah sampai waktu yang ditentukan itu, mereka pun dimatikan. Kemudian mereka dibangkitkan kembali pada hari Kiamat untuk mempertanggungjawabkan segala perbuatan yang telah mereka lakukan selama hidup di dunia.\n\nAllah menegaskan bahwa terjadinya hari Kiamat itu adalah suatu kejadian yang pasti, tidak ada keraguan sedikit pun. Jika Allah kuasa menghidupkan dan mematikan, tentu Dia kuasa pula menghidupkan dan menghimpun kembali bagian-bagian tubuh mereka yang telah hancur berserakan menjadi tanah. Mengulang kembali suatu perbuatan adalah lebih mudah daripada menciptakannya untuk pertama kali. Dan bagi Allah, tidak ada suatu perbuatan pun yang sukar.\n\nPada akhir ayat ini, Allah menyayangkan mengapa kebanyakan orang-orang musyrik tidak meyakini kebenaran adanya hari kebangkitan dan tetap mengingkarinya dengan alasan bahwa orang yang telah mati, yang tubuhnya telah hancur lebur bersama tanah, tulang-tulangnya telah berserakan tidak mungkin hidup kembali. Allah berfirman:\n\nDan sungguh, (hari) Kiamat itu pasti datang, tidak ada keraguan padanya; dan sungguh, Allah akan membangkitkan siapa pun yang di dalam kubur. (al-hajj/22: 7)"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4500,
                    "inSurah": 27
                },
                "meta": {
                    "juz": 25,
                    "page": 501,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلِلَّهِ مُلْكُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَيَوْمَ تَقُومُ السَّاعَةُ يَوْمَئِذٍ يَخْسَرُ الْمُبْطِلُونَ",
                    "transliteration": {
                        "en": "Wa lillaahi mulkus samaawaati wal ard; wa Yawma taqoomus Saa'atu Yawma 'iziny yakhsarul mubtiloon"
                    }
                },
                "translation": {
                    "en": "And to Allah belongs the dominion of the heavens and the earth. And the Day the Hour appears - that Day the falsifiers will lose.",
                    "id": "Dan milik Allah kerajaan langit dan bumi. Dan pada hari terjadinya Kiamat, akan rugilah pada hari itu orang-orang yang mengerjakan kebatilan (dosa)."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4500",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4500.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4500.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan hanya milik Allah, bukan miliki siapa-siapa, kerajaan langit dan bumi, Dialah yang menciptakan dan mengatur wujud seluruh alam. Dan pada hari terjadinya Kiamat, akan rugilah pada hari itu orang-orang yang mengerjakan kebatilan, yakni perbuatan dosa.",
                        "long": "Allah menjelaskan bahwa yang memiliki kekuasaan di langit dan di bumi ialah Allah. Tidak ada yang melebihi kekuasaan-Nya yang berlaku sesuai dengan kehendak-Nya. Tidak ada penguasa yang lain selain Dia dan tidak ada tuhan-tuhan lain yang pantas disembah selain-Nya. Kekuasaan-Nya meliputi seluruh alam; alam dunia dan alam akhirat. Allah juga berkuasa pada saat alam dunia berakhir dan mulainya hari akhirat. Pada saat itu manusia akan dibangkitkan dari alam kubur. Semua manusia akan digiring ke Padang Mahsyar untuk menghadapi ke pengadilan. Pada saat itu, perbuatan mereka akan diperiksa secara teliti. Tiap-tiap orang akan menerima catatan perbuatannya selama ia hidup di dunia, yang dibuat secara teliti oleh para malaikat pencatat amal. Pada hari itulah, tampak kemurungan orang-orang kafir yang mendustakan kebenaran ayat-ayat Allah. Kemurungan itu berubah menjadi kesengsaraan dan penderitaan yang amat berat ketika mereka diseret ke neraka Jahanam, disanalah mereka menampakkan penyesalan mereka, tetapi penyesalan itu tidak berguna lagi."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4501,
                    "inSurah": 28
                },
                "meta": {
                    "juz": 25,
                    "page": 501,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَتَرَىٰ كُلَّ أُمَّةٍ جَاثِيَةً ۚ كُلُّ أُمَّةٍ تُدْعَىٰ إِلَىٰ كِتَابِهَا الْيَوْمَ تُجْزَوْنَ مَا كُنتُمْ تَعْمَلُونَ",
                    "transliteration": {
                        "en": "Wa taraa kulla ummatin jaasiyah; kullu ummatin tud'aaa ilaa kitaabihaa al Yawma tujzawna maa kuntum ta'maloon"
                    }
                },
                "translation": {
                    "en": "And you will see every nation kneeling [from fear]. Every nation will be called to its record [and told], \"Today you will be recompensed for what you used to do.",
                    "id": "Dan (pada hari itu) engkau akan melihat setiap umat berlutut. Setiap umat dipanggil untuk (melihat) buku catatan amalnya. Pada hari itu kamu diberi balasan atas apa yang telah kamu kerjakan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4501",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4501.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4501.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan pada hari itu engkau, wahai Nabi Muhammad, akan melihat setiap umat, penganut agama dan kepercayaan apa pun, yang berbuat baik maupun yang berbuat jahat, berlutut di hadapan Allah untuk menghadapi hari yang dahsyat untuk di hisab dan di adili. Setiap umat dipanggil untuk menerima dan melihat buku catatan amalnya, yang baik dan yang buruk, yang besar maupun yang kecil, semuanya tercantum di dalamnya. Pada hari itu kamu di beri balasan sesuai dengan apa yang dahulu telah kamu kerjakan.",
                        "long": "Pada ayat ini, Allah menjelaskan keadaan manusia pada hari penentuan keputusan itu dan kedahsyatan huru-hara pada saat menunggu detik-detik yang menentukan, yaitu:\n\n1. Pada hari itu, manusia berlutut dan bersimpuh di hadapan Tuhan penguasa seluruh alam untuk menerima perhitungan amal perbuatan mereka dan menerima keputusan akhir yang akan ditetapkan atas mereka.\n\n2. Pada hari itu, mereka dipanggil melihat catatan mereka yang dibuat oleh para malaikat. Kemudian mereka memeriksa apakah ada di antara perbuatan mereka yang belum tercatat atau ada yang tercatat, tetapi tidak sesuai dengan yang telah mereka kerjakan. Apabila perbuatan mereka yang tercatat itu sesuai dengan yang diperintahkan oleh agama yang dibawa rasul mereka, maka mereka akan memperoleh kebahagiaan dan keberuntungan, sedangkan apabila tidak sesuai dengan perintah dan banyak melanggar larangan agama mereka, maka mereka akan memperoleh kecelakaan dan azab di neraka. Allah berfirman:\n\nDan bumi (Padang Mahsyar) menjadi terang benderang dengan cahaya (keadilan) Tuhannya; dan buku-buku (perhitungan perbuatan mereka) diberikan (kepada masing-masing), nabi-nabi dan saksi-saksi pun dihadirkan, lalu diberikan keputusan di antara mereka secara adil, sedang mereka tidak dirugikan. (az-Zumar/39: 69)\n\nPada ayat lain Allah berfirman:\n\nDan diletakkanlah kitab (catatan amal), lalu engkau akan melihat orang yang berdosa merasa ketakutan terhadap apa yang (tertulis) di dalamnya, dan mereka berkata, \"Betapa celaka kami, kitab apakah ini, tidak ada yang tertinggal, yang kecil dan yang besar melainkan tercatat semuanya,\" dan mereka dapati (semua) apa yang telah mereka kerjakan (tertulis). Dan Tuhanmu tidak menzalimi seorang jua pun. (al-Kahf/18: 49)\n\nPada saat itu, manusia mendapat panggilan. Kepada mereka diberitahukan bahwa pada hari itulah mereka akan menerima balasan dari amal perbuatan mereka masing-masing dengan balasan yang setimpal."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4502,
                    "inSurah": 29
                },
                "meta": {
                    "juz": 25,
                    "page": 501,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "هَٰذَا كِتَابُنَا يَنطِقُ عَلَيْكُم بِالْحَقِّ ۚ إِنَّا كُنَّا نَسْتَنسِخُ مَا كُنتُمْ تَعْمَلُونَ",
                    "transliteration": {
                        "en": "Haazaa kitaabunaa yantiqu 'alaikum bilhaqq; innaa kunnaa nastansikhu maa kuntum ta'maloon"
                    }
                },
                "translation": {
                    "en": "This, Our record, speaks about you in truth. Indeed, We were having transcribed whatever you used to do.\"",
                    "id": "(Allah berfirman), “Inilah Kitab (catatan) Kami yang menuturkan kepadamu dengan sebenar-benarnya. Sesungguhnya Kami telah menyuruh mencatat apa yang telah kamu kerjakan.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4502",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4502.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4502.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Ketika kitab amal itu di serahkan kepada setiap umat, Allah berfirman, “Inilah kitab catatan Kami yang menuturkan kepadamu segala sesuatu yang telah kamu kerjakan di dunia dahulu dengan sebenar-benar-nya tanpa di kurangi dan di tambah sedikit pun. Sesungguhnya Kami telah menyuruh para malaikat pencatat amal untuk mencatat apa yang dahulu telah kamu kerjakan.”",
                        "long": "Allah menyatakan firman-Nya kepada seluruh umat manusia bahwa kitab-kitab yang memuat catatan amal perbuatan itu adalah kitab yang benar, tidak ada suatu pun kesalahan terdapat di dalamnya, dibuat atas dasar perintah Allah Yang Mahakuasa, yang menjadi dasar pertimbangan untuk menentukan keputusan bagi umat manusia.\n\nAllah juga menyatakan bahwa pada saat orang itu hidup di dunia, telah dikerahkan para pencatat amal perbuatan, baik perbuatan yang baik maupun perbuatan yang buruk. Catatan itu tidak mungkin salah karena dibuat dengan ketelitian yang tinggi sebagai alat bukti yang tidak dapat diragukan kebenarannya"
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4503,
                    "inSurah": 30
                },
                "meta": {
                    "juz": 25,
                    "page": 501,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَأَمَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَيُدْخِلُهُمْ رَبُّهُمْ فِي رَحْمَتِهِ ۚ ذَٰلِكَ هُوَ الْفَوْزُ الْمُبِينُ",
                    "transliteration": {
                        "en": "Fa ammal lazeena aamaanoo wa 'amilus saalihaati fayudkhiluhum Rabbuhum fee rahmatih; zaalika huwal fawzul mubeen"
                    }
                },
                "translation": {
                    "en": "So as for those who believed and did righteous deeds, their Lord will admit them into His mercy. That is what is the clear attainment.",
                    "id": "Maka adapun orang-orang yang beriman dan mengerjakan kebajikan, maka Tuhan memasukkan mereka ke dalam rahmat-Nya (surga). Demikian itulah kemenangan yang nyata."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4503",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4503.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4503.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka adapun orang-orang yang beriman kepada Allah dan rasul-Nya serta mengerjakan kebajikan-kebajikan yang telah di perintahkan Allah dan rasul-Nya, maka Tuhan memasukkan mereka ke dalam rahmat-Nya, yakni surga. Demikian itulah kemenangan yang nyata yang di peroleh oleh orang-orang beriman.",
                        "long": "Kemudian Allah menjelaskan keadaan orang-orang yang beriman dan yang melakukan amal saleh. Mereka itu akan mendapat balasan yang setimpal dengan amal perbuatannya. Mereka itu termasuk hamba Allah yang memperoleh limpahan rahmat-Nya.\n\nYang dimaksud dengan rahmat Allah dalam ayat ini adalah surga. Hal ini sesuai dengan maksud hadis yang diriwayatkan oleh Abu Hurairah:\n\n…)\n\nSesungguhnya Allah berkata kepada surga, \"Engkau adalah rahmat-Ku. Dengan kamu Aku melimpahkan Kasih sayang-Ku kepada orang-orang yang Aku kehendaki.\" (Riwayat al-Bukhari dan Muslim)\n\nPada bagian akhir ayat ini, Allah menegaskan bahwa surga itu merupakan kebahagiaan yang akan dicapai oleh orang-orang yang beriman karena nikmatnya yang berlimpah-limpah yang akan dirasakan penghuninya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4504,
                    "inSurah": 31
                },
                "meta": {
                    "juz": 25,
                    "page": 501,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَأَمَّا الَّذِينَ كَفَرُوا أَفَلَمْ تَكُنْ آيَاتِي تُتْلَىٰ عَلَيْكُمْ فَاسْتَكْبَرْتُمْ وَكُنتُمْ قَوْمًا مُّجْرِمِينَ",
                    "transliteration": {
                        "en": "Wa ammal lazeena kafarooo afalam takun Aayaatee tutlaa 'alaikum fastakbartum wa kuntum qawmam mujrimeen"
                    }
                },
                "translation": {
                    "en": "But as for those who disbelieved, [it will be said], \"Were not Our verses recited to you, but you were arrogant and became a people of criminals?",
                    "id": "Dan adapun (kepada) orang-orang yang kafir (difirmankan), “Bukankah ayat-ayat-Ku telah dibacakan kepadamu tetapi kamu menyombongkan diri dan kamu menjadi orang-orang yang berbuat dosa?”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4504",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4504.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4504.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan adapun kepada orang-orang yang kafir, Allah mengatakan kepada mereka, “Bukankah dahulu sewaktu kamu di dunia ayat-ayat-Ku telah di bacakan kepadamu oleh para rasul utusan-Ku, tetapi kamu tetap membangkang, mengingkari, dan menyombongkan diri dari ayat-ayat-Ku dan kamu tetap menjadi orang-orang yang berbuat dosa?”",
                        "long": "Pada ayat ini Allah menjelaskan keadaan orang-orang yang mengingkari keesaan-Nya. Mereka itu selalu menerima cemoohan dan penghinaan karena kepada mereka telah didatangkan utusan Allah yang telah membacakan ayat-ayat-Nya, tetapi mereka bersikap sombong dan keras kepala.\n\nKarena itu mereka akan merasakan siksa Allah yang menghinakan disebabkan oleh perbuatan dosa yang telah mereka kerjakan. Pada saat itulah, mereka tergagap karena melihat kenyataan yang dahulu mereka dustakan."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4505,
                    "inSurah": 32
                },
                "meta": {
                    "juz": 25,
                    "page": 501,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَإِذَا قِيلَ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَالسَّاعَةُ لَا رَيْبَ فِيهَا قُلْتُم مَّا نَدْرِي مَا السَّاعَةُ إِن نَّظُنُّ إِلَّا ظَنًّا وَمَا نَحْنُ بِمُسْتَيْقِنِينَ",
                    "transliteration": {
                        "en": "Wa izaa qeela inna wa'dallaahi haqqunw was Saa'atu laa raiba feehaa qultum maa nadree mas Saa'atu in nazunnu illaa zannanw wa maa nahnu bimustaiqineen"
                    }
                },
                "translation": {
                    "en": "And when it was said, 'Indeed, the promise of Allah is truth and the Hour [is coming] - no doubt about it,' you said, 'We know not what is the Hour. We assume only assumption, and we are not convinced.' \"",
                    "id": "Dan apabila dikatakan (kepadamu), “Sungguh, janji Allah itu benar, dan hari Kiamat itu tidak diragukan adanya,” kamu menjawab, “Kami tidak tahu apakah hari Kiamat itu, kami hanyalah menduga-duga saja, dan kami tidak yakin.”"
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4505",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4505.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4505.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan apabila di katakan kepadamu oleh siapa pun, “Sungguh, janji Allah Yang Mahakuasa itu adalah benar, dan hari Kiamat yang merupakan salah satu janji-Nya itu tidak di ragukan lagi adanya,” kamu menjawab, “Kami tidak tahu apakah hari Kiamat itu, persoalan hari Kiamat itu adalah sesuatu yang kami tidak mengerti, kami sekali-kali tidak lain hanyalah menduga-duga saja, pengetahuan kami tentang itu sangat terbatas dan kami tidak meyakininya.”",
                        "long": "Pada ayat ini, Allah menjelaskan penyesalan orang-orang yang mengingkari terjadinya hari kebangkitan. Sewaktu masih di dunia, apabila disampaikan kepada mereka berita tentang terjadinya hari kebangkitan, mereka beranggapan bahwa berita hari kebangkitan itu adalah berita yang aneh dan mustahil. Bagi mereka mustahil membangkitkan orang yang telah mati yang tulang-tulangnya telah berserakan dan seluruh tubuhnya telah hancur menjadi tanah. Tetapi nanti setelah mereka menghadapi kenyataan dan berhadapan dengan siksa yang sangat mengerikan, barulah mereka menyesali sikap dan perbuatan mereka dahulu yang semata-mata didasarkan atas dugaan dan prasangka belaka, tidak berdasarkan ilmu pengetahuan dan kepercayaan kepada Allah Yang Maha Penguasa Semesta Alam."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4506,
                    "inSurah": 33
                },
                "meta": {
                    "juz": 25,
                    "page": 502,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَبَدَا لَهُمْ سَيِّئَاتُ مَا عَمِلُوا وَحَاقَ بِهِم مَّا كَانُوا بِهِ يَسْتَهْزِئُونَ",
                    "transliteration": {
                        "en": "Wa badaa lahum saiyiaatu maa 'amiloo wa haaqa bihim maa kaanoo bihee yastahzi'oon"
                    }
                },
                "translation": {
                    "en": "And the evil consequences of what they did will appear to them, and they will be enveloped by what they used to ridicule.",
                    "id": "Dan nyatalah bagi mereka keburukan-keburukan yang mereka kerjakan, dan berlakulah (azab) terhadap mereka yang dahulu mereka perolok-olokkan."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4506",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4506.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4506.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan apa yang mereka nyatakan di dalam ayat di atas maka nyatalah bagi mereka keburukan-keburukan yang mereka kerjakan, dan berlakulah azab terhadap mereka yang dahulu mereka perolok-olokkan.",
                        "long": "Kemudian Allah menjelaskan keadaan kaum musyrikin ketika kejahatan mereka telah terungkap dengan jelas. Mereka tergagap menghadapi tanggung jawab yang begitu besar. Mereka merasa takut melihat dosa mereka yang bertumpuk-tumpuk yang harus mereka tebus dengan siksaan neraka yang sangat mereka takuti. Mereka menyadari pula saat itu bahwa tidak ada seorang pun yang dapat membela mereka; kekuasaan mereka selama di dunia, harta benda yang melimpah ruah, anak cucu mereka, teman bersekongkol, dan sebagainya semuanya tidak ada artinya pada waktu itu. Satu-satunya pilihan yang dapat mereka ambil waktu itu hanyalah menunggu keputusan dan pasrah untuk menerima azab Allah."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4507,
                    "inSurah": 34
                },
                "meta": {
                    "juz": 25,
                    "page": 502,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَقِيلَ الْيَوْمَ نَنسَاكُمْ كَمَا نَسِيتُمْ لِقَاءَ يَوْمِكُمْ هَٰذَا وَمَأْوَاكُمُ النَّارُ وَمَا لَكُم مِّن نَّاصِرِينَ",
                    "transliteration": {
                        "en": "Wa qeelal yawma nansaakum kamaa naseetum liqaaa'a yawmikum haazaa wa maawaakumun Naaru wa maa lakum min naasireen"
                    }
                },
                "translation": {
                    "en": "And it will be said, \"Today We will forget you as you forgot the meeting of this Day of yours, and your refuge is the Fire, and for you there are no helpers.",
                    "id": "Dan kepada mereka dikatakan, “Pada hari ini Kami melupakan kamu sebagaimana kamu telah melupakan pertemuan (dengan) harimu ini; dan tempat kembalimu ialah neraka dan se-kali-kali tidak akan ada penolong bagimu."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4507",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4507.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4507.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan ketika itu kepada mereka di katakan, “Pada hari ini Kami memperlakukan kamu dengan perlakuan orang yang melupakan kamu sebagaimana kamu dahulu ketika di dunia telah melupakan pertemuanmu dengan harimu ini, yakni hari yang amat celaka bagimu; dan akibat dari perbuatan dosa yang kamu lakukan dahulu di dunia maka tempat kembalimu sekarang ialah neraka dan sekali-kali tidak akan ada penolong bagimu dalam menghadapi semua siksaan di neraka itu.",
                        "long": "Pada ayat ini, Allah menjelaskan cemoohan, penghinaan dan azab yang mereka tanggungkan pada hari Kiamat itu. Pada hari itu, Allah tidak akan menghiraukan jerit dan tangis mereka, ratapan dan penyesalan mereka karena semua yang mereka alami itu benar-benar sebagai pembalasan yang seimbang dengan perbuatan mereka di dunia dahulu.\n\nDi dunia mereka menganiaya dan memfitnah orang yang tidak bersalah, menghalalkan yang haram untuk kepentingan pribadi dan kelompok mereka; Allah akan memberikan balasan yang setimpal dengan amal mereka semua di akhirat nanti.\n\nJika Allah bersikap tidak mengacuhkan mereka karena sikap angkuh dan sombong yang telah mereka lakukan, serta sikap yang tidak berperikemanusiaan yang telah mereka lakukan. Maka sikap yang demikian itu adalah balasan yang wajar sesuai dengan keadilan-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4508,
                    "inSurah": 35
                },
                "meta": {
                    "juz": 25,
                    "page": 502,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "ذَٰلِكُم بِأَنَّكُمُ اتَّخَذْتُمْ آيَاتِ اللَّهِ هُزُوًا وَغَرَّتْكُمُ الْحَيَاةُ الدُّنْيَا ۚ فَالْيَوْمَ لَا يُخْرَجُونَ مِنْهَا وَلَا هُمْ يُسْتَعْتَبُونَ",
                    "transliteration": {
                        "en": "Zaalikum bi annakumut takhaztum aayaatil laahi huzuwanw wa gharratkumul hayaatud dunyaa; fal yawma laa yukhrajoona minhaa wa laahum yusta'taboon"
                    }
                },
                "translation": {
                    "en": "That is because you took the verses of Allah in ridicule, and worldly life deluded you.\" So that Day they will not be removed from it, nor will they be asked to appease [Allah].",
                    "id": "Yang demikian itu, karena sesungguhnya kamu telah menjadikan ayat-ayat Allah sebagai olok-olokan dan kamu telah ditipu oleh kehidupan dunia.” Maka pada hari ini mereka tidak dikeluarkan dari neraka dan tidak pula mereka diberi kesempatan untuk bertobat."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4508",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4508.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4508.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Yang demikian itu, yakni apa yang kamu alami sekarang ini, karena sesungguhnya kamu telah menjadikan ayat-ayat Allah yang telah di bacakan kepadamu sewaktu di dunia dahulu sebagai olok-olokan dan kamu telah di tipu oleh kehidupan dunia.” Maka untuk menjalani siksaan yang amat pedih pada hari ini mereka tidak dikeluarkan dari neraka dan tidak pula mereka di beri kesempatan untuk bertobat karena masa untuk bertobat telah berlalu.",
                        "long": "Pada ayat ini Allah menjelaskan mengapa orang-orang kafir itu harus menerima siksaan dan azab yang mengerikan itu, sebabnya ialah:\n\n1. Karena waktu mereka hidup di dunia, mereka memperolok-olok ayat-ayat Allah yang disampaikan kepada mereka melalui Rasul-Nya. Sikap ini dianggap sebagai sikap yang penuh keangkuhan dan kesombongan. Mereka juga ingin mendangkalkan iman yang telah meresap dalam dada kaum Muslimin dengan berbagai macam dalih dan cara.\n\n2. Mereka telah tertipu oleh kenikmatan hidup di dunia, sehingga mereka melupakan kehidupan akhirat yang menjadi tujuan akhir kehidupan manusia.\n\nItulah sebabnya ketika Allah menjatuhkan keputusan-Nya, tidak ada kemungkinan bagi mereka untuk melepaskan diri dari azab dan tidak ada lagi ampunan bagi mereka."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4509,
                    "inSurah": 36
                },
                "meta": {
                    "juz": 25,
                    "page": 502,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "فَلِلَّهِ الْحَمْدُ رَبِّ السَّمَاوَاتِ وَرَبِّ الْأَرْضِ رَبِّ الْعَالَمِينَ",
                    "transliteration": {
                        "en": "Falillaahil hamdu Rabbis samaawaati wa Rabbil ardi Rabbil-'aalameen"
                    }
                },
                "translation": {
                    "en": "Then, to Allah belongs [all] praise - Lord of the heavens and Lord of the earth, Lord of the worlds.",
                    "id": "Segala puji hanya bagi Allah, Tuhan (pemilik) langit dan bumi, Tuhan seluruh alam."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4509",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4509.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4509.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Maka segala puji hanya bagi Allah, Tuhan pencipta, pemilik, dan pemelihara langit dan bumi, Tuhan Yang Mahakuasa atas seluruh alam.",
                        "long": "Kedua ayat ini merupakan ayat penutup Surah al-Jatsiyah. Dalam ayat-ayat ini Allah menyebutkan beberapa sifat-Nya yang ada hubungannya dengan dasar-dasar pengambilan keputusan di hari Kiamat nanti, yaitu:\n\n1. Dia Maha Terpuji, karena itu bagi-Nyalah segala puji. Ungkapan ini memberikan pengertian bahwa segala nikmat apa pun yang diperoleh manusia selama hidup di dunia berasal dari Allah agar manusia dapat melaksanakan tugasnya sebagai khalifah-Nya di bumi, bukan untuk berbuat sewenang-wenang dan memperturutkan hawa nafsu. Jika manusia tidak mensyukuri nikmat itu dan tidak mempergunakan nikmat itu menurut yang semestinya, tentulah orang itu akan mendapat murka dan azab-Nya.\n\n2. Allah Mahakuasa, Dia menguasai semesta alam. Perkataan ini memberikan pengertian bahwa segala sesuatu yang ada di langit dan di bumi berada dalam kekuasaan-Nya. Dia menguasai dunia dan akhirat.\n\n3. Dia Mahaagung, karena keagungan dan keangkuhan hanya bagi Allah di langit dan di bumi dan kekuasaan-Nya berada di atas segala kekuasaan.\n\n4. Dia Mahaperkasa, keputusan-Nya tidak dapat ditolak, tidak dapat diubah oleh siapa pun, dan tidak ada yang dapat menandingi kekuasaan-Nya itu.\n\n5. Dia Mahabijaksana. Maksudnya: Allah dalam menetapkan perintah-Nya kepada seluruh makhluk-Nya, selalu disertai aturan, perhitungan, dan berhasil serta pasti, terjadi sesuai dengan yang dikehendaki-Nya."
                    }
                }
            },
            {
                "number": {
                    "inQuran": 4510,
                    "inSurah": 37
                },
                "meta": {
                    "juz": 25,
                    "page": 502,
                    "manzil": 6,
                    "ruku": 437,
                    "hizbQuarter": 200,
                    "sajda": {
                        "recommended": false,
                        "obligatory": false
                    }
                },
                "text": {
                    "arab": "وَلَهُ الْكِبْرِيَاءُ فِي السَّمَاوَاتِ وَالْأَرْضِ ۖ وَهُوَ الْعَزِيزُ الْحَكِيمُ",
                    "transliteration": {
                        "en": "Wa lahul kibriyaaa'u fissamaawaati wal ardi wa Huwal 'Azeezul Hakeem"
                    }
                },
                "translation": {
                    "en": "And to Him belongs [all] grandeur within the heavens and the earth, and He is the Exalted in Might, the Wise.",
                    "id": "Dan hanya bagi-Nya segala keagungan di langit dan di bumi, dan Dialah Yang Mahaperkasa, Mahabijaksana."
                },
                "audio": {
                    "primary": "https://cdn.alquran.cloud/media/audio/ayah/ar.alafasy/4510",
                    "secondary": [
                        "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4510.mp3",
                        "https://cdn.islamic.network/quran/audio/64/ar.alafasy/4510.mp3"
                    ]
                },
                "tafsir": {
                    "id": {
                        "short": "Dan hanya bagi-Nya segala kebesaran dan ke agungan di langit dan di bumi, dan Dialah Yang Mahaperkasa dalam kekuasaan-Nya, Mahabijaksana dalam pengaturan-Nya.",
                        "long": "Kedua ayat ini merupakan ayat penutup Surah al-Jatsiyah. Dalam ayat-ayat ini Allah menyebutkan beberapa sifat-Nya yang ada hubungannya dengan dasar-dasar pengambilan keputusan di hari Kiamat nanti, yaitu:\n\n1. Dia Maha Terpuji, karena itu bagi-Nyalah segala puji. Ungkapan ini memberikan pengertian bahwa segala nikmat apa pun yang diperoleh manusia selama hidup di dunia berasal dari Allah agar manusia dapat melaksanakan tugasnya sebagai khalifah-Nya di bumi, bukan untuk berbuat sewenang-wenang dan memperturutkan hawa nafsu. Jika manusia tidak mensyukuri nikmat itu dan tidak mempergunakan nikmat itu menurut yang semestinya, tentulah orang itu akan mendapat murka dan azab-Nya.\n\n2. Allah Mahakuasa, Dia menguasai semesta alam. Perkataan ini memberikan pengertian bahwa segala sesuatu yang ada di langit dan di bumi berada dalam kekuasaan-Nya. Dia menguasai dunia dan akhirat.\n\n3. Dia Mahaagung, karena keagungan dan keangkuhan hanya bagi Allah di langit dan di bumi dan kekuasaan-Nya berada di atas segala kekuasaan.\n\n4. Dia Mahaperkasa, keputusan-Nya tidak dapat ditolak, tidak dapat diubah oleh siapa pun, dan tidak ada yang dapat menandingi kekuasaan-Nya itu.\n\n5. Dia Mahabijaksana. Maksudnya: Allah dalam menetapkan perintah-Nya kepada seluruh makhluk-Nya, selalu disertai aturan, perhitungan, dan berhasil serta pasti, terjadi sesuai dengan yang dikehendaki-Nya."
                    }
                }
            }
        ]
    }
}